import React, { useState, useEffect } from 'react';
import { useNavigate } from 'react-router-dom';
import './stories.css'
import kamar from '../../images/kamar.png'


const Abraham = () => {

  const navigate = useNavigate();

  // const [search, setSearch] = useState('')


  const [windowWidth, setWindowWidth] = useState(window.innerWidth);
  const [visibleBubbles, setVisibleBubbles] = useState({});

  useEffect(() => {
    const handleResize = () => {
      setWindowWidth(window.innerWidth);
    };

    window.addEventListener('resize', handleResize);

    const initialVisibility = {};
    const numberOfCases = 12;

    for (let i = 1; i <= numberOfCases; i++) {
      initialVisibility[i] = window.innerWidth > 970;
      // console.log(initialVisibility[i])
    }
    setVisibleBubbles(initialVisibility);

    return () => window.removeEventListener('resize', handleResize);
  }, []);

  const handleSupClick = (index) => {
    setVisibleBubbles(prevState => ({
      ...prevState,
      [index]: !prevState[index]
    }));
  };

  return (

    <div className="minister-home stories">
      <div className="separate_into_two_columns">
        <main className="sep_part1">

          <div className='chapter_heading'>
            <div className="kamar">
              <img src={kamar} alt="" />
            </div>
            <div className="img_container">
              <svg

                fill='rgb(175, 157, 0)'
                version="1.1" viewBox="0 0 837 837" xmlns="http://www.w3.org/2000/svg">
                <path d="m285 818c0.124-2.92 8.2-8.44 50.5-34.5 4.4-2.71 9.01-5.87 10.2-7.01 3.17-2.94 3.97-1.41 1.3 2.49-1.43 2.09-6.82 5.98-14.9 10.7-22.3 13.2-41.1 25.1-44 27.8-1.46 1.39-3.2 1.67-3.15 0.505zm112-9.82c-3.78-2.79-3.86-4.33-6.54-0.93-2.51 3.17-4.46 1.76-7.85-1.02l-2.99-2.44 2.18-2.18c1.01-1.44 2.42-2.56 2.42-2.56 1.03 2.01 1.4 1.93 3.19 3.34 5.5 4.54 4.34 3.55 6.69 0.366 0.818-1.11 1.75-3.04 2.66-2.37 3.14 2.28 8.75 4.74 7.38 7.3-1.58 2.96-3.62 3.1-7.13 0.504zm59-23.3c-4.33-1.37-7.65-4.03-8.93-7.13-1.53-3.69-2-3.65-4.48 0.337-5.16 8.28-18.5 7.7-18.5-0.801 0-3.71-1.76-3.93-7.27-0.937-15.3 8.33-45.1 10.7-57.7 4.63-8.34-4.03-10.4-15-5.62-29.9 2.55-7.95-6.47 0.239-14 12.7-10.4 17.2-21.4 20.2-24 6.5-1.13-6.02 3.79-22.5 6.73-22.5 0.538 0 0.0948 1.24-0.986 2.76-4.71 6.61-4.9 15.7-0.406 19.3 5.68 4.47 11 1.71 18.3-9.4 7.05-10.8 13.5-17.6 16.7-17.6 1.56 0 2.3 0.463 2.01 1.25-5.31 14.4-5.85 21-2.14 26.1 7.8 10.7 47.5 10.2 65.7-0.805 3.1-1.87 5.69-3.09 5.74-2.72 0.0533 0.372 0.0195 2.36-0.075 4.41-0.3 6.51 8.04 8.79 14.1 3.86 2.33-1.89 2.37-2.22 2.14-16.7-0.266-16.3-0.719-17.6-4.93-14.6-1.55 1.09-8.9 5.69-16.3 10.2-7.42 4.53-14.5 9.13-15.7 10.2-2.75 2.54-4.74 1.98-2.5-0.702 2.67-3.19 8.71-7.49 23.2-16.5 15.1-9.38 14.9-9.25 14.5-12.9-1.59-13-1.49-16.2 0.631-21.1 3.1-7.21 3.43-6.43 3.18 7.64-0.287 16.2 0.221 16.7 8.96 8.56 1.51-1.4 3.02-2.26 3.37-1.92 1.26 1.26-3.22 7.11-7.11 9.29-2.2 1.23-3.98 2.62-3.95 3.09 1.78 35.5 3.81 39.6 19.7 39.5 7.59-0.0363 7.74-0.265 3.37-5.11-4.23-4.68-4.41-6.04-1.48-10.8 4.54-7.35 13-10.7 19.1-7.62 7.41 3.76 7.2 5.89-0.367 3.67-8.46-2.48-18.4 1.18-15.8 5.86 5.52 10.3 13.3 12.6 28.2 8.22 2.59-0.763 2.21 2.29-0.5 3.98-1.24 0.774-4.63 1.7-7.55 2.06s-9.44 1.72-14.5 3.03c-11.3 2.93-17.4 3.7-20.8 2.63zm-218-8.33c2.1-3.21 8.65-7.98 25-18.2 7.86-4.91 19.4-12.2 25.7-16.3 6.25-4.05 11.6-7.14 11.9-6.86 1.21 1.21-3.37 6.04-8.93 9.42-5.58 3.4-15 9.2-37.3 23-4.95 3.05-10.6 6.82-12.6 8.37-4.4 3.41-5.61 3.6-3.63 0.572zm216-13c1.56-2.4 20-15.1 37.4-25.8 5.84-3.58 12.8-7.93 15.5-9.68 2.67-1.75 4.86-2.78 4.86-2.3 0 3.08-3.23 6.11-11.8 11.1-11.6 6.73-26.7 16.1-37.8 23.5-8.95 5.96-10.3 6.5-8.17 3.16zm59.8-3.24c0-0.27 1.41-3.64 3.13-7.48l3.13-6.99 14.4-8.02c7.92-4.41 14.7-8.02 15-8.02 0.316 0 1.77-0.834 3.23-1.85 1.46-1.02 6.25-3.78 10.7-6.14 8.04-4.31 14-7.54 27-14.5 3.85-2.07 9.02-4.89 11.5-6.26s7.65-4.18 11.5-6.24c18.5-9.87 45.2-25.2 71-40.7 21.2-12.8 27.2-16.6 33-21.1 9.18-7.22 9.51-7.42 11-6.84 5.33 2.05-11.4 22.7-22.8 28.1-3.98 1.89-8.36 4.28-9.73 5.32-5.87 4.43-55.4 35-60.2 37.3-1.51 0.688-2.75 1.63-2.75 2.09 0 0.462-0.423 0.839-0.94 0.839-0.517 0-4.66 2.23-9.2 4.96s-9.52 5.24-11.1 5.58c-1.54 0.339-2.8 1.03-2.8 1.54 0 0.506-0.638 0.921-1.42 0.921s-3.59 1.08-6.25 2.41c-2.66 1.32-10 4.9-16.3 7.95s-14.4 7.19-18 9.19c-12.2 6.85-17.9 9.61-20.5 9.89-1.4 0.154-3.33 0.959-4.28 1.79-0.95 0.829-3.53 2.33-5.73 3.32-2.2 0.999-6.86 3.53-10.4 5.63-3.49 2.1-6.73 3.81-7.18 3.81-0.457 0-1.12 0.9-1.47 2-0.538 1.7-3.5 2.97-3.5 1.51zm-132-7.51c-0.977-2.75-2.21-5-2.73-5-0.527 0-0.959-0.708-0.959-1.57 0-3.19 3.42-0.945 4.31 2.83 1.15 4.88 1.74 4.7 4.37-1.28 2.08-4.74 5-6.84 5.31-3.48 0.399 4.32 0.01 3.69-1.21 1.62-0.0826-0.14-0.338-0.124-0.68-0.124-1.98 0-5.11 6.14-5.11 10 0 3.48-1.48 2.13-3.31-3.02zm85.5-5.75c-0.937-1.78-2.4-8.02-8.71-37.2-3.32-15.3-4.68-23.6-11-67-1.32-9.08-3.13-21-4.04-26.5-0.908-5.5-1.87-11.4-2.14-13.2-0.463-3-0.184-3.34 4.81-5.87 2.92-1.48 7.02-3.82 9.12-5.21 4.67-3.09 4.1-4 6.19 9.76 0.96 6.32 1.96 12.6 2.22 14 0.263 1.38 0.927 5.88 1.48 10s1.62 10.6 2.39 14.5c1.37 6.87 2.69 17.1 6.07 47 3.48 30.8-0.782 70.5-6.42 59.8zm-256-1.02c0.55-0.55 5.5-3.37 11-6.26 22.6-11.9 34.3-21 39.2-30.4 3.25-6.27 14.3-17.6 17.3-17.6 4.61 0 7.93 13.9 4.5 18.8-2.09 2.98-6.05 2.85-10.8-0.343-5.11-3.47-6.67-2.89-10.2 3.77-6.57 12.4-21.7 23.4-38 27.8-4.25 1.14-9.13 2.78-10.9 3.65s-2.68 1.13-2.13 0.576zm69.5-40.8c0-3.14-3.54-7.48-5.88-7.2-3.71 0.432-3.66 2.93 0.116 5.55 3.1 2.16 5.77 2.92 5.77 1.65zm42 25.7c-5.76-1.75-11-7.7-11-12.5 0-2.52-1.04-1.84-6.57 4.28-5.4 5.97-9.97 8.28-16 8.1-2.88-0.0858-2.88-0.0872-0.384-0.893 19.7-6.34 22.8-13.7 21.2-49.3l-0.718-15.8-6 3.66c-3.3 2.01-7.69 4.73-9.76 6.04l-3.76 2.39 5.17 6.73c6.95 9.05 9.09 14.2 9.46 22.7 0.289 6.72 0.266 6.8-0.528 1.87-0.875-5.43-3.53-9.91-12.8-21.6-6.04-7.61-5.5-7.3-8.8-5.13-3.18 2.09-3.65-0.675-0.485-2.89 1.94-1.36 1.92-1.47-1.04-5.5-5.72-7.78-9.81-16.8-9.5-20.9 0.378-5.07 1.78-5.05 3.27 0.0494 1.51 5.14 4.53 10.7 9.14 16.9 4.03 5.38 4.22 5.45 7.94 2.87 1.49-1.03 6.24-4.07 10.6-6.74l7.85-4.86-0.495-5.01c-0.349-3.53-0.0206-5.82 1.11-7.76 2.42-4.14 3.18-3.37 3.18 3.25 0 3.3 0.298 6 0.662 6 1.64 0 20.4-11.6 21.5-13.4 1.53-2.28 1.85 0.418 0.383 3.25-1.1 2.14-4.53 4.71-11.6 8.7-12.4 6.99-11 2.58-10.1 33.8 0.846 30 0.911 30.2 8.72 34.2 8.5 4.27 33 1.59 40.7-4.46 3.16-2.49 3.7-2.52 3.09-0.2-0.815 3.12 2.82 4.8 9.38 4.34 1.22-0.0855 3.87-1.61 5.89-3.38 3.15-2.77 3.58-2.92 2.99-1.07-0.477 1.5-0.164 2.44 1.04 3.11 2.34 1.31 7.12-0.448 7.9-2.9 0.835-2.63 2.13-2.4 2.86 0.504 1.09 4.34 9.06 4.36 12.7 0.0301 1.74-2.09 1.75-7.74 0.129-41.7-1.01-21.1-0.961-24.2 0.455-27.8 1.7-4.24 3.37-5.25 3.37-2.03 0 1.07 0.528 3.11 1.17 4.53 0.897 1.97 0.897 2.85 0 3.75-1.3 1.3-1.49 28.1-0.323 44.7 1.39 19.8-9.67 34.3-20 26.2-2.13-1.68-2.71-1.74-4.88-0.535-3.06 1.69-6.2 1.8-7.73 0.27-0.889-0.889-2.08-0.753-5.02 0.571-5.33 2.4-11.4 1.83-12.7-1.2-1.11-2.55-1.16-2.54-10.2 1.24-10 4.21-24.1 5.83-31.3 3.62zm107-31.2c-1.85-48.5-1.69-53.8 1.61-53.8 1.57 0 3.11 8.17 2 10.6-0.717 1.57-0.704 11.6 0.0397 32.6 1.03 29 0.729 36.2-1.68 40.5-0.431 0.77-1.32-12.7-1.98-29.9zm-94.2 12.4c0-2.3 4.28-5.81 16.7-13.7 27.8-17.7 31.9-20.3 35.8-22.5 2.2-1.28 5.27-3.36 6.83-4.64 4.02-3.29 4.93-2.87 2.54 1.18-1.46 2.48-4.87 5.13-11.7 9.1-5.31 3.08-11.9 7.06-14.7 8.85-2.75 1.79-9.42 5.91-14.8 9.15-5.4 3.24-12 7.58-14.8 9.65-5.14 3.89-5.92 4.28-5.92 2.97zm-94.8-5.42c-2.81-2.81 0.0475-10 4.98-15.4 15.2-16.6 10.2-10.6-0.546 1.93-4.97 5.77-5.04 13.2-0.588 9.13 1.55-1.4 1.77-1.38 2.39 0.239 1.17 3.05-3.93 6.41-6.24 4.1zm138-7.59c0-1.52 1.87-6.13 3.02-8.21 0.521-0.943 0.724-0.0981 0.724-0.0981-0.973 2.61-2.19 7.21-1.67 8.37 1.26 2.83 6.9 0.9 7.24-4.12 0.278-4.1 2.41-4.12 1.84-0.245-0.338 2.3 0.0218 3.04 1.75 3.59 2.78 0.882 3.52 0.0731 3.52-3.84 0-4.5 1.94-4.89 2.31-0.462 0.444 5.34-3.21 9.92-7.78 7.31-1.85-1.05-2.58-0.888-2.98-0.236-0.977 1.58-7.97 1.76-7.97-2.06zm-168 0.416c0-0.823 0.657-4.34 1.46-7.81 0.803-3.47 1.71-8.34 2.01-10.8s0.797-5.85 1.1-7.5c0.524-2.88-3.01-32.8-4.08-34.5-0.287-0.464-1.39-4.81-2.46-9.66-1.07-4.85-2.86-12.6-3.99-17.3s-2.9-12.3-3.94-17c-3.99-17.9-8.41-35-13.6-52.5-1.47-4.95-3.26-11-3.99-13.5-4.55-15.4-9.9-32-13.5-42-10.7-29.5-24.5-83.9-31-122-2.97-17.5-3.12-51.1-0.254-59 6.38-17.6 31.4-54.5 37-54.5 0.495 0 2.89-2.02 5.32-4.5s4.98-4.5 5.66-4.5 2.91-1.12 4.93-2.5c2.03-1.38 4.37-2.5 5.2-2.5 0.834 0 2.91-1.06 4.61-2.35 1.7-1.29 4.89-2.92 7.09-3.61 2.2-0.695 4.9-1.82 6-2.5 3.55-2.19 18.8-6.4 27.5-7.61 9.69-1.34 11.2-2.3 12.9-8.2 0.689-2.33 1.66-4.91 2.15-5.74 0.494-0.825 1.88-3.52 3.08-6 14.3-29.6 45.9-57.7 66.8-59.6 13.3-1.24 15-4e-3 24.2 17.8 11.1 21.6 30.9 37.3 47.6 37.9 9.81 0.354 21.3-2.34 21.3-5 0-0.471-1.46-1.97-3.25-3.34-14.5-11.1-24.9-27.4-25-39.4-0.124-10.4 2.72-16.5 14.2-30.4 2.53-3.08 5.94-7.3 7.59-9.38 11-13.9 34.3-35.5 38.3-35.5 3.43 0 4.56-2.73 2.4-5.76-3.62-5.09-1.23-15.1 6.76-28.2 0.501-0.825 1.76-3.27 2.8-5.43 2.15-4.47 4.9-6.72 6.04-4.95 0.824 1.28 11.3 6.89 39.2 20.9 29.3 14.7 31.7 16.6 22.5 18-13 1.94-11.2 7.01 10.2 28.8 12.7 12.9 20.8 22.5 28.8 34 1.65 2.37 4.39 5.49 6.09 6.92 15.6 13.1 10.1 55.4-10.3 79.4-16.6 19.4-33.9 25.9-54.9 20.4-10.1-2.6-30.1-10.3-35.2-13.5-2.11-1.33-8.09-4.54-13.3-7.13s-12-6.23-15.1-8.1c-7.05-4.24-10.1-4.26-16.4-0.079-2.74 1.82-6.56 3.94-8.49 4.7-1.92 0.761-5.52 2.61-8 4.11-4.11 2.48-8.41 4.2-25.2 10.1l-5.74 2-8.6-2.03c-4.73-1.12-9.57-2.74-10.8-3.61s-4.41-3.11-7.16-4.96c-8.56-5.78-21.1-21.1-27.5-33.6-9.49-18.5-27.9-19.5-46.7-2.54-5.48 4.96-17.3 21.8-17.3 24.6 0 0.562-1.16 3.3-2.57 6.09-3.12 6.17-4.74 5.34 13.1 6.7 16.8 1.29 31.8 5.09 45.5 11.5 4.98 2.33 16.4 15.2 20.2 22.8 9.49 19 8.55 33.8-3.71 58.3-13.1 26.2-25.4 33.9-43 26.7-2.75-1.12-8.72-3.48-13.3-5.25-18.4-7.18-42.3-25.8-46.9-36.7-2.81-6.66-2.82-20.3-5e-3 -32.3 2.85-12.2 2.9-12-3.02-12-13.4 0-30.4 3.91-41.3 9.52-14.9 7.64-17.3 9.07-22.4 13.7-11.5 10.2-16.6 35.8-12.1 60.3 3.01 16.5 5.79 31 6.72 35 0.509 2.2 1.55 7.15 2.31 11 2.98 15.1 7.68 33.7 12.5 49.5 1.09 3.58 3.16 10.6 4.58 15.5s3.4 11.2 4.39 14c0.99 2.75 2.13 7.02 2.53 9.5 0.403 2.48 1.05 4.95 1.44 5.5 0.712 1.01 2.65 6.93 8 24.5 1.59 5.22 4.05 13.2 5.47 17.7 19.7 62.7 27.2 113 21.2 144-3.81 19.3-14.6 46.1-14.6 36.1zm118-396c-2.17-27.2-31.3-47.9-70.2-49.8l-6.5-0.319 0.335 4.41c1.1 14.5 28.8 35.9 60.2 46.6 13.6 4.62 16.5 4.46 16.1-0.869zm228-101 7-3.76 0.298-6.14c0.315-6.49-1.48-12-6.21-19.1-1.28-1.92-3.93-5.98-5.89-9-8.4-13-27.5-34.7-31.4-35.6-3.19-0.8-6.07 1.3-11.3 8.27-7.37 9.73-14.9 18.3-26.2 29.8-12.4 12.6-12.3 12.3-6.02 15.5 2.61 1.36 5.42 3 6.25 3.64 6.38 4.98 26.9 13.7 42.1 17.9 15.7 4.31 21.1 4.06 31.4-1.48zm-87.5-33.7c20.7-13.8 25.5-21.5 25.5-40.8-7.2e-4 -35.1-37.2-48.5-66.8-24.2-21.2 17.5-21.7 25.1-2.48 44.4 3.95 3.99 7.52 7.25 7.93 7.25s2.24 1.27 4.04 2.83c4.99 4.31 21.9 14.2 24.2 14.2 1.15 0 4.56-1.65 7.58-3.67zm-130 520c-3.12-1.26 0.809-12.3 6.15-17.3 3.66-3.41 3.23-2.02-0.908 2.93-4.88 5.84-6.03 14.9-1.29 10.2 1.61-1.61 2.8-1.51 2.8 0.229 0 3.08-3.62 5.17-6.75 3.91zm-81.7-44.4c1.13-1.82 9.59-5.19 26-10.3 8.25-2.59 17.7-5.6 21-6.68 3.3-1.08 8.25-2.61 11-3.38 30.3-8.56 79.7-30.2 108-47.2 3.58-2.18 11.2-6.59 17-9.81s14.1-8.18 18.5-11 9.8-6.27 12-7.58c4.68-2.8 24.2-16.7 30-21.4 2.2-1.78 8.28-6.41 13.5-10.3 29.8-22.1 69.5-60.3 71.6-68.9 1.69-6.72-5.89-26.5-15.7-41.1-1.59-2.37-2.9-4.73-2.9-5.25s-0.378-0.95-0.839-0.95c-0.462 0-1.3-1.01-1.87-2.25-1.85-4.02-27.1-33.4-34.8-40.5-4.13-3.81-7.51-7.51-7.51-8.23 0-1.38 5.84-18.4 8.91-26 1-2.48 2.44-6.52 3.2-9 2.83-9.21 9.21-5 34.3 22.6 9.29 10.2 32.3 14.8 55.2 11l5.12-0.852 2.28 12.4c1.25 6.81 2.33 13 2.38 13.7 0.164 2.18-16.7 7.7-26.9 8.81-7.86 0.85-11.8 4.49-8.62 7.95 2.82 3.06 7.07 18.3 7.1 25.4 0.148 36.4-37.9 85.4-110 142-20.9 16.3-40.5 29.9-52.9 36.6-3.11 1.68-6.32 3.62-7.15 4.32-2.64 2.23-35.2 18.2-42.5 20.8-3.85 1.38-8.8 3.29-11 4.23-6.19 2.66-24.6 6.98-40 9.41-7.7 1.21-20.8 3.27-29 4.58s-22.6 3.53-32 4.93-18.5 2.8-20.3 3.1c-2.42 0.4-3.15 0.227-2.62-0.621zm-137-4.45c0.0204-1.65 0.244-2.2 0.498-1.23s0.237 2.32-0.037 3c-0.274 0.677-0.481-0.119-0.461-1.77zm564 0.489c-0.344-0.556-1.68-5.84-2.97-11.8-1.29-5.91-3.49-15.7-4.89-21.7-2.68-11.6-5.01-24.3-6.15-33.5-0.374-3.02-0.84-5.76-1.04-6.08-0.195-0.318-1.29-7.97-2.44-17-1.15-9.03-2.29-17.1-2.55-18s-0.884-4.67-1.4-8.5c-0.512-3.83-1.86-12.6-3-19.5-7.12-43-13.5-80.7-16-94.5-5.01-27.5-5.93-32.7-7.55-42.5-4.95-29.9-6.92-40.8-9.48-52.5-1.56-7.15-3.56-16.8-4.43-21.5-0.871-4.68-3.12-16.6-4.99-26.5s-4.63-26.6-6.13-37c-1.94-13.5-3.26-19.8-4.6-21.7-2.66-3.84-2.46-4.72 3.11-13.5 2.74-4.31 5.92-9.4 7.05-11.3s3.1-5.21 4.36-7.31l2.3-3.81 2.15 5.01c1.18 2.75 5.92 14.1 10.5 25.3s9.08 21.9 9.94 23.8c0.863 1.92 3.14 7.32 5.06 12s5.32 12.8 7.55 18.1c2.24 5.29 4.06 10.4 4.06 11.2 0 2.1-4.56 2.21-5.36 0.129-0.383-0.999-1.96-1.5-4.71-1.5-3.27 0-4.02 0.316-3.56 1.5 0.317 0.825 0.149 1.5-0.373 1.5s-1.87 1.81-3 4.03l-2.05 4.03 2.05 14.2c1.13 7.82 2.74 18 3.57 22.7 2.02 11.3 2.91 16.9 5.38 33.5 1.14 7.7 2.72 17.6 3.51 22 6.61 36.9 12.5 72.2 13.1 78.5 0.177 1.92 1 7.1 1.83 11.5s2.49 14.8 3.68 23 2.82 18.8 3.62 23.5c2.67 15.7 5.42 34.3 7.86 53.5 1.34 10.4 2.89 22.2 3.46 26.2 3.03 21.2-2.59 62.2-7.46 54.3zm-564-5.32c-0.412-1.01-0.753-3.03-0.756-4.5-8e-3 -3.71-5.91-21.5-11.5-34.7-8.18-19.3-8.84-21.7-7.56-27.7 2.28-10.6 8.63-18.7 16-20.3 1.66-0.365 3.21-1.66 3.95-3.3 5.75-12.8 10.4-15 18.7-8.96 13.9 9.95 6.31 18.8-16.1 18.8-12.6 0-17.9 2.77-19.1 9.86-0.706 4.33-0.219 6.01 6.27 21.6 7.13 17.2 8.92 23.2 10.2 34.3 1.22 10.5 1.08 18.2-0.271 14.9zm17.2-89.6c0-2.67-10.2-6.87-11.8-4.87-3.4 4.25-2.59 5.63 3.45 5.95 6.1 0.317 8.3 0.0293 8.3-1.08zm450 85.5c-4.19-3.47-11.2-8.22-26.4-18-10.3-6.59-12-8.69-9.75-12 2.9-4.26 24.5-25.7 25.9-25.7 1.99 0 36.7 23.1 40 26.7l2.73 2.91-2.5 4.97c-2.5 4.98-8.77 13.3-11.1 14.7-0.685 0.425-1.83 1.35-2.55 2.07-7.63 7.6-11.2 8.54-16.3 4.31zm-258-37c0-0.739 0.863-3.85 1.92-6.92 3.98-11.6 3.6-18.5-2.13-38.2-2.28-7.87-11.7-27.9-14.6-31.2-0.913-1.01-2.87-3.3-4.34-5.09l-2.68-3.25 3.94-6.73c2.16-3.7 3.94-7.24 3.94-7.87 0-2.74 4.16-6.52 5.73-5.21 16.1 13.4 25.7 56.1 18.6 83.3-3.19 12.3-10.3 26.9-10.3 21.2zm103-33.4c-0.424-2.06-0.93-4.65-1.12-5.75s-1.96-10.8-3.92-21.5c-1.96-10.7-5.33-29.8-7.48-42.5s-4.54-26.6-5.3-31-1.96-11.6-2.65-16-1.64-8.49-2.1-9.09c-0.461-0.597-1.97-7.57-3.36-15.5-1.39-7.93-3.18-17.8-3.98-21.9-2.89-14.8-8.71-48.7-10.2-59.5-0.849-6.05-2.17-11.7-2.93-12.6-2.08-2.37-1.68-5.49 1.29-10.2 1.47-2.33 3.64-5.8 4.84-7.73 11.5-18.6 10.6-18.1 14.5-8.47 1.54 3.83 4.69 11.5 7.01 17 2.32 5.5 6.23 15 8.69 21s6.22 15 8.34 20c8.12 18.9 12 28.4 12 29.4 0 1.61-4.13 1.25-5.39-0.464-1.37-1.87-8.25-2.88-9.19-1.36-0.374 0.605-0.112 1.45 0.581 1.88 0.915 0.565 0.718 0.951-0.718 1.41-2.96 0.939-4.71 7.38-3.9 14.3 0.742 6.31 0.787 6.61 2.98 19.8 1.27 7.65 3.98 24.7 8.65 54.5 2.51 16 4.14 25.5 4.5 26 0.62 1 8.48 49.2 8.48 52 0 0.399-1.24 1.21-2.75 1.81-2.77 1.09-3.81 1.68-10.3 5.84-4.8 3.07-5.6 2.89-6.49-1.48zm64.5-75.1c0-1.06 0.718-3.9 1.59-6.31 6.01-16.5-4.44-55.4-19.4-72l-4.44-4.94 4.72-9.24c7.27-14.3 7.27-14.3 12.9-6.23 16.5 23.5 21.5 53.5 13.8 81.1-3.25 11.5-9.15 22.9-9.15 17.6zm232-2.25c-8.55-2.55-7.22-12.6 4.01-30.1 5.04-7.87 50.6-54 51.3-52 0.564 1.69-1.41 3.99-18.6 21.6-29.8 30.6-37.2 42.8-28.5 46.7 2.38 1.08 2.84 0.902 5.37-2.12 3.39-4.06 6.81-3.99 8.81 0.197 4.82 10.1-8.82 19.6-22.3 15.6zm-413-12.2c-4.12-3.73-10.5-8.28-23.7-16.7-11.8-7.64-11.9-7.2 2.63-21.6 14-13.8 14.4-14.1 16.9-11.7 1.02 0.98 6.25 4.93 11.6 8.78 5.37 3.85 10.3 7.46 10.9 8.02 0.639 0.561 3.52 2.74 6.41 4.84 7.15 5.19 6.77 10.8-1.12 16.6-1.06 0.774-4.14 3.37-6.84 5.78-4.11 3.65-12 9.33-13 9.31-0.148-3e-3 -1.88-1.47-3.85-3.25zm-256-8.24c-8.09-3.51-5.54-15.1 7.29-33 3.98-5.56 40.5-42.7 46.7-47.5 7.85-6.07 0.891 2.69-16.4 20.6-30.7 31.9-36.8 41.8-28.6 46.3 2.68 1.48 2.85 1.43 5.32-1.72 3.53-4.5 7.02-4.42 8.95 0.197 4.41 10.6-10.9 20.4-23.3 15.1zm240-53.6c-6.89-6.31-17.9-15.3-24.8-20.3-7.84-5.66-7.33-7.33 6.62-21.6 2.95-3.03 6.5-6.96 7.87-8.75 4-5.21 7.06-4.14 23.1 8.12 19.1 14.6 21.2 18.8 13.6 27.1-2.52 2.75-6.21 7.02-8.19 9.5-10.3 12.8-10.6 12.9-18.2 5.9zm386-40.6c0.367-1.51 1.25-4.73 1.97-7.16 2.98-10.1-7.08-11.6-22.8-3.47-3.36 1.74-3.1 2.26-5.23-10.6-1.06-6.41-1.23-9.61-0.522-9.85 0.576-0.192 7.16-3.48 14.6-7.3 29.5-15.1 36.9-12.2 29.3 11.6-4.86 15.2-20.3 39.1-17.4 26.8zm25.7-74.7c-7.57-3.29-4.92-15.1 7.16-31.9 5.95-8.28 48.8-51.2 49.4-49.5 0.614 1.69-2.51 5.43-17.6 21-8.14 8.42-16.1 16.7-17.7 18.3-7.69 8.01-15.6 20.1-15.6 23.9 0 5.06 6.73 7.35 9.03 3.07 3.4-6.34 11.5-0.628 9.63 6.8-1.94 7.72-15.3 12.2-24.4 8.28zm-163-5.56c-0.918-1.48 3.5-4.68 9.47-6.86 12.1-4.42 21-12.3 19.5-17.4-4.13-13.6-24.6-9.96-23 4.11l0.68 5.86-4.28 3.15c-10 7.39-12.2-1.76-2.97-12.8 16.1-19.2 25.1-24.6 34.6-20.7 9.94 4.16 9.79 16.3-0.35 26.9-8.37 8.8-31.6 21-33.7 17.6zm-446-74.6c-8.27-2.52-9.98-5.84-8.49-16.4 2.59-18.3 15.9-36.9 51.2-71.7 41.6-41 46.2-45.2 47.5-43.8 0.383 0.383 0.246 1.01-0.303 1.39s-1.44 1.7-1.97 2.92c-1.33 3.03-12 14.6-30.5 33.2-30.9 31.1-48.1 52.4-49.4 61.5-1.69 11.3 8.18 16.3 14 7.14 7.21-11.4 19.1 0.537 14 14-4 10.5-21.5 16.2-36 11.8zm91.5-32.1c0-2.56 4.9-6.85 8.76-7.66 11.1-2.34 27.2-15.7 27.2-22.6-0.0115-13.6-14.5-19.2-24.7-9.4-4.83 4.63-5 5.61-2.79 16 0.942 4.42-9.26 14.3-13.4 13-6.92-2.2-1.22-16.5 12.8-32.1 2.52-2.81 6.02-6.91 7.78-9.12 18-22.6 45.7-6.28 32.7 19.3-5.96 11.8-25 27.2-39.3 31.8-9.51 3.08-9.08 3.04-9.08 0.773zm105-75.9c-3.12-0.601-5.26-4.05-5.26-8.48 0-5.72 12.8-28.8 18.2-32.9 0.396-0.297 9.91-9.63 21.1-20.8s20.9-20.2 21.6-20.2c2.32 0-1.33 4.52-14.9 18.5-24.5 25.2-34.3 37-35.6 42.8-1.42 6.34 5.56 10.4 8.96 5.21 2.38-3.63 7.26-3.49 8.7 0.25 4.16 10.8-7.22 18.6-22.8 15.5z" />
              </svg>
            </div>
            <div className='title_of_chapter'>
              <p> Иброҳим алайҳис-салом  </p>
              <p>қиссаси </p>
            </div>
          </div>

          <div className='decor_line'>
            <p> &#8213;&#8213;  &#10044; &#8213;  &#10044;  &#8213;  &#10044;  &#8213;&#8213;   </p>
          </div>


          <div className='main_text'>
            <p className='boldItalic'>«Оллоҳнинг Сўзи ростдир. Бас, Ҳақ Йўлдан тоймаган ва мушриклардан бўлмаган Иброҳимнинг миллатига эргашинглар» <span className="vitalic">(Қуръон, Оли-Имрон сураси, 95).</span></p>
          </div>

          <div className='paragraph_heading'>
            <p> ИБРОҲИМ ПАЙҒАМБАРНИНГ ОТАСИ </p>
          </div>

          <div className='main_text'>
            <p>
              Торуҳдан Иброҳим, Ноҳур ва Ҳорон деган уч ўғил туғилди. Улар ўша пайтда калдонийларнинг Ур деган шаҳрида яшар эдилар.
              Ҳорон кейин уйланиб, Лут деган ўғил, Милка ва Иска деган қизлар кўрди.               Кейинроқ у, отаси тириклигида, ўша юртда — Ур шаҳрида оламдан ўтди. Иброҳим ҳам уйланди.
            </p>
            <p></p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'

              style={{ display: visibleBubbles[1] ? 'block' : 'none' }}
              onClick={() => handleSupClick(1)}


            >
              <p >
                <sup>1</sup> Ўртада чўл борлиги учун улар олдин шимолдаги Ҳорон шаҳрига бориб, кейин жанубга — Канъонга бормоқчи эдилар.
              </p>
            </div>
            <p onClick={() => handleSupClick(1)} >
              Лекин унинг хотини Сора ҳеч ҳомила бўлмас эди.
              Кунлардан бир кун Торуҳ, фарзандларини олиб, Канъон юртига қараб йўл олди.  Лекин Ҳоронга<sup>1</sup> келганда, баъзи бир сабаблар билан ўша ерда қолиб кетдилар.
            </p>
          </div>

          <div className='paragraph_heading'>
            <p> Иброҳим (а.с.) нинг ёшлиги </p>
          </div>

          <div className='main_text'>
            <p className='vitalic'>
              Китобларда ёзилишича Иброҳим (а.с.) нинг қавми жонсиз бутларга сиғинар, тирик Оллоҳни тан олмас эди. Иброҳим эса: «Дунёнинг эгаси борми? Бутун оламлар рабби ким экан?» деган саволларга жавоб изларди.
            </p>
          </div>

          <div className='paragraph_heading'>
            <p> Оллоҳни излаш </p>
          </div>

          <div className='main_text'>
            <p className='boldItalic'>
              «Уни тун ўраб олганида юлдузни кўриб: «Мана шу менинг Раббим», деди. Юлдуз ботиб кетганида эса: «Ботувчиларни ёқтирмадим», деди. Чиқаётган ойни кўргач: «Мана шу менинг Раббим», деди. <span className="vitalic"> (Лекин ой ҳам ботиб кетди.)</span>
            </p>
            <p></p>
          </div>
          <div className='main_text'>
            <div className='speech-bubble'

              style={{ display: visibleBubbles[2] ? 'block' : 'none' }}
              onClick={() => handleSupClick(2)}


            >
              <p>
                <sup>2</sup>  Анъом сураси 6:76-79.
              </p>
            </div>
            <p className='boldItalic' onClick={() => handleSupClick(2)}>
              Ботганида: «Адашибман. Агар Раббим тўғри йўлга бошламаса, албатта адашувчилардан бўламан», деди. Чиқаётган қуёшни кўрганда: «Мана шу менинг Раббим. Бу каттароқ», деди. У ҳам ботиб кетгач,  <span className="vitalic">(буларнинг ҳаммасини яратган ва булардан улуғроқ бир зот бўлиши керак, деб ўйланиб қолди. Кейин:)</span>  «Эй қавмим, мен сиз ширк келтираётган нарсадан воз кечдим, — деди. — Мен юзимни осмонлару ерни яратган зотга бурдим, тўғри йўлни истайман, мушриклардан эмасман», деди». <sup>2</sup>
            </p>
            <p></p>
          </div>
          <div className='main_text'>
            <div className='speech-bubble'

              style={{ display: visibleBubbles[3] ? 'block' : 'none' }}
              onClick={() => handleSupClick(3)}


            >
              <p>
                <sup>3</sup>  Бақара сураси 131.
              </p>
            </div>
            <p className='vitalic' onClick={() => handleSupClick(3)}>
              Шундай кунларнинг бирида Оллоҳ азза ва жалл у кишига ваҳий нозил қилиб: <span className="boldItalic">«Аслим»,  </span> деди. Маъноси: «Менга таслим бўл», дегани. Иброҳим (а.с.) дарров:  <span className="boldItalic"> «Асламту лираббил-аъламийн»</span><sup>3</sup>  яъни: «Оламлар Раббига таслим бўлдим, иймон келтирдим», дедилар. Шундан кейин отасини ва қавмини бутларга топинишдан тўхтатиб, ягона Оллоҳга, еру кўкнинг эгасига қайтармоқчи бўлдилар.
            </p>
          </div>


          <div className='paragraph_heading'>
            <p> БУТЛАРНИ ПАРЧАЛАШ </p>
          </div>
          <div className='main_text'>
            <div className='speech-bubble'

              style={{ display: visibleBubbles[4] ? 'block' : 'none' }}
              onClick={() => handleSupClick(4)}

            >
              <p>
                <sup>4</sup> Шуаро 26:70-74 оятлар.
              </p>
            </div>
            <p className='boldItalic' onClick={() => handleSupClick(4)}>
              «У отаси ва қавмига: «Нимага ибодат қилмоқдасизлар?» деди. Улар: «Санамларга ибодат қилмоқдамиз. Ва уларга ихлос билан ибодат қилишда давом этамиз», дедилар. У: «Илтижо қилганингизда улар сизни эшитадими? Ёхуд наф ёки зарар етказа оладими?» деди. Улар: «Йўқ, лекин ота-боболаримиз шундай қилган, биз улардан шундай кўрганмиз», деб жавоб бердилар».
            </p>
            <p></p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'

              style={{ display: visibleBubbles[5] ? 'block' : 'none' }}
              onClick={() => handleSupClick(5)}


            >
              <p>
                <sup>5</sup>   Ас-Саффот 91-93 оятлар.
              </p>
            </div>
            <p className='vitalic' onClick={() => handleSupClick(5)}>
              Бир куни байрам бўлди. Ҳамма байрамга кетгач, Иброҳим (а.с.) болта кўтариб бутхонага бордилар ва бутларнинг олдида турган емакларни кўриб дедилар: <span className='boldItalic'> «Қани, емайсизларми?! Сизларга нима бўлди?! Гапирмайсизларми?!» Сўнг уларга яқинлашиб, уларни ура бошлади.</span><sup>5</sup>
            </p>
            <p className='vitalic' onClick={() => handleSupClick(7)}>
              Қуръоннинг Анбиё сурасида: <span className="boldItalic">«Бас, уларни парча-парча қилиб ташлади. Магар энг каттасини»,<sup>6</sup>   </span> деб ёзилган. Кейин болтани ўша катта бутнинг бўйнига осиб, бутхонани тарк этадилар.
            </p>
            <p></p>
          </div>
          <div className='main_text'>
            <div className='speech-bubble'
              style={{ display: visibleBubbles[7] ? 'block' : 'none' }}
              onClick={() => handleSupClick(7)}
            >
              <p>
                <sup>6, 7</sup>   Ал-Анбия сураси 58-оят ва 62-67 оятлар.
              </p>
            </div>
            <p className='vitalic' onClick={() => handleSupClick(7)}>
              Бироз вақтдан сўнг одамлар байрамдан келиб, бутларнинг синиб ётганини кўрдилар ва ғазабланиб, Иброҳим (а.с.) ни олиб келдилар: <span className="boldItalic">«Худоларимизга буни сен қилдингми, эй Иброҳим?!»</span> У киши эса: <span className="boldItalic"> «Йўқ, буни мана буниси, каттаси қилди. Агар гапирсалар, ўзларидан сўраб кўринглар», </span><sup>7</sup> дедилар калака қилиб. Шунда улар: «Сен бутларнинг гапира олмаслигини биласан-ку!» дедилар. У киши эса: «Унда <span className="boldItalic"> нега Оллоҳни қўйиб, на фойда, на зарар бермайдиган нарсаларга ибодат қиласиз?!»    </span> дедилар.
            </p>
          </div>

          <div className='paragraph_heading'>
            <p>  Расулуллоҳни оловга ташлайдилар </p>
          </div>


          <div className='main_text'>
            <div className='speech-bubble'

              style={{ display: visibleBubbles[8] ? 'block' : 'none' }}
              onClick={() => handleSupClick(8)}


            >
              <p>
                <sup>8</sup>   Кўп китобларда бу қиролнинг исми Намруд деб ёд қилинган.
              </p>
              <p>
                <sup>9</sup>     Бақара сураси, 258-оят.
              </p>
            </div>
            <p className='vitalic' onClick={() => handleSupClick(8)}>
              Шундан кейин ўша қавмнинг қироли<sup>8</sup>   Иброҳим (а.с.) ни ҳузурига чақиртириб: «Сенинг худойинг ким, сен ўзи уни кўрганмисан?» деб савол беради. Расулуллоҳ жавоб бериб айтадиларки: «Менинг Раббим тирилтиргувчи ва ўлдиргувчи». У эса: «Мен ҳам бунга қодирман, — дейди. — Икки одам ўлимга буюрилса, бирини ўлдираман, бирини эса афу этаман». Шунда Иброҳим (а.с.):  <span className="boldItalic"> «Оллоҳ қуёшни шарқдан чиқаради, сен агар қодир бўлсанг, ғарбдан чиқариб кўр-чи!» дейдилар.</span><sup>9</sup>  Қирол жавоб беролмай, лол қолади.
            </p>
            <p></p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'

              style={{ display: visibleBubbles[10] ? 'block' : 'none' }}
              onClick={() => handleSupClick(10)}


            >
              <p>
                <sup>10</sup>   Баъзи олимларнинг ёзишича, ўтин йиғиш учун уч ой вақт масраф бўлган экан (Ибн Аёс: «Бадайи уз-зуҳур»).
              </p>
            </div>
            <p className='vitalic' onClick={() => handleSupClick(10)}>
              Шундан сўнг қирол, Оллоҳнинг расулини ўтда ёқиб ўлдиришга қарор қилади.  Шу мақсад билан катта бир чуқур тайёрлаб ичига узоқ ёнадиган ўтинларни йиғдиради. Ҳамма нарса тайёр бўлгач, катта гулхан ёқиб,<sup>10</sup>  Иброҳим (а.с.) ни оловга ташлайдилар.
            </p>
          </div>

          <div className='paragraph_heading'>
            <p>  ҚИССАДАН ҲИССА </p>
          </div>

          <div className='main_text'>
            <p className='vitalic'>
              Иброҳим (а.с.) Оллоҳга таваккул қилганлари учун, ҳатто ўтда куйдирамиз, десалар ҳам иймонидан воз кечмадилар. Бундай ҳолатда ҳар бир мўъмин Оллоҳнинг нусратига умид боғлайди. Ахир Оллоҳ истаса, ўт балосидан ҳам, сув балосидан ҳам сақлайди-ку. Лекин ҳатто сақламаса ҳам, биз иймонимизни қўлдан бой бермаслигимиз лозим.
            </p>
            <p></p>
          </div>
          <div className='main_text'>

            <div className='speech-bubble'

              style={{ display: visibleBubbles[11] ? 'block' : 'none' }}
              onClick={() => handleSupClick(11)}


            >
              <p>
                <sup>11</sup> Ал-Анбия сураси 21:69.
              </p>
            </div>
            <p className='vitalic' onClick={() => handleSupClick(11)}>
              Иброҳим (а.с.) оловга отилганда Оллоҳ таоло у кишини сақлади. Қуръони каримда:  <span className="boldItalic"> «Эй олов, сен Иброҳимга салқин ва саломатлик бўл!»<sup>11</sup> </span>  деб айтилган амр бор. Чунки қавми ҳазрати Иброҳимга ёмонликни хоҳлаган бўлса-да, Оллоҳ уларнинг ўзларини зиёнкорлардан қилиб қўйди.
            </p>
            <p></p>
          </div>

          <article className='nav_arrows'>
            <div className='flex_it space_between'>
              <div style={{ marginLeft: '0px' }} onClick={() => navigate(-1)}>
                <div>
                  <span className='left_arrow_span'>&#8592;</span>
                </div>
                <div className='indicator'>

                  <span className=' bottom_arrows_for_qisas'>орқага қайтиш</span>

                </div>
              </div>

              <div className='central_div'>
                <div>
                  <p>Иброҳим (а.с.) қиссаси</p>
                </div>
              </div>

              <div style={{ marginRight: '0px' }} onClick={() => navigate('/qisas-uzbek/abrahamic-covenant')}>
                <div className='indicator'>
                  <span className=' bottom_arrows_for_qisas'>Иброҳим (а.с.) Аҳди</span>
                </div>
                <div>
                  <span className='right_arrow_span' >&#8594;</span>
                </div>
              </div>
            </div>
          </article>
         
        </main>
        <aside>
        </aside>
      </div>
    </div >
  )
}

export default Abraham
