import React, { useState, useEffect } from 'react';
import { useNavigate } from 'react-router-dom';
import './stories.css'
import kamar from '../../images/kamar.png'


const Adam = () => {

  const navigate = useNavigate();


  const [windowWidth, setWindowWidth] = useState(window.innerWidth);
  const [visibleBubbles, setVisibleBubbles] = useState({});

  useEffect(() => {
    const handleResize = () => {
      setWindowWidth(window.innerWidth);
    };

    window.addEventListener('resize', handleResize);

    const initialVisibility = {};
    const numberOfCases = 7;

    for (let i = 1; i <= numberOfCases; i++) {
      initialVisibility[i] = window.innerWidth > 970;
      // console.log(initialVisibility[i])
    }
    setVisibleBubbles(initialVisibility);

    return () => window.removeEventListener('resize', handleResize);
  }, []);

  const handleSupClick = (index) => {
    setVisibleBubbles(prevState => ({
      ...prevState,
      [index]: !prevState[index]
    }));
  };

  return (

    <div className="minister-home stories">
      <div className="separate_into_two_columns">
        <main className="sep_part1">

          <div className='chapter_heading'>
            <div className="kamar">
              <img src={kamar} alt="" />
            </div>
            <div className="img_container" style={{ padding: '11px' }}>
              <svg
                fill='rgb(175, 157, 0)'
                version="1.1" viewBox="0 0 139 145" xmlns="http://www.w3.org/2000/svg">
                <path d="m44.9 142c-0.711-4.47-0.4-5.68 1.55-6.04 0.974-0.183 1.09-0.278 0.638-0.53-0.302-0.169-0.825-0.235-1.16-0.146-0.775 0.203-0.787-0.164-0.0287-0.85 0.854-0.773 1.49-0.654 2.43 0.454 1.16 1.37 0.715 2.15-1.3 2.28-2.05 0.135-2.24 0.542-1.73 3.82 0.226 1.47 0.358 3.11 0.294 3.63-0.0709 0.58-0.343-0.458-0.687-2.62zm35.2-0.443c-0.896-0.516-0.338-1.33 0.747-1.09 0.569 0.125 0.919 0.0704 0.919-0.143 0-0.443 0.857-0.451 1.13-0.0101 0.434 0.703-0.113 1.32-0.831 0.933-0.532-0.284-0.749-0.257-1.04 0.133-0.272 0.358-0.523 0.406-0.92 0.177zm-7.93-1.22c0-0.153 0.72-0.577 1.6-0.942 2-0.829 2.11-0.436 0.151 0.516-1.62 0.788-1.75 0.82-1.75 0.426zm-22.7-1.82c3.26-1.76 3.44-2.02 2.59-3.77-0.793-1.64-2.5-3.09-3.62-3.09-1.05 0-1.53-0.578-1.53-1.84v-1.07l1.03 0.578c1.94 1.09 4.06 3.47 4.47 5.04 0.758 2.84 1.27 1.22 0.875-2.74-0.144-1.43-0.134-2.88 0.0214-3.27 0.167-0.415 0.289-0.502 0.303-0.216 0.057 1.23 1.02 6.99 1.33 7.92 0.63 1.92 2.8 2.15 4.18 0.453 0.634-0.781 0.647-0.657 0.0796 0.745-0.443 1.1 2.12 0.357 3.12-0.898 0.523-0.658 0.526-0.656 0.371 0.153-0.275 1.44 1.05 1.43 1.85-3e-3 0.359-0.645 0.567-0.895 0.462-0.557-0.106 0.343-8e-3 0.73 0.221 0.875 0.538 0.341 2.17 0.346 2.17 7e-3 0-0.739-1.33-7.67-1.58-8.26-0.2-0.466-0.168-0.863 0.099-1.23 0.48-0.657 1.31 0.78 1.01 1.74-0.0961 0.303 0.0435 1.69 0.31 3.08 0.995 5.2 0.368 6.88-2.08 5.57-0.48-0.257-0.677-0.191-0.95 0.32-0.372 0.695-1.58 0.861-2.14 0.294-0.246-0.246-0.535-0.251-0.975-0.0151-0.344 0.184-1.74 0.377-3.1 0.43-2.83 0.109-3.14-0.106-3.76-2.58l-0.351-1.39-0.407 1.18c-0.582 1.69-1.63 2.66-3.46 3.21-2.57 0.763-2.75 0.539-0.523-0.66zm27.6 0.165c-0.395-0.159-0.975-0.711-1.29-1.23-0.516-0.848-0.63-0.895-1.18-0.491-0.769 0.562-2.73 0.597-2.73 0.0477 2e-3 -0.737 1.27-2.49 2.06-2.85 0.537-0.245 0.819-0.671 0.896-1.35 0.135-1.19 0.346-0.752 0.877 1.83 0.615 3 2.13 3.84 4.4 2.46 0.986-0.601 1.07-0.605 1.99-0.0793 1.73 0.992 2.03 0.246 1.45-3.59-0.261-1.74-0.475-3.6-0.475-4.13 0-1.86 0.422-0.505 0.994 3.2 0.645 4.17 1.73 6.35 1.73 3.48 0-1.74 1.07-3.06 2.48-3.06 1.05 0 2.16 0.506 2.16 0.983 0 0.203-0.239 0.192-0.656-0.0309-1.54-0.824-3.9 0.746-3.17 2.11 0.603 1.13 1.66 1.29 3.19 0.5 1.54-0.805 1.69-0.379 0.243 0.715-1.95 1.47-4.12 1.72-5.41 0.611-0.469-0.402-0.616-0.376-1.21 0.214-0.634 0.634-0.726 0.643-1.65 0.167-0.91-0.471-1.07-0.46-2.34 0.155-1.53 0.739-1.39 0.72-2.36 0.329zm-2-3.35c0-0.939-0.0571-0.952-1.3-0.312-1.26 0.654-1.19 1.11 0.176 1.11 0.981 0 1.12-0.0991 1.12-0.8zm-4.89 0.8c-0.135-0.968-0.477-2.96-0.759-4.42-0.324-1.68-0.401-2.78-0.209-2.97 0.421-0.421 1.46 5.52 1.32 7.55l-0.11 1.6zm-10.1-3.97c-0.142-0.976 0.316-1.28 0.33-0.278 0.0137 0.987 1.35 0.917 1.15-0.176-0.194-1.04 0.221-1.07 0.316-0.293 0.228 0.873 1.03 0.964 1.05-0.187 0.0201-1.15 0.236-1.27 0.281 0.0375 0.0252 0.749-0.113 1.1-0.512 1.22-0.308 0.0953-0.81 0.307-1.12 0.47-0.646 0.202-1.32 0.266-1.5-0.797zm19.6 0.332c0.792-0.637 0.363-1.27-0.683-1-0.717 0.18-0.769 0.143-0.406-0.294 0.498-0.6 1.2-0.621 2.2-0.0659 0.812 0.45 0.64 0.729-0.902 1.46-0.734 0.349-0.751 0.341-0.208-0.0962zm-36.5-0.69c1.22-0.828 1.44-1.24 0.874-1.59-0.482-0.298-0.385-1.01 0.218-1.61 0.504-0.504 0.565-0.502 0.96 0.0383 0.574 0.785 0.533 1.26-0.0661 0.768-0.268-0.223-0.592-0.297-0.72-0.164-0.128 0.132 0.0917 0.458 0.488 0.725 0.671 0.451 1.08 1.62 0.422 1.22-0.164-0.101-0.832 0.178-1.48 0.621-0.653 0.443-1.34 0.805-1.54 0.805-0.192 0 0.188-0.365 0.845-0.812zm14.8-1.85c0.193-0.481 5.89-3.15 5.89-2.76 0 0.289-2.57 1.69-4.86 2.64-0.792 0.33-1.13 0.369-1.03 0.117zm27.8 0.0392c0.0947-0.247 0.636-0.713 1.2-1.04s1.5-0.867 2.07-1.21c0.707-0.423 0.987-0.483 0.874-0.189-0.174 0.452-0.317 0.554-2.8 2-0.935 0.544-1.46 0.713-1.35 0.437zm-34.7-2.21c0-0.284 2.67-1.58 4.21-2.05 0.595-0.18 0.672-0.144 0.371 0.173-0.546 0.575-4.58 2.23-4.58 1.88zm29.9-0.0475c0.214-0.559 4.3-2.91 4.57-2.64 0.225 0.225 0.221 0.228-2.74 1.93-1.1 0.63-1.92 0.95-1.83 0.711zm-12.9-1.02c0.0618-0.184 0.342-0.336 0.623-0.338 0.281-2e-3 0.854-0.326 1.27-0.72 0.926-0.87 1.52-0.919 1.52-0.126 0 0.963-1.07 1.68-2.36 1.6-0.641-0.0432-1.11-0.229-1.05-0.413zm2.73-0.459c0.33-0.209 0.342-0.332 0.0493-0.513-0.212-0.131-0.617-5e-3 -0.903 0.28-0.587 0.587 0.0298 0.755 0.853 0.233zm30.6-0.927c0.352-0.357 2.78-1.9 5.39-3.42 18.7-10.9 24.1-15.3 27.9-22.9 7.88-15.6-6.93-44.1-31.5-60.7-6.39-4.3-6.66-4.29-6.91 0.134-0.239 4.2-0.466 5.73-0.766 5.19-0.514-0.937-1.06-6.67-1.09-11.4-0.0172-2.68-0.0519-4.88-0.077-4.88-0.0251-1e-4 -1.14 1.43-2.49 3.19-3.67 4.79-4.12 4.54-1.47-0.8 1.46-2.94 3.67-5.97 8.2-11.3l1.16-1.35-0.969-0.969c-1.51-1.51-2.73-1.34-7.45 0.984-21 10.3-39 12.2-54.5 5.56-0.442-0.189-0.546-0.155-0.375 0.123 0.837 1.35-0.443 9.41-1.7 10.7-0.134 0.137-0.403-1.52-0.598-3.68-0.448-4.97-0.809-5.95-3.92-10.6l-2.54-3.84 0.426-1.61c0.963-3.65 1.3-3.72 5-1.07 13.4 9.58 33.1 9.79 53.2 0.563 11.6-5.34 14.1-5.85 15.7-3.29 1.87 2.85 0.585 7.19-3.67 12.4l-2.55 3.14 2.9 1.41c8.12 3.95 20.5 14.1 26.9 22.1 19.2 23.8 17.4 59.8-3.6 71.3-3.7 2.03-14.3 5.11-18.9 5.51l-2.32 0.201zm-86.2-1.63c-9.2-3.03-11.4-13.8-5.67-28 4.19-10.4 6.31-12.3 2.92-2.55-3.89 11.1-4.72 15.7-3.53 19.2 1.49 4.49 5.88 5.66 11.3 3.01 2.72-1.32 3.01-1.58 12.4-11.1 5.28-5.34 10.6-10.5 11.9-11.5 5.96-4.69 14.8-9.88 20.9-12.2 1.28-0.494 2.28-0.983 2.22-1.09-2.95-5.25-3.46-9.05-1.72-12.6 2.95-6.02 9.62-5.4 18.5 1.7 3.95 3.17 4.47 4.34 3.5 7.89-1.31 4.78-0.875 4.42-7.96 6.63l-6.19 1.93 0.182 1.32c0.131 0.953-0.169 2.72-1.07 6.29-4.59 18.3 0.196 23 15.4 15.3 8.15-4.15 30.5-19 31.1-20.6 0.894-2.33-1.78-4.43-12.4-9.73-9.94-4.97-12.5-6.94-20.1-15.2-0.792-0.871-1.87-1.89-2.4-2.25l-0.96-0.671-0.108-3.92c-0.142-5.19-0.524-5.08 6.41-1.79 8.11 3.86 9.13 5.06 4.29 5.06-2.6 0-2.6 0.0259 0.0635 2.22 3.42 2.81 5.74 4.18 14.4 8.5 8.39 4.19 9.87 5.14 11.1 7.08 3.42 5.45 2.43 15.2-2.01 19.6-6.33 6.28-29.3 21.3-36.4 23.7-11.3 3.89-15.9-8.69-9.85-27.3l1.11-3.44-0.57-1.6c-0.689-1.94-0.216-1.94-4.79 0.014-14 6-19.3 9.71-30.3 21.3-11 11.6-12.4 12.8-14.7 13.9-2.25 1.05-5.33 1.48-6.91 0.965zm62.3-47.9c1.85-0.753 1.54-1.21-1.94-2.87-7.09-3.38-8.56-2.89-6.12 2.06l1.54 3.13 2.59-0.885c1.42-0.487 3.19-1.13 3.93-1.43zm-21.3 42c-1-3.24-1.73-4.36-2.68-4.18-0.519 0.0993-0.993-0.114-1.53-0.69l-0.784-0.834 0.597-1.11c1.37-2.54 4.33 0.074 5.17 4.56 0.218 1.16 0.263 1.08 1.07-2.02 1.22-4.69 2.44-6.03 3.97-4.35 1.13 1.24 0.523 3.34-0.646 2.24-1.41-1.33-2.12-0.0684-3.3 5.85-0.619 3.12-1.02 3.23-1.86 0.52zm-1.29-9.29c-1.01-1.22-0.607-5.17 0.892-8.67 0.989-2.31 1.03-1.7 0.103 1.54-1.23 4.3-0.161 6.97 1.79 4.48 0.762-0.968 0.847-0.735 0.312 0.858-0.674 2.01-2.19 2.89-3.1 1.79zm-28.5-13.9c-0.886-3.32-1.95-5.17-2.88-4.98-1.44 0.289-2.49-1.11-1.81-2.42 1.34-2.6 3.75-0.843 4.98 3.62l0.527 1.93 0.725-3.02c0.862-3.59 1.67-5.1 2.74-5.1 0.852 0 2.12 1.4 1.9 2.1-0.496 1.61-0.431 1.56-1.21 0.828-1.43-1.34-2.07-0.469-2.96 4.05-0.883 4.46-1.41 5.25-2.01 3.01zm-1.67-10.3c-0.862-1.61-0.142-6.23 1.42-9.12 0.632-1.17 0.636-0.986 0.0237 1-1.57 5.09-0.786 8.28 1.41 5.73l0.805-0.934-0.219 1.12c-0.471 2.41-2.59 3.77-3.44 2.19zm-19.3-1.09c-0.11-0.286-0.2-1.51-0.2-2.71s-0.36-4.14-0.8-6.52c-1.29-6.96-1.02-8.57 1.6-9.51 0.853-0.308 1.02-0.492 0.751-0.817-0.491-0.591-0.917-0.525-1.77 0.276l-0.741 0.696v-0.835c0-1.08 0.446-2.24 1.12-2.91 1.03-1.03-1.54-7.13-2.86-6.8-1.72 0.433-2.81-1.31-1.86-2.98 1.27-2.23 3.72-0.395 4.98 3.74l0.746 2.45 0.698-2.99c1.1-4.71 2.47-6.32 4.09-4.8 0.511 0.48 0.773 1.08 0.773 1.77 0 1.35-0.506 1.64-1.4 0.797-1.35-1.27-1.99-0.338-3.04 4.45-0.33 1.5-0.691 2.94-0.801 3.2-0.139 0.334 0.154 0.676 0.945 1.1 2.9 1.56 3.77 5.29 1.24 5.29-0.479 0-3.59 1.14-4.22 1.54-0.321 0.207-0.233 0.917 0.416 3.35 1.35 5.06 1.65 15.6 0.351 12.2zm40.3-4.87c-0.526-2.84-2.09-5.85-3-5.78-2.09 0.151-3-1.28-1.94-3.07 1.38-2.34 4.61 0.663 5.29 4.93 0.27 1.69 0.352 1.57 1.09-1.63 1.16-5.05 2.74-6.84 4.37-4.95 1.39 1.61 0.654 3.72-0.807 2.32-1.4-1.34-1.9-0.624-2.94 4.27-1 4.73-1.68 6.01-2.06 3.92zm-29.8-8.38c0.167-0.162 3.18-1.98 6.7-4.05 7.65-4.49 10.4-6.3 12.6-8.38l1.7-1.56-1.16-0.717c-3.94-2.44-3.64-6.78 0.67-9.64 3.69-2.44 5.54-0.378 4.45 4.95-0.461 2.24-0.468 2.58-0.0517 2.82 0.26 0.146 0.868 0.609 1.35 1.03l0.878 0.764-1.83 3.53-2.46-1.98-2.5 2.52c-4.16 4.18-8.78 6.96-15.8 9.52-4.07 1.47-5.14 1.75-4.55 1.18zm23-18.8c0.598-2.38-1.27-3.85-3.06-2.4l-0.753 0.609 0.637 0.716c0.628 0.706 2.36 1.9 2.76 1.9 0.113 6.4e-4 0.299-0.373 0.414-0.831zm14.4 0.351c0.113-0.451 0.539-1.57 0.946-2.49l0.74-1.67 8.13-2.77c4.47-1.52 11.1-3.79 14.6-5.03 7.16-2.49 6.9-2.5 5.48 0.303-0.832 1.65-0.653 1.56-9.9 4.89-7.94 2.86-14.5 5.31-18.5 6.9l-1.72 0.685zm72.5-8.51c3.74-4.43 4.29-7.3 1.17-6.12-1.19 0.449-1.18 0.453-0.971-0.646 0.269-1.4 1.49-2.49 2.79-2.49 2.97 0 2.17 4.96-1.38 8.61-2.28 2.34-3.43 2.8-1.61 0.642zm-110-1.1c-1.92-2.45-0.578-7.65 3.17-12.3 2.17-2.67 2.32-2.32 0.39 0.956-3.59 6.11-3.51 9.86 0.16 7.62 1.31-0.799 1.35-0.796 1.35 0.0812-9e-3 3.44-3.34 5.79-5.07 3.59zm94.1-16.5c3.17-3.95 3.78-4.92 3.68-5.89-0.107-1.1-1.46-1.55-2.36-0.801-0.667 0.554-0.808 0.255-0.457-0.968 0.456-1.59 1.21-2.25 2.55-2.25 3.91 0 1.73 6.72-3.35 10.3l-0.96 0.683zm-63-12.8c3.17-3.95 3.78-4.92 3.68-5.89-0.109-1.11-1.26-1.49-2.51-0.815-0.629 0.336-0.667 0.304-0.461-0.38 0.759-2.52 2.18-3.61 3.66-2.78 2.51 1.4 0.143 7.18-4.19 10.2l-1.07 0.751zm33.2 0.204c0-0.0941 0.652-0.906 1.45-1.8 3.72-4.18 4-7.64 0.476-5.75-0.818 0.438-0.647-0.891 0.285-2.22 2.32-3.31 5.08 0.16 3.2 4.03-0.943 1.95-5.41 6.69-5.41 5.74zm-15.7-1.98c0.439-0.544 1.41-1.75 2.16-2.67 2.26-2.79 2.32-4.36 0.148-4.31-1.52 0.031-1.66-0.268-0.855-1.82 0.994-1.92 3.36-2.01 3.98-0.151 0.738 2.24-1.51 6.49-4.63 8.77l-1.6 1.17z" strokeWidth=".32" />
              </svg>

            </div>
            <div className='title_of_chapter'>
              <p> Одам алайҳис-салом  </p>
              <p>қиссаси</p>
            </div>
          </div>

          <div className='decor_line'> </div>

          <div className='main_text'>
            <div className='speech-bubble'
              style={{ display: visibleBubbles[1] ? 'block' : 'none' }}
              onClick={() => handleSupClick(1)}
            >
              <p>
                <sup>1</sup> Қуръон ояти: «Эсла! Ўшанда Раббинг фаришталарга: «Албатта, мен лойдан инсон яратгувчидирман. Бас, қачонки уни ростлаб, ичига Руҳимдан пуфлаганимда, унга сажда қилиб йиқилинглар!» деган эди. Бас, фаришталар барчалари жамланиб, сажда қилдилар» (Сод сураси 38:71-73).
              </p>
            </div>
            <p
              onClick={() => handleSupClick(1)}
            >
              Қуръони каримда ёзилишича, Оллоҳ таоло Одам (а.с.) ни тупроқдан-лойдан яратган экан (Сод сураси 38:71)<sup>1</sup>.
            </p>
          </div>

          <div className='arabic_quran'>
            <p className=''>
              إِذْ قَالَ رَبُّكَ لِلْمَلَـٰٓئِكَةِ إِنِّى خَـٰلِقٌۢ بَشَرًۭا مِّن طِينٍۢ

              فَإِذَا سَوَّيْتُهُۥ وَنَفَخْتُ فِيهِ مِن رُّوحِى فَقَعُوا۟ لَهُۥ سَـٰجِدِينَ

              فَسَجَدَ ٱلْمَلَـٰٓئِكَةُ كُلُّهُمْ أَجْمَعُونَ
            </p>
          </div>

          <div className='paragraph_heading'>
            <p>  ОДАМ (A.С.) НИНГ ЯРАТИЛИШИ </p>
          </div>


          <div className='main_text'>
            <div className='speech-bubble'
              style={{ display: visibleBubbles[2] ? 'block' : 'none' }}
              onClick={() => handleSupClick(2)}
            >
              <p>
                <sup>2</sup> Ҳадиси шарифларга биноан Одам алайҳис-салом жума куни яратилган эканлар (Муслим, Абу Довуд, Термизий, Ибн Можа).
              </p>
            </div>
            <p onClick={() => handleSupClick(2)}
            >
              Оллоҳ (а.ж.) тупроқдан одам ясаб, димоғига Ўз руҳидан ҳаёт нафасини уфуради ва одам нафас ола бошлайди. <span className='vitalic'> Ўшанда ер юзида у кишидан бошқа инсон йўқ эди.<sup>2</sup></span>
            </p>
            <p></p>
          </div>

          <div className='main_text'>
            <p>
              Кейин Оллоҳ (а.ж.) Адан деган жойда бир боғ яратиб,
              чиройли ва меваси ширин дарахтлар билан тўлдиради. Боғнинг ўртасида икки дарахт ўсган экан: бири ҳаёт дарахти, иккинчиси эса яхши ва ёмонни билиш дарахти.
              Оллоҳ таоло Одам (а.с.) ни, боғни парвариш қилсин, деб ана шу ерга жойлаштиради.
            </p>

            <p>
              Кейин огоҳлантиради: «Боғдаги ҳамма дарахтлар мевасидан еявер. Фақат яхши ва ёмонни билиш дарахтидан ема. Еган куниёқ ўласан!»
            </p>

            <p className='vitalic'>
              То-Ҳо сурасида Оллоҳ таолонинг Одам (а.с.) га шайтон ҳақида огоҳлантириш бергани ёзилган: <span className='boldItalic'> «Эй Одам, албатта, у сенга ва жуфтингга душмандир. Яна у икковингизни жаннатдан чиқариб, бадбахт бўлиб қолмагин»</span> (20:117).
            </p>
          </div>

          <div className='paragraph_heading'>
            <p> БИРИНЧИ ПАЙҒАМБАР </p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'
              style={{ display: visibleBubbles[3] ? 'block' : 'none' }}
              onClick={() => handleSupClick(3)}
            >
              <p>
                <sup>3</sup> Абу Жаъфар Муҳаммад ибн Жарир ат-Табарий, “Тарихул умам вал мулук”.
              </p>
            </div>
            <p className='vitalic' style={{ textAlign: 'justify' }}
              onClick={() => handleSupClick(3)}
            >
              Улуғ саҳобалардан Абу Зар (р.а.) пайғамбаримиз (с.а.в.) дан: «Биринчи пайғамбар ким?» деб сўраган экан. Расулуллоҳ (с.а.в.): «Биринчи мурсал пайғамбар — Одам (а.с.). Оллоҳ уни қўли билан ясади, унга руҳ киритди ва гўзал инсон қилиб яратди», деб айтадилар. Абу Зардан (р.а.) қилинган бошқа бир ривоятда шундай дейилади: «Мен расулуллоҳдан (с.а.в.): «Эй Оллоҳнинг расули, Одам пайғамбарлардан эдими?» деб сўрадим. Расулуллоҳ (с.а.в.): «Албатта, Одам — биринчи бўлиб Оллоҳ билан бевосита гаплашган пайғамбар», деб жавоб бердилар».<sup>3</sup>
            </p>
          </div>

          <div className='paragraph_heading'>
            <p>  ҲАЙВОНЛАРГА ОТ БЕРИШ </p>
          </div>


          <div className='main_text'>
            <div className='speech-bubble'
              style={{ display: visibleBubbles[4] ? 'block' : 'none' }}
              onClick={() => handleSupClick(4)}
            >
              <p>
                <sup>4</sup> Бақара сураси: «(Оллоҳ) Одамга исмларнинг барчасини ўргатди» (2:31).
              </p>
            </div>
            <p>
              <span className='vitalic'>Ҳазрати Одам жаннати боғни кезар эканлар, жуфт-жуфт бўлиб юрган ҳайвонларни, гала-гала учиб юрган чиройли қушларни томоша қилардилар. Ҳамма нарса жуда гўзал, жуда ажойиб эди.</span>
            </p>
            <p onClick={() => handleSupClick(4)}>
              Худо Ўзи яратган жониворларни Одам (а.с.) нинг олдига келтиради ва у киши ҳаммасига, ҳайвонлару қушларга от<sup>4</sup> қўядилар.
            </p>
            <p></p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'
              style={{ display: visibleBubbles[5] ? 'block' : 'none' }}
              onClick={() => handleSupClick(5)}
            >
              <p>
                <sup>5</sup> Шу ўринда кимдир: «Нима учун улар  муносиб шерик бўлолмас эди?» деб сўраши мумкин. Ҳайвонларга ҳам муайян миқдорда ақл берилган, лекин инсонда бор  тафаккур уларда йўқ.
              </p>
            </div>

            <p onClick={() => handleSupClick(5)} >
              <span className='vitalic'  >Унга етишмай турган биттаю битта нарса — ўзига муносиб шерикнинг топилмагани эди.<sup>5</sup></span>
            </p>
          </div>

          <div className='paragraph_heading'>
            <p> МОМО ҲАВВОНИНГ ЯРАТИЛИШИ </p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'
              style={{ display: visibleBubbles[6] ? 'block' : 'none' }}
              onClick={() => handleSupClick(6)}
            >
              <p>
                <sup>6</sup> Шариатда муносиб жуфт танлаш кераклиги алоҳида уқтирилган.
              </p>
            </div>
            <p onClick={() => handleSupClick(6)} >
              Оллоҳ субҳанаҳу ва таоло, Одамнинг ёлғиз бўлиши яхши эмас, Мен унга муносиб жуфт<sup>6</sup> яратаман, деб айтган эди. Одам (а.с.) ҳайвонларга от қўйганларидан кейин,
              Худо у кишининг биқинидан Момо Ҳаввони (р.а.) яратади.
            </p>
            <p></p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'
              style={{ display: visibleBubbles[7] ? 'block' : 'none' }}
              onClick={() => handleSupClick(7)}
            >
              <p>
                <sup>7</sup> Ҳазрати Салабийнинг “Ароис” китобида ёзилишича Оллоҳ таоло Одам (а.с.) ни ухлатиб, қовурғасидан Момо Ҳавони яратган экан.
              </p>
            </div>
            <p onClick={() => handleSupClick(7)} >
              Ҳазрати Одам Момо Ҳаввони (р.а.) биринчи бор кўрганларида  <span className='vitalic'>(хурсанд бўлиб)</span>: «Бор экан-ку!» деб хитоб қилган эканлар.<sup>7</sup>
            </p>

            <p> <span className='vitalic'>Шундай қилиб, Момо Ҳаввонинг эт-суяги аслида Одам Атодан олинган. Қуръонда айтилганидек: </span>
              <span className='boldItalic'> «Эй одамлар!.. Раббингиз сизларни бир жондан яратган ва ундан унинг жуфтини яратган...» </span> <span className="vitalic">(Нисо сураси 4:1).</span> Шу сабабдан  инсон  никоҳ қурар экан, ота-онасини қўйиб, хотинига пайванд бўлади ва иккови бир танага айланадилар.
            </p>
            <p></p>
          </div>

          <article className='nav_arrows'>
            <div className='flex_it space_between'>
              <div style={{ marginLeft: '0px' }}
                onClick={() => navigate('/qisas-uzbek/introduction')}>
                <div>
                  <span className='left_arrow_span'>&#8592;</span>
                </div>
                <div className='indicator'>
                  <span className=' bottom_arrows_for_qisas' > Муқаддима </span>
                </div>
              </div>

              <div className='central_div'>
                <div>
                  <p>Odam (a.s.) qissasi</p>
                </div>
              </div>

              <div style={{ marginRight: '0px' }} onClick={() => navigate('/qisas-uzbek/creation-of-world')}>
                <div className='indicator'>
                  <span className=' bottom_arrows_for_qisas'>Яратилиш тарихи</span>
                </div>
                <div>
                  <span className='right_arrow_span' >&#8594;</span>
                </div>
              </div>
            </div>

          </article>
         
        </main>
        <aside></aside>
      </div>
    </div >
  )
}

export default Adam
