import React, { useState, useEffect } from 'react';
import { useNavigate } from 'react-router-dom';
import './stories.css'
// import noah_svg from '../../images/noah.svg'
import kamar from '../../images/kamar.png'


const Noah = () => {

  const navigate = useNavigate();

  // const [search, setSearch] = useState('')

  const [windowWidth, setWindowWidth] = useState(window.innerWidth);
  const [visibleBubbles, setVisibleBubbles] = useState({});

  useEffect(() => {
    const handleResize = () => {
      setWindowWidth(window.innerWidth);
    };

    window.addEventListener('resize', handleResize);

    const initialVisibility = {};
    const numberOfCases = 8;
    for (let i = 1; i <= numberOfCases; i++) {
      initialVisibility[i] = window.innerWidth > 970;
      //     console.log(initialVisibility[i])
    }
    setVisibleBubbles(initialVisibility);

    return () => window.removeEventListener('resize', handleResize);
  }, []);

  const handleSupClick = (index) => {
    setVisibleBubbles(prevState => ({
      ...prevState,
      [index]: !prevState[index]
    }));
  };


  return (

    <div className="minister-home stories">
      <div className="separate_into_two_columns">
        <main className="sep_part1">

          <div className='chapter_heading'>
            <div className="kamar">
              <img src={kamar} alt="" />
            </div>
            <div className="img_container">

              <svg

                version="1.1"
                fill="rgb(175, 157, 0)"
                viewBox="0 0 1761 1761" xmlns="http://www.w3.org/2000/svg">
                <g>
                  <path d="m858 1619c-99.3-0.112-211-22.3-298-88.5-87.6-66-106-169-100-267 3.41-23.3 5.02-69.5 15.5-92.4 22.6-85.7 66.1-151 122-225 38.8-44.9 76.6-81 121-116 15.4-11.8 27.8-21.4 44-30.7 23.1-13.6 30.2-22 19.8-23.4-44.4-5.55-103-21.5-148-29.6-11.6-0.629-18.3 14.1-29.1 23.6-2.49 2.25-12.3 4.37-14.5 3.14-34.7-2.83-77-4.26-105 1.4-9.47 1.92-13.2-0.308-9.52-12.7 6.6-19.6 19.8-50 24.4-74.5 0-1.86 1.63-2.87 10-6.19 37.8-12.6 81.3-42.2 115-34.8 1.66 0.54 4.6 1.07 6.52 1.18 108 26.5 229 49.9 330 50.4 7.15-0.132 14.3-0.772 15.9-1.42 17.9 15-8.2 90.6-32.7 89.4-10.3-1.88-24.2-1.18-31.2 1.57-26.4 3.68-43.7 13.1-63.6 27-44.8 28.5-88.1 40.7-127 74.9-93.1 70.4-191 175-213 280-10 82.3-21.6 182 41.9 244 17.3 19.4 32.8 27.4 50.6 43.2 25.6 14.1 53.5 30.3 86.8 43.1 80.2 21.6 161 36 241 31.1 112 17.8 201-25.2 291-30.5 14-0.996 27.8-3.31 41-5.63 22.5-4 20.7-2.76-39.5 26.8-113 58.6-246 97.2-366 97.7zm5.38-199c-36.3-2-84.8-13.5-107-44.3-1.69-2.48-3.59-4.95-4.22-5.5-20.4-32.6-22.6-58.7-26.8-91.3 0.0237-37.1 11.9-73.9 18.8-107 5.23-22.6 11.3-44.3 21.4-64.4 1.63-2.72 4.64-6.97 7.23-7.69 2.67 8.63-2.18 16.4-3.47 24.9-4.11 21.4-11.7 46.5-14 66.5-3.81 28-2.1 54.3 7.86 80 20.1 53.2 76.8 64.7 127 57.9 90.8-10.6 162-49.9 230-103 43.5-33.3 65.4-46.7 100-82.6 10.3-13.3 27.7-24.5 34.5-37.7 7.58-16.9 6.22-22.9 1.13-38.5-9.2-5.4-38.8 2.88-49.7 3.5-33.8-1.53-75.8 8.29-109-9.2-21.9-8.74-43.5-31.1-44.9-54.3 0.548-18 5.94-41.4 13.6-57.4 13.1-28.9 29.2-59.8 46-82 3.39-4.46 18.9-20.3 20-20.4 1.54-0.168 2.31-0.401 4.5-1.36 2.6-1.13 26.5 0.532 30 1.4 20.6 7.8 35.4 20.2 48.4 33.3 25.6 26.5 38.5 48.2 52.8 77.1 1.65 4.91 4.9 12.6 5.73 16.5 0.695 3.48 5.29 5.72 9.4 4.59 25-4.22 118-29.5 99.7-78.2-6.03-22.3-15.6-43.6-27.8-64.1-11.5-17.3-18.6-36.9-27-53.2-4.55-12.4-11.1-41.1-7.35-52.1 2.28-12.4 24.5-78.2 32-73.9 23.9 16.2 41.5 43.2 59.1 61.3 14 14.1 18 21.1 14.2 24.9-3.04 10-4.75 16.3-16.8 22.7-1.51 0.765-2.75 2.19-2.75 3.16s-0.45 2.05-1 2.39c-2.39 1.48 0.524 10.2 7.55 22.5 9.47 18.1 12.6 33.2 16.2 53 2.25 59.3-36.2 121-72.2 158-14.1 13.6-30.9 26.6-46.2 35.7-14.8 8.79-16.9 11.9-18.4 27-1.94 14.3-4.63 27.2-7.29 40.8-24.2 69.2-93.2 130-144 177-71 64.2-172 120-257 132-9.53 1.27-13.9 1.54-21 1.28zm338-436c-19.1-30.5-44.7-50.8-78.1-57.9-6.92-1.87-21.5 0.912-25.1 5.68-6.28 8.42-4.42 18 5.15 26.5 22.6 22.3 72.8 36.4 98 25.7zm177 432c-14.2-5.75-14.9-25.7-1.83-47.9 11.1-19.9 27.7-38.5 45-52.8 5.03-4.08 10.5-8.91 12.1-10.7 4.77-5.44 5.76-5.31 2.68 0.353-1.59 2.92-7.62 10.3-13.4 16.5-41.3 43.9-49.7 60-37.2 71.7 5.66 5.28 7.44 4.85 13.2-3.19 9.01-12.6 21.2-5.61 17 9.76-3.34 12.4-24.5 21.6-37.6 16.3zm-1100-174c-19.3-15.2 1.01-58.4 45.1-96.2 8.25-7.07 15.6-13.8 16.3-14.9 0.692-1.13 1.68-2.06 2.2-2.06 2.4 0-6.51 12.4-16.5 22.9-40.6 42.8-49.4 61.4-34.1 71.9 4.87 3.34 6.07 2.82 11.3-4.87 8.79-12.9 21.6-5.64 17.4 9.87-4 14.6-29.7 22.9-41.7 13.4zm511-140c-13.9-2.23-26-15.4-25.9-28.3 0.098-36.5 32.5-82.1 97.9-138 31.8-27.2 11.7-1.42-30.1 38.7-4.04 3.87-9.85 10.4-12.9 14.5-15.9 21.4-19.8 26.7-20.9 28.9-0.709 1.34-2.36 3.59-3.67 5-2.2 2.37-5.44 9.61-6.9 15.4-2.4 9.57 8.28 23.7 11.5 15.3 1.37-3.59 14.6-4.93 22.1-2.24 14.9 5.36 6.01 32.5-15.9 48.4-4.39 3.18-7.61 3.71-15.1 2.51zm790-25.5c-19.3-6.11-24.6-34.5-10.6-56.8 24.6-45.8 67.2-63 90.7-91.3 1.44-1.95 11.9-5.79 11.9-4.37-20.5 19.5-44.2 39.3-62.1 55.6-19.3 17.4-26.8 33.6-20.6 44.2 6.76 11.5 12.5 14.6 16.3 8.64 11.9-18.5 12-18.6 18.8-15.3 3.19 1.56 5.72 3.48 5.79 4.4 2.64 30.8-26.3 62.5-50.1 54.9zm-1403-83.2c-23.9-11.6-18.3-43.4-5.97-60.9 23.8-44.7 52-60 87.5-85.8 4.42-3.26 11.5-6.04 11.5-4.51 0 1.03-12.4 12.6-16.5 15.4-19 13.5-34.1 29.5-46 41.4-13.3 13.3-12.8 12.7-17.4 20.8-7.08 12.5-6.27 19 3.76 29.8 5.73 6.21 9.24 4.83 14.7-5.81 5.73-11.2 12.4-13 19.1-5.32 4.24 4.91-1.68 27.9-9.72 37.7-13.6 16.7-27.7 22.6-40.9 17.2zm1041-235c-21.8-20.6-49.7-36.5-75.9-50.2-18.4-9.55-19.4-12.4-8.34-24.9 12.6-17.1 25.6-40.6 36.9-53.8 1.1-1.28 2-2.77 2-3.29 19.2-11.4 70.6 41.8 94.3 54.6 7.4 3.86 7.44 4.93 0.841 20-8.4 23.3-21.6 34.6-34.3 52.3-3.57 5.1-12.2 8-15.6 5.22zm-975-81.6c-3.92-13.5-6.87-33.5-10.6-48.2 0-3.67-7.37-24.2-11.6-32.2-4.24-8.1-9.92-13.2-15.7-14-9.87-1.36-0.445-25.8 11.1-28.7 8.9-2.23 17.3 16.6 27.7 62.2 4.54 19.9 6.82 19.3 13.6-3.5 19.8-66.8 40.8-91.9 55.3-66.1 4.65 8.29 1.22 21.7-6.59 25.8-2.97 1.54-5.73 0.281-5.73-2.62 0-1.4-6.1-4.02-9.37-4.02-5.89 0-13.7 13.4-21.6 37-3.69 11-5.83 17-6.98 19.5-1.41 3.07-5.27 19.5-5.67 24.1-0.197 2.28-0.517 8.44-0.71 13.7-0.389 10.6-1.56 13.4-6.95 16.7-3.86 2.36-4.14 2.37-6.12 0.385zm1308-6.2c-32.3-3.45-9.47-60.4 41.2-103 6.09-5.09 11.8-10.4 12.8-11.9 3.26-4.98 3.59-2.58 0.385 2.81-3.9 6.55-5.97 9.06-16.8 20.4-30.4 31.7-38.6 44.6-38 60.4 0.329 9.2 11.3 13.3 16.2 6.04 8.81-13.1 16.9-12.6 19.4 1.1 2.58 13.7-15.5 26-35.2 23.9zm-676-6.74c4.77-12.3 17.3-20.7 26.2-26.3 23.7-16 34.9-28.9 34.7-53.8-0.079-8-0.428-9.69-2.96-14.3-5.68-10.4-8.19-11-21.2-4.79-16.3 11.7-25.1 30.4-41.5 37.2-1.9 0.776-2.68-3.8-0.845-4.94 7.41-11.7 16.7-23.3 24-31.3 11.3-12.8 40-58.3 64.3-39.6 22.6 24.9 3.18 61.8-6.12 83.8-1.14 2.7-3.75 6.87-5.81 9.27-3.44 11-19.2 15.9-25.1 22.7-13.5 10-28.8 16.7-43.4 24.7-3.2 1.79-3.84 1.08-2.32-2.55zm173-92.5c-1.84-1.71-1.99-2.44-1.11-5.26 0.758-7.85 6.35-12.5 10.1-18.2 14.9-16.9 35.6-24.7 53.2-37 45.5-30.7 88-62.5 130-95.7 31.4-25.1 33.8-28.3 25.5-35-15.6-15.7-24-20.4-21.4-45.5 13.6-26.7 34.6-54.6 58.9-62.4 8.85-3.81 18.3-3.37 27.2-2.19 8.82 3.98 19.8 24.2 16.1 35.5-6.12 16.8-10.6 43.7-25.6 53.5-7.08 11.8-7.05 11.8-4.36 13.4 14.3 18.5 53.9 26.7 25.8 57-17.8 11.7-31.8-4.02-44.6-16.5-15.4-15.2-13.5-15.8-45.1 14.8-47.2 40.9-97.5 84.8-150 118-10.4 4.58-45.4 32.9-54.4 25.5zm259-217c18.8-25.5 3.91-55.8-22.8-42.5-31.1 17.5-15.5 32.9 8 47.3 8.09 7.65 6.28 6.85 14.8-4.72z" />
                  <path d="m688 552c-5.5-4.07-10.7-7.39-11.5-7.39-0.825 4e-3 -2.61 1.81-3.97 4.01-1.36 2.2-3.38 4.6-4.5 5.33-4.93 3.22-5.86 2.95-15.1-4.43-4.87-3.9-9.5-7.45-10.3-7.88-1.39-0.776 0.285-3.47 8.69-14l1.94-2.44 6.66 6.1c3.66 3.35 8.75 7.08 11.3 8.29l4.66 2.19 3.04-3.36c1.67-1.85 4.5-5.16 6.29-7.35 2.9-3.56 3.36-3.8 4.3-2.24 0.577 0.962 1.54 1.75 2.13 1.75 0.595 0 5.54 3.2 11 7.12 8.47 6.09 9.8 7.42 9.24 9.25-1.55 5-9.07 12.7-12.2 12.5-0.92-0.0482-6.17-3.41-11.7-7.48zm-219-18.1c3.71-9.85 3.48-9.58 16.5-19.1 27.4-19.9 68.7-47.8 69.6-46.9 0.725 0.725-2.49 11.5-4.07 13.7-0.641 0.871-7.02 5.39-14.2 10-7.15 4.65-16.4 10.7-20.6 13.4-4.2 2.73-12.1 8.07-17.5 11.9-5.42 3.81-12.1 8.49-14.9 10.4s-7.4 5.67-10.3 8.33c-2.93 2.66-5.72 4.84-6.21 4.84s0.255-3 1.64-6.67zm386-51.3c-7.38-2.17-15.7-7.3-20.3-12.5-3.3-3.77-9.12-14.8-9.12-17.2-2e-3 -2.83-2.07-0.892-5.09 4.77-5 9.39-13.9 18.5-20.5 20.9-7.6 2.84-15.2 2.71-21.3-0.386-10.3-5.24-13.7-10.4-14.5-22.1-0.227-3.3-0.449-6.11-0.494-6.25-0.428-1.31-6.2 0.405-10.4 3.08-18.6 11.9-38.7 19.5-62.7 23.5-22.7 3.86-31.6 4.64-53 4.64-18.8 4e-3 -22.9-0.294-32.5-2.34-12.9-2.76-19.1-5.19-26.1-10.3-8.7-6.35-13.4-13.4-17-25.4-2.61-8.71-2.4-27.1 0.45-38.8 1.19-4.86 2.16-9.91 2.16-11.2 0-1.32 1.14-5.8 2.54-9.96s2.27-7.99 1.94-8.52-1.68-0.964-3.01-0.964c-1.73 0-2.25 0.422-1.83 1.5 0.415 1.08-0.106 1.5-1.86 1.5-3.49 0-3.71 0.566-2.16 5.71 2.12 7.04 1.5 8.56-0.803 1.96l-2.03-5.83-2.88 2.76c-4.13 3.96-16.4 22.8-24.4 37.4-16.3 29.9-31.4 45.5-43.6 45.4-9.61-0.145-14.6-2.97-19.9-11.3-9.82-15.3-7.27-43.5 6.49-71.5 3.33-6.8 3.35-6.91 0.702-3.92-1.5 1.69-6.55 7.94-11.2 13.9-14.5 18.4-30 31.5-40.7 34.5-2.09 0.58-7.87 1.06-12.9 1.06-8.25 5e-3 -9.45-0.247-13.5-2.84-5.94-3.81-7.51-5.74-10.4-12.7-3.37-8.3-3.95-13.7-2.65-24.5 1.59-13.2 5.12-24.5 12.3-39.6 3.74-7.79 9.64-16.8 10.5-15.9 0.31 0.31-0.107 1.35-0.927 2.32-6.19 7.28-16.8 36.4-16.8 46.1 0 4.26 3.68 13.3 7.1 17.5 4.03 4.89 10.3 7.7 17.1 7.7 19.7 0 36.2-9.96 57.8-35 24.1-27.8 27.2-31 38.4-39.2 7.39-5.43 10.2-6.81 16.8-8.27 2.41-0.531 2.63-0.938 2.15-3.92-0.297-1.83 0.192-6.18 1.09-9.66 3.32-13 12.3-24 19.5-24 8.1 0.0498 19.8 8.53 29.4 21.3 8.12 10.8 8.71 12.3 7.09 17.7-1.85 6.18-7.3 14.2-10.9 16-2.04 1.03-6.88 1.61-15.2 1.84-9.18 0.248-12.2 0.656-12.2 1.62 0 0.711 1.83 5.51 4.06 10.7 2.23 5.16 4.49 10.4 5.02 11.7 0.945 2.3 1.04 2.26 6.69-2.91 8.45-7.73 15.1-9.93 18.6-6.13 1.91 2.11 1.26 5.34-3.36 16.7-6.35 15.6-8.42 25-8.44 38.5-0.0161 10.8 0.305 13.3 2.39 18.8 4.29 11.3 14.4 19.7 29.6 24.5 20.2 6.49 56.1 7.47 94.5 2.58 10.6-1.35 14.2-2.17 31-7.14 17.6-5.2 32.8-13 46.9-24 1.33-1.04 2.8-1.51 3.25-1.06s-0.102 4.39-1.24 8.75c-2.38 9.09-2 13.1 1.65 17.4 3.89 4.62 8.81 7.15 15.9 8.15 9.05 1.28 15.8-1.24 21.9-8.19 4.18-4.78 4.42-5.4 5.52-14.4 0.634-5.16 1.15-12.9 1.14-17.2-0.0101-9.12-2.81-50.2-3.5-51.3-0.258-0.417-4.86 0.275-10.2 1.54-23.7 5.58-56.8 8.95-79.8 8.12-9.35-0.338-18.8-0.87-21-1.18-4.29-0.61-3.08-1.29-35.5 19.9-16.3 10.7-37.5 25.8-41.5 29.6-4.04 3.83-7.47 6.03-9.43 6.03-1.97 0-0.95-3.46 2.8-9.5 4.67-7.52 13.5-14.4 54.1-42.1 9.32-6.35 11.5-8.42 8.83-8.42-3.04-2e-3 -13.9-6.1-17.2-9.66-5.64-6.06-9.68-15.1-10.9-24.3-0.85-6.66-1.33-8.02-2.81-8.02-1 0-2.77 1.65-4.02 3.75-5.66 9.51-18.6 25.4-24.5 30.2-5.43 4.35-7.77 5.47-15.6 7.52-5.09 1.33-12.2 2.51-15.8 2.63-14.9 0.495-15.8-0.632-3-3.83 16.4-4.1 29.4-11.6 43.3-25.1 13.6-13.1 16-20.4 17.8-52.4 0.869-15.9 0.845-31.3-0.103-65-0.683-24.3-1.17-45.9-1.08-47.9 0.0906-2.06-0.187-3.75-0.618-3.75s-9.21 5.51-19.5 12.2c-10.3 6.74-22.6 14.7-27.2 17.7l-8.53 5.42 1.68 2.58c0.924 1.42 5.48 7.72 10.1 14 14.8 20 23.7 35.9 27 48.1 2.85 10.5 4.45 25.9 3.68 35.4-0.756 9.37-4.13 22-6.36 23.8-1.29 1.05-1.44 0.979-0.91-0.435 5.4-14.4 5.36-35.9-0.0894-46.5-4.44-8.59-22-34.3-40.2-58.8l-7.19-9.69-3.16 2.39c-1.74 1.31-5.64 4.09-8.66 6.17-3.02 2.08-7.3 5.48-9.5 7.55-4.6 4.33-8.11 6.35-9.52 5.48-1.53-0.948-1.23-1.86 2.84-8.64 2.98-4.95 5.78-7.82 12.7-13 4.9-3.68 9.05-7.11 9.22-7.61 0.17-0.509-2.13-4.47-5.12-8.81-14-20.3-24.1-38.4-27-48.3-2.66-8.96-2.02-35.1 0.868-35.1 1.24 0 3.95 5.5 4.91 10 0.539 2.51 8.75 16.1 12.8 21.2 2 2.52 2.07 3.12 0.969 7.91-1.08 4.69-0.995 5.57 0.918 9.24 3.64 6.98 23.4 34.6 24.7 34.6 0.711 9e-3 3.64-1.71 6.5-3.81 2.86-2.1 16.2-11.2 29.6-20.2l24.4-16.4-1.42-33.1 3.94-4.98c2.17-2.74 4.5-6.68 5.18-8.76 1.56-4.74 3.54-4.24 3.61 0.917 0.111 8.29 1.72 36.4 2.09 36.4 0.324 0 14.2-9 34.9-22.6 10.8-7.12 18.3-12.6 24.1-17.9 3.37-3.01 6.41-5.2 6.75-4.85 3.84 3.84-7.47 22.9-16.2 27.4-3.41 1.74-8.97 5.11-17.2 10.4-3.58 2.31-11 7.01-16.5 10.4-5.5 3.43-11.4 7.19-13.2 8.35l-3.17 2.11 0.408 16.5c0.224 9.1 0.627 40.2 0.895 69 0.505 54.5 1.29 66.2 5.25 78.8 3.28 10.4 14 17.9 32.6 22.8l9.81 2.58 7.69-5.27c4.23-2.9 14.7-9.87 23.2-15.5 27.5-18.1 40.4-27.2 46.3-32.5 4.1-3.66 6.13-4.87 6.88-4.12 2.98 2.98-4.57 17.2-12.5 23.5-2.29 1.83-7.77 5.48-12.2 8.11s-10.5 6.41-13.6 8.41c-3.1 2-8.5 5.4-12 7.56-12.5 7.68-16.9 10.8-16.4 11.6 0.27 0.437 9.38 0.859 20.2 0.937 19.6 0.142 47.8-2.22 61.1-5.13l5.36-1.16-0.588-4.07c-2.13-14.8-3.29-29.1-4.23-52.6-0.839-21-0.187-24.6 6.84-37.7 4.24-7.91 5.19-9.1 6.47-8.04 1.59 1.32 1.54 2.98-0.646 20.8-0.7 5.72-0.726 13.9-0.0807 25 0.528 9.08 1.24 21.7 1.58 28 0.656 12.2 1.99 24.9 2.7 25.6 0.725 0.725 20.7-5.53 27.1-8.51 3.37-1.56 8.04-4.71 10.4-7 4.82-4.72 6.55-4.66 5.16 0.181-2.51 8.74 0.616 14.5 9.15 16.8 11.6 3.13 23.8-1.07 34-11.7 3.35-3.49 6.32-6.34 6.61-6.34s0.25 2.22-0.08 4.93c-0.526 4.32-0.282 5.31 1.99 8 2.82 3.35 5.32 3.78 11.7 2.01 5.16-1.43 9.91-5.86 13.3-12.4 3.05-5.84 3.16-5.93 5.17-4.66 0.987 0.626 1.04 1.48 0.209 3.66-1.39 3.65-0.48 7.7 2.3 10.3 3.34 3.1 12 5.58 16.8 4.81 8.79-1.4 18.2-8.78 19.6-15.4 1.31-6.18 0.822-47.6-0.984-83.2-0.932-18.4-1.97-44.1-2.31-57-0.337-12.9-0.906-28-1.26-33.5-1.04-16.1 0.079-23 5.46-33.7 4.06-8.07 4.77-8.98 5.88-7.47 0.693 0.948 1.55 3.85 1.9 6.46 0.349 2.6 1.53 7.66 2.62 11.2 2.58 8.44 2.51 12-0.295 16.1l-2.29 3.39 0.751 26.5c0.413 14.6 0.754 37.5 0.758 51 0 13.5 0.465 31.2 1.02 39.5 2.18 32.2 1.16 50-3.53 61.9-4.94 12.6-15.7 25.1-26.7 31.1-9.47 5.15-21 3.03-27.4-5.06-3.43-4.3-6.02-4.46-11.6-0.686-4.83 3.25-9.97 5.73-14 6.73-2.44 0.608-3.38 0.0992-7.23-3.92-2.44-2.54-5.01-4.62-5.73-4.62s-3.76 1.61-6.77 3.57c-10.6 6.93-13 7.87-20 7.83-3.58-0.0211-8.17-0.596-10.2-1.28-4.42-1.48-9.8-7.26-9.8-10.5 0-1.29-0.681-2.91-1.51-3.6-2.12-1.76-9.6-0.573-15.3 2.44-2.55 1.34-6.73 3.32-9.28 4.4-4.63 1.96-4.64 1.98-4.25 6.32 2.19 24.5 3.39 40.8 3.39 46.3 0 8.78 2.49 20.8 5.71 27.5 6.56 13.7 19.3 21.3 37.8 22.7 8.82 0.669 25.5-1.22 25.5-2.9 0-0.568-1.01-2.01-2.25-3.2-8.55-8.24-20.9-26.7-18.8-28 0.512-0.317 1.86-3.06 3-6.1 3.68-9.84 12.3-20.4 22.4-27.5 13.2-9.28 23.1-10.2 36.9-3.58 7.54 3.64 14.8 9.66 14.8 12.3 0 3.57-7.76 3.26-15-0.608-1.15-0.615-5.94-1.74-10.6-2.5-7.82-1.27-9.16-1.23-15.7 0.473-13.5 3.49-21.7 8.62-21.7 13.5 0 6.56 17.4 29.4 25.5 33.5 7.56 3.78 20.2 3.52 40.5-0.817 8.52-1.82 16.3-3.53 17.2-3.79 4.62-1.31 2.31 7.89-3.34 13.3-2.85 2.72-4.48 3.33-11.3 4.27-12.7 1.73-33.8 6.69-62 14.5-23 6.41-36.4 7.7-47.1 4.54zm-352-42.4c8.05-4.72 15.1-13.7 26.8-34.5 7.25-12.8 12.3-20.4 19.3-29.2l5.26-6.59-2.21-5.41c-2.31-5.66-10.1-19.6-12.2-21.6-3.24-3.26-22.3-2.13-30.5 1.79-7.36 3.52-17.5 11.6-24.1 19.2-3.44 3.96-4.82 5.87-3.06 4.26 4.33-3.96 4.04-1.77-0.681 5.2-16.7 24.7-19.1 51.5-5.66 63.9 2.48 2.28 6.2 4.62 8.27 5.2 5.76 1.62 13.7 0.656 18.7-2.26zm56.2-117 2.76-2.37-4.18-4.99c-7.54-9-19.3-15.3-22.1-11.9-1.45 1.74 0.259 13.8 2.44 17.3 1.54 2.45 6.84 4.11 13.6 4.26 3.59 0.0791 5.34-0.452 7.45-2.27zm478 122c-0.347-0.347-0.1-1.58 0.55-2.75 1.86-3.34 1.52-26-1.32-88.1-0.554-12.1-1.02-24.9-1.03-28.5s-0.217-10.3-0.458-15-0.875-23.8-1.41-42.5-1.18-38.5-1.43-43.9c-0.251-5.46-0.053-12.4 0.438-15.4 0.872-5.36 8.6-22.2 10.2-22.2 1.17 0 2.75 4.66 2.75 8.11 0 1.64 1.16 6.56 2.58 10.9 2.83 8.74 2.66 12.1-0.806 16.5-2.09 2.65-2.09 2.72-1.03 48.8 0.585 25.4 1.05 47.3 1.03 48.6-0.017 1.38 0.736 20 1.67 41.5 1.82 41.6 1.58 51.5-1.63 66.5-2.2 10.3-2.99 12.3-6.12 15.8-2.14 2.35-2.94 2.67-4 1.62zm-146-134c1.1-3.14 2.64-6.93 3.41-8.42 1.28-2.48 14.3-12.5 32.9-25.4 3.98-2.75 9.66-6.69 12.6-8.76 16.1-11.3 37.1-24.8 37.7-24.3 0.332 0.332-0.392 3.69-1.61 7.47l-2.21 6.86-13.7 8.93c-7.55 4.91-17.2 11.1-21.4 13.9-4.2 2.71-12.1 8.06-17.5 11.9-5.42 3.82-12.1 8.5-14.9 10.4s-7.4 5.64-10.3 8.3c-2.93 2.66-5.71 4.84-6.17 4.84s0.0591-2.57 1.16-5.71zm-452-8.58c-2.63-2.63-3.51-4.36-3.51-6.9 0-13.2 11.7-34.5 27.1-49.3 5.22-5.04 5.91-5.47 4.32-2.66-1.04 1.84-3.29 4.99-5 7-6 7.05-14.7 19.7-17.1 24.9-3.11 6.7-3.46 13.3-0.874 16.1 2.7 2.99 3.97 2.64 6.97-1.9 1.46-2.2 3.06-4 3.56-4 2.01 0 4.06 3.34 4.06 6.62 0 7.05-4.11 11.4-12.3 12.9-3.34 0.626-4.06 0.346-7.22-2.81zm402-33.7c-3.51-2.77-3.56-6.14-0.202-13.7 2.89-6.55 13.5-24.5 14.2-23.9 0.224 0.224-2.09 4.88-5.15 10.4-7.73 13.8-7.32 17.2 2.23 18 5.66 0.487 11.2-2.38 11.2-5.8 0-4.3 3.24-14.5 5.58-17.6 1.33-1.75 2.42-3.69 2.42-4.31 0-0.619 0.396-0.881 0.879-0.582 0.489 0.302 0.283 3.32-0.465 6.81-2.06 9.62-1.82 13.5 1.04 16.3 1.87 1.87 3.51 2.45 6.88 2.45 6.39 0 7.33-1.57 5.3-8.82-0.896-3.19-1.63-6.96-1.63-8.37 0-4.35 6.58-14.6 7.11-11.1 0.0627 0.412 0.268 2.09 0.457 3.72s0.802 5.93 1.36 9.54c1.38 8.9 0.107 13-5.97 19.4l-4.84 5.08h-6.46c-4.85 0-6.96-0.454-8.48-1.83-2.26-2.05-3.77-1.57-9.98 3.14-4.68 3.55-11.8 4.11-15.5 1.22zm-64.2-16c-0.322-0.521 1.38-4.02 3.79-7.78 5.68-8.87 14-15.2 69.7-52.7 13.5-9.08 33.7-22.7 45-30.3s22.5-15.1 25-16.6c8.57-5.23 21.5-14.7 27.7-20.2 8.55-7.63 10.8-5.69 5.74 4.98-3.91 8.26-9.6 13.9-21.3 21.1-5.88 3.61-13.4 8.34-16.7 10.5-3.3 2.16-8.02 5.16-10.5 6.66-5.3 3.22-19 12.3-38.5 25.4-7.7 5.2-17.8 11.9-22.5 14.8-21.6 13.5-51.7 34.7-58.2 40.7-4.49 4.2-7.99 5.51-9.26 3.45zm-42.4-23.1c-0.546-1.33-1.95-7.36-3.13-13.4-2.62-13.5-5.84-21.1-9.56-22.5-2.4-0.913-2.62-1.39-2.1-4.62 0.611-3.76 3.13-7.35 5.17-7.35 2.66 0 4.96 4.58 7.65 15.3 1.56 6.19 2.84 12 2.84 13s0.624 1.75 1.38 1.75c0.861 0 1.98-2.41 2.99-6.43 4.42-17.6 11.1-30.6 15.7-30.6 3.93 0 6.36 7.5 3.92 12.1-1.27 2.36-2.74 2.45-5.12 0.296-3.38-3.06-5.83 0.553-10.9 16-1.79 5.49-3.5 13.3-3.88 17.7-0.454 5.29-1.22 8.42-2.34 9.54-1.55 1.55-1.73 1.5-2.65-0.751z" />
                </g>
              </svg>

            </div>
            <div className='title_of_chapter'>
              <p> НУҲ АЛАЙҲИС-САЛОМ  </p>
              <p>ҚИССАСИ</p>
            </div>
          </div>



          <div className='decor_line'>
            {/* <p> &#8213;&#8213;  &#10044; &#8213;  &#10044;  &#8213;  &#10044;  &#8213;&#8213;   </p> */}
          </div>


          <div className='main_text'>
            <div className='speech-bubble'

              style={{ display: visibleBubbles[1] ? 'block' : 'none' }}
              onClick={() => handleSupClick(1)}


            >
              <p>
                <sup>1</sup> Қуръони каримнинг Юнус сураси 10:72-73.
              </p>
            </div>
            <p className='boldItalic' onClick={() => handleSupClick(1)}>
              «Менинг ажрим фақат Оллоҳ­­дан, – деди <span className="vitalic">(Нуҳ алайҳис-салом). </span> – Ва мен му­сул­мон бўлишга амр қилинганман». Сўнг­ра уни ёл­ғон­чи­га чи­қаришди. Бас, Биз уни ва у ила бирга бўлганларни ке­ма­да қутқар­дик ва уларни хали­фа­лар қил­дик. Оятларимиз­ни ёл­ғон­га чи­қар­ган­лар­ни ғарқ этдик. Огоҳлантирилган­лар­нинг оқи­ба­ти қан­дай бўл­га­ни­га назар сол».<sup>1</sup>
            </p>

            <p>Орадан анча вақт ўтди. <span className='vitalic'>Одамлар кўпайди. Одамлар кўпайган сари гуноҳ ҳам кўпайди.  </span>  Ёмонлик авж олиб, одамларнинг ўю хаёли ҳамиша ёмонлик билан машғул бўладиган бўлди. Оллоҳ бундан норози эди. Чунки Оллоҳ яратган халқ, Оллоҳнинг иродасига қарши чиқиб, осийлик йўлини танлаган эди.
            </p>

            <p>«Мен инсониятни ер юзидан йўқ қиламан», деди Худо.

              Фақат Нуҳ (а.с.) Оллоҳнинг ризосини топган эдилар.    Нуҳ (а.с.) Худо йўлида юрадиган, Худога итоат этадиган солиҳ одам бўлиб, замондошлари орасида бенуқсон деб танилган эдилар.
            </p>
          </div>


          <div className='paragraph_heading'>
            <p> ГУНОҲ УЧУН ЧИҚАРИЛГАН ҲУКМ </p>
          </div>

          <div className='main_text'>
            <p>
              Оллоҳ таоло одамларнинг бузилиб кетганини, зўравонликка берилганини, бутун ер юзининг бузуқлик ва зулмга тўлганини кўриб,  Нуҳ пайғамбарга деди:
            </p>

            <p>
              «Одамлар ер юзини зулм билан тўлдирди. Мен энди бутун инсониятни қириб ташлайман. Сен сарв дарахтидан кема яса. Ичини хона-хона қилиб қур. Кейин ҳам ичидан, ҳам ташқарисидан қатрон сурт.
              Эшигини ён тарафдан қўй.  Мен ер юзига сув тўфони юбораман. Ердаги ҳамма одамларни йўқ қиламан.

              Сен билан эса аҳд тузаман. Сени, аҳлингни, ўғилларингу келинларингни кемада сақлаб қоламан», деди.
            </p>

            <p>
              Ҳазрати Нуҳ (а.с.) Оллоҳнинг ҳамма буйруқларини айтилганидек бажардилар.
            </p>
            <p></p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'

              style={{ display: visibleBubbles[2] ? 'block' : 'none' }}
              onClick={() => handleSupClick(2)}


            >
              <p>
                <sup>2</sup> Насафий, «Мадорик»; Суютий, «Дур-ул-мансур».
              </p>
            </div>
            <p className='vitalic' onClick={() => handleSupClick(2)}>



              Тасаввур қилиб кўринг: на денгизи ва на дарёси бўлмаган далада Оллоҳнинг расули каттакон кема қуриш билан банд. Кеманинг узунлиги тахминан 137 метр, кенглиги 23 метр ва баландлиги 14 метр эди.<sup>2</sup> Уни қуриб битириш учун озмунча вақт кетмайди. Нуҳ (а.с.) нинг танишлари, қўшнилари унинг йиллаб кема қураётганини кўриб, қандай фикрларга борган экан?
            </p>
            <p></p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'

              style={{ display: visibleBubbles[3] ? 'block' : 'none' }}
              onClick={() => handleSupClick(3)}


            >
              <p>
                <sup>3</sup> «Нуҳ (а.с.) нинг қавми пайғамбарларни ёлғончи қилди» (Қуръондан, Шуъаро 26:105).
              </p>
            </div>
            <p className='vitalic' onClick={() => handleSupClick(3)}>
              Кимдир у кишини ақлдан озган деб ўйлади. Кимдир калака қилди. “Худо ер юзига тўфон юбормоқчи, тавба қилинглар!” деса кимлардир ёмон кўрди. “Қандоғ тўфон?! Нима деяпсан ўзи?!” Бироқ Худо дарҳақиқат, ер юзига тўфон юбораман, деб ваъда қилган эди.<sup>3</sup>
            </p>
          </div>

          <div className='paragraph_heading'>
            <p>
              ТЎФОН
            </p>
          </div>


          <div className='main_text'>
            <p className='boldItalic'>
              «Қасамки, Биз Нуҳни ўз қавмига пайғамбар қилдик. ... Бас, уни ёлғончи қилдилар. Шунда Биз уни ва у билан бирга бўлган зотларни кемада қутқардик ва Бизнинг оятларимизни ёлғон деган кимсаларни ғарқ қилиб юбордик»      <span className='vitalic'>(Аъроф сураси, 7:59,64).</span>
            </p>

            <p>
              Ниҳоят, вақт-соати келганда, Оллоҳ таоло Нуҳ (а.с.) га: «Бор, хонаводангни олиб кемага кир, — деди. — Мен ер юзида сендан бошқа солиҳ одам топмадим. Насли йўқолиб кетмаслиги учун ўзинг билан ҳалол ҳайвон ва қушларнинг ҳар биридан етти жуфт, ҳаром ҳайвонлардан бир-бир жуфт, эркак-урғочи аралаш оласан.   Мен етти кундан сўнг ер юзига қирқ кечаю қирқ кундуз ёмғир ёғдираман. Ўзим яратган бутун тирик мавжудотни ер юзидан супуриб ташлайман», деди.
            </p>
            <p></p>
          </div>
          <div className='main_text'>

            <div className='speech-bubble'

              style={{ display: visibleBubbles[4] ? 'block' : 'none' }}
              onClick={() => handleSupClick(4)}


            >
              <p>
                <sup>4</sup>  «Кемага мининглар, унинг юриши ҳам, туриши ҳам Оллоҳнинг исми ила бўлур. Албатта, Раббим мағфиратли ва раҳмлидир», деди (Нуҳ (а.с.), Ҳуд сураси 11:41).
              </p> </div>
            <p onClick={() => handleSupClick(4)}>
              Нуҳ (а.с.) Оллоҳ таолонинг ҳамма буйруқларини айтилганидек бажардилар ва хонаводасини, ўғиллари-ю келинларини олиб, тўфондан омон қолиш учун кемага<sup>4</sup>  кирдилар.   Ўшанда расулуллоҳ олти юз ёшда эдилар.
            </p>
            <p></p>
          </div>

          <div className='main_text'>
            <p onClick={() => handleSupClick(5)}>
              Оллоҳ айтганидай, ҳалолу ҳаром, каттаю кичик ҳайвонлар ва қушлар, эркагу урғочиси жуфт-жуфт бўлиб, ҳазрати Нуҳнинг олдига келди ва кемага кирди.<sup>5</sup>
            </p>
            <p></p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'

              style={{ display: visibleBubbles[5] ? 'block' : 'none' }}
              onClick={() => handleSupClick(5)}


            >
              <p>
                <sup>5</sup>  Ҳуд сураси 11:40 га қаранг.
              </p>
            </div>
            <p>
              Ниҳоят Худо кеманинг эшигини беркитди.
            </p>
            <p></p>
          </div>


          <div className='main_text'>
            <p onClick={() => handleSupClick(6)}>
              Кейин ... тўфон бошланди. Ер қаъридаги чашмаларнинг ҳаммаси юқорига отилиб чиқди. Осмон қопқалари очилиб, қирқ кечаю қирқ кундуз ер юзига шиддатли жала ёғди.<sup>6</sup>
            </p>
            <p></p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'

              style={{ display: visibleBubbles[6] ? 'block' : 'none' }}
              onClick={() => handleSupClick(6)}


            >
              <p>
                <sup>6</sup> Табарий: «Тарих», 1-жилд 94-бет; Замаҳшарий: «Кашшоф», 4-жилд, 37-бет.
              </p> </div>
            <p>
              Бу пайтда ҳазрати Нуҳ ва унинг хонаводаси, ўғиллари Сом, Ҳом, Ёфас (р.а.) ва уларнинг хотинлари кеманинг ичида ўтирган эдилар.
            </p>
          </div>


          <div className='paragraph_heading flex justify-center'>
            <p>
              ҚОЛГАНЛАР ҲАММАСИ ҲАЛОК БЎЛДИМИ?
            </p>
          </div>

          <div className='main_text'>
            <p className='boldItalic'>«Осмон эшикларини шаррос сув билан очиб юбордик. Ва ердан отилтириб, булоқлар чиқардик. Бас, сувлар тақдир қилинган иш учун бирлашдилар. Ва (Нуҳни) тахталари ва михлари бор нарса устига кўтардик» <span className='vitalic'>(Қамар сураси 54:11-13).</span>
            </p>
            <p></p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'

              style={{ display: visibleBubbles[7] ? 'block' : 'none' }}
              onClick={() => handleSupClick(7)}


            >
              <p>
                <sup>7</sup>   “Ўн беш тирсак”: қаранг, Табарий, Салабий ҳамда Қуртубийнинг «Тафсири».
              </p> </div>
            <p onClick={() => handleSupClick(7)}>
              Сув тўфони қирқ кун давом этди. Сувлар кўпайиб, тошиб, кемани ердан баланд кўтарди.
              Бора-бора сув шунчалик кўпайдики, энг баланд тоғлар ҳам сув остида қолди.   Сувлар тошиб, тоғ чўққиларидан ўн беш тирсак<sup>7</sup>  ошиб кетди.

            </p>

            <p>
              Ер юзидаги бор тирик мавжудот: ҳайвонлар, қушлар, инсонлар, хуллас, қуруқликда нафас олиб яшаётган ҳамма нарса ҳалок бўлди. Ер юзидаги ҳар қандай жонзод — инсондан ҳайвонгача, ерда қимирлаган махлуқотдан осмонда учиб юрган қушгача ҳаммаси нобуд бўлди. Фақат ҳазрати Нуҳ ва у билан бирга кемага кирганлар тирик қолган эдилар.
            </p>

            <p className="vitalic">
              Оллоҳ таоло нима учун одамларни ўлимга маҳкум қилди? Гуноҳдан қайтмаганлари учунми? Бир кун эмас бир кун ҳар биримиз Оллоҳнинг ҳузурида, муҳокама бўлиш учун тик турамиз. Худо бизни қилган ишларимизга биноан ҳукм қилади. Ўша пайтда қаердан нажот топамиз? Жон сақлашимиз учун “кема” топилармикан? Ёки охиратини ўйлаганлар ҳозирданоқ “Ҳаёт кемасини” излаши керакми?
            </p>
            <p></p>
          </div>





          <article className='nav_arrows'>
            <div className='flex_it space_between'>
              <div style={{ marginLeft: '0px' }} onClick={() => navigate(-1)}>
                <div>
                  <span className='left_arrow_span'>&#8592;</span>
                </div>

                <div className='indicator'>
                  <span className=' bottom_arrows_for_qisas' > орқага қайтиш </span>
                </div>
              </div>

              <div className='central_div'>
                <div>
                  <p>Нуҳ (a.с.) қиссаси</p>
                </div>
              </div>

              <div style={{ marginRight: '0px' }} onClick={() => navigate('/qisas-uzbek/noah-covenant')}>
                <div className='indicator'>
                  <span className=' bottom_arrows_for_qisas' >  Нуҳ <span className='alayhissalam'>a</span> билан Аҳд </span>
                </div>
                <div>
                  <span className='right_arrow_span' >&#8594;</span>
                </div>
              </div>
            </div>
          </article>
       
        </main>
        <aside>
        </aside>
      </div>
    </div >
  )
}

export default Noah
