import React, { useState, useEffect } from 'react';
import { useNavigate } from 'react-router-dom';
import './stories.css'
import kamar from '../../images/kamar.png'


const ShariahRevealed = () => {

  const navigate = useNavigate();


  const [windowWidth, setWindowWidth] = useState(window.innerWidth);
  const [visibleBubbles, setVisibleBubbles] = useState({});

  useEffect(() => {
    const handleResize = () => {
      setWindowWidth(window.innerWidth);
    };

    window.addEventListener('resize', handleResize);

    const initialVisibility = {};
    const numberOfCases = 10;

    for (let i = 1; i <= numberOfCases; i++) {
      initialVisibility[i] = window.innerWidth > 970;
      //     console.log(initialVisibility[i])
    }
    setVisibleBubbles(initialVisibility);

    return () => window.removeEventListener('resize', handleResize);
  }, []);

  const handleSupClick = (index) => {
    setVisibleBubbles(prevState => ({
      ...prevState,
      [index]: !prevState[index]
    }));
  };


  return (

    <div className="minister-home stories">
      <div className="separate_into_two_columns">
        <main className="sep_part1">

          <div className='chapter_heading'>
            <div className="kamar">
              <img src={kamar} alt="" />
            </div>
            <div className="img_container" style={{ padding: '3px' }}>

              <svg version="1.1" viewBox="0 0 2627 2627"
                fill='rgb(175, 157, 0)'
                xmlns="http://www.w3.org/2000/svg">
                <path d="m1333 2492c-32-6.72-51.7-36-55.1-81.8-0.491-6.77-1.12-12.7-1.39-13.1 6.69-60.4 14.2-127 45-173 4.55-6.68 9.52-14.3 11-17 6.38-11.2 15.4-16.1 15.4-8.38-17 28.9-27.6 59.8-36.4 88.7-11.8 37.3-16.6 86.7 9.03 114 25 25.4 57.2 19.3 105-19.7 7.01-5.74 16-13 19.9-16.2 30.5-24.7 60.5-55.2 109-110 86.2-98.6 115-125 174-163 7.22-4.53 17.2-11 22.2-14.4 4.99-3.38 10.8-6.71 13-7.41 2.16-0.701 5.05-2.05 6.42-3.01 6.12-4.24 16.8-8.67 37.9-15.6 45.9-15.2 49.1-15 70.4 5.43 17.6 16.8 23.8 19.6 38.5 17.2 29.1-4.69 75.2-35.1 92.9-61.3 11.2-16.6 16-12.3 17.3 15.2 0.945 19.6 2.16 23 9.42 26.8 11.7 6.07 43.7-7.19 60.2-24.9 5.78-6.25 6.28-7.15 19.5-35.6 5.93-12.8 11.8-17.2 16.5-12.5 1.89 1.89 1.67 13.6-0.545 28.8-7.72 52.8 40 55.3 92.6 4.67 6.1-5.87 14-13.2 17.5-16.3l6.4-5.61 0.341-10.1c-3.39-24.1 1.42-58.4-7.03-87.9-10.7-65.9-23-138-34.3-204-9.87-57.7-17.8-105-34.5-204-5.55-33-11.4-67.6-13-77-5.19-30.3-34.8-204-40-235-6.26-73.7-25.5-146-30.5-218-0.868-13.2-2.43-24.5-4.28-31 3.01-26.9-15.8-87.6 1.38-109 3.23-4 10.6-13.6 16.4-21.3 18-24 28.7-24.7 33.4-2.02 7.68 28.4 19.4 56.1 32.2 84.2 26.4 57.9 30 69.3 24.3 76.6-3.75 4.77-7.83 3.77-19.9-4.91-12.2-8.73-24.5-16.2-28.9-17.4-3.79-1.09-3.76-1.69-1.04 16.7 8.96 76.5 16.2 145 29.9 217 1.08 5.5 4.91 31.2 8.52 57 5.6 40.1 15.3 109 22.5 160 1.08 7.59 1.96 14.2 1.96 14.8 0 0.524 0.611 0.952 1.36 0.952 0.969 0 1.36 1.5 1.38 5.25 0.012 2.89 17.9 112 39.7 243 21.8 131 39.8 240 40 242 2.98 21.9 4.45 44.1 4.54 66.2 0 19.9-3.89 33.1-18.2 61.8-14.6 29.2-17.8 33.2-35.7 45-7.54 4.95-12.4 9.2-19.8 17.3-23.3 25.5-30.3 31-51.1 40.3-17.9 7.97-26.7 9.41-40.2 6.54-15.5-3.31-19.4-5.87-32.3-20.9-7.98-9.3-13-8.1-28.9 6.98-25.8 24.5-74.8 23.9-74.8-0.899 0-13.4-7.45-16.7-17-7.6-16 15.2-26.8 22.9-43.3 31-29.1 14.3-28.9 14.2-42.5 14.6-18.8 0.599-24.8-2.26-54.3-25.9-13.3-10.7-18.5-13.8-22.8-13.8-6.49 0-24.6 6.64-29.3 10.7-0.94 0.826-4.54 2.5-8 3.72-75.8 32.4-130 91.4-180 148-44.3 43.2-82.1 104-122 140-7.5 6.69-20.4 18.7-28.6 26.7-44.7 43.4-77.6 58.9-110 52zm-326-47.4c-21.1-5.79-43.7-14.7-63-18.1-27.7-4.75-31.4-11.1-18-30.3 10.2-15.5 19.1-30.6 32.8-43.4l6.61 0.396c17 1.01 49.4 9.85 65.1 17.7 27.2 13.7 33.6 11.4 56.7-20 15-20.4 16.6-21.3 27.4-15.9 4.01 2.04 13.9 5.02 28.3 8.53 88.7 21.7 91.1 23.2 79.6 50.8-13.3 31.9-35.6 42.8-64.5 31.5-25.6-5.33-60.7-20.8-82.1-20.9-6.31-0.03-8.92 1.83-12.8 9.13-15.4 28.9-30.7 37.2-56.1 30.4zm736-32.9c-29-8.16-28.9-60.4 0.228-104 2.43-3.61 6.86-10.8 9.84-16 18.5-32 35.1-27.6 19 5.05-15.1 30.7-22.8 52.8-20.1 57.8 6.04 11.3 26.3 3.42 43.1-16.8 12.6-15 15.9-15.3 23-1.58 8.81 17.1 2.64 33.3-17.4 45.5-4.46 2.72-13.2 9.16-19.3 14.3-16.8 14.1-27.5 18.4-38.3 15.3zm-1055-43.9c-23.6-14.4-14.6-73.7 20.4-135 8.04-14.1 18.5-22.6 27.7-22.6 5.19 0-1.84 15.2-19.8 43-16.5 25.5-20.7 39.6-17.1 58.4 4.88 25.9 32 15.4 56.7-22 16-24.2 21.4-28 22.8-16.3 1.75 14.7-23.3 58.1-43.2 74.6-22 18.3-38.6 25.3-47.4 19.9zm165-169c-18.6-2.84-40.8-9.61-53.2-16.2-26.8-14.2-68.2-63.7-81.7-97.8-1.09-2.75-3.65-8.38-5.69-12.5-12.2-24.8-20.6-46.8-22.8-59.9-1.95-11.5-6.58-10.6-16.2 3.14-31.2 44.6-58.9 69.4-93.9 84.1-71.9 30.2-118 40.4-144 31.7-27.1-9.29-34.7-20.2-27.9-39.7 1.7-4.86 3.93-12 4.97-15.8 1.03-3.85 5.06-15.6 8.95-26 24.9-67.1 35.3-79.9 103-127 22.3-15.6 65.3-42.6 91.3-57.2 29.5-16.6 31-32.9 7.46-84.7-3-6.6-6.63-15-8.07-18.8s-3.16-6.75-3.81-6.75c-3.82 0-21.4 10.3-48.1 28.1-18.1 13.5-42.4 22.9-56.8 32.3-70.6 41.1-146 89.1-220 122-12.1 5.37-22.1 10.1-22.3 10.6-0.835 2.17-7.29 3.15-9.22 1.4-2.45-2.22-1.76-3.23 3.92-5.72 2.54-1.12 6.42-3.25 8.62-4.74s15-9.36 28.5-17.5 26.1-16.2 28-18c64.6-32.4 146-98.2 205-136 64.5-41.7 67.1-44.8 55.7-67.6-7.95-16-7.87-16.8 4.25-41.8 3.85-7.96 9.48-19.7 12.5-26 10.2-21.3 17.8-20.9 26.8 1.44 4.75 11.9 7.5 16.7 13.5 23.7 2.52 2.94 5.5 7.46 6.61 10 5.41 12.5 11.4 10.7 39.5-12 52-35.8 106-57.7 167-69.9 48.6-9.71 69 11.9 49 51.7-16.4 32.6-43.1 70.8-65.5 94-25.5 29.7-53.8 56.7-77.4 75.6-23.7 18.9-27 21.3-37.8 26.8-5.14 2.65-9.58 5.46-9.89 6.24-0.302 0.787-1.6 1.83-2.88 2.32-1.35 0.514-2.62 2.06-3.01 3.67-0.372 1.53-1.2 3.55-1.83 4.48-2.51 3.68 4.88 49.2 11.5 70.8 2.1 6.88 5.66 18.6 7.89 26 4.57 15.2 9.85 29.1 16.1 42.5 2.32 4.95 8.13 17.6 12.9 28 13.2 28.9 26.3 49.6 36.8 58.2 6.05 4.95 13 11.9 17.1 17.1 4.12 5.21 12.1 10.7 24.9 17.1 37.8 18.8 70.2 19.8 120 3.69 9.08-2.92 20.5-6.57 25.4-8.1 12.9-4.03 43.5-20.1 60.1-31.5 2.2-1.51 12.1-7.12 22-12.5 20.6-11.1 29.2-16.6 35.4-22.6l4.4-4.25-2.9-2.42c-47.3-39.5-112-47.3-185-22.2-7.47 2.57-10 2.49-13.4-0.391l-2.75-2.37 1.71-7.97c2.91-13.5 12.7-43.4 16.8-51.3 8.48-16.4 34.5-34.4 63.1-43.8 68.4-22.4 83.3-25 153-26.1 96.3-1.61 118-0.264 154 9.49 9.08 2.45 21.2 5.38 26.8 6.51 32.6 6.51 37.2 11.9 27.7 32.2-1.98 4.23-4.96 11.4-6.64 16-8.1 22.1-14.2 30.8-23.6 33.7-3.22 1-9.01 3.26-12.9 5.03-3.85 1.76-9.73 4.24-13.1 5.51-15.2 5.75-28.5 13.4-49.9 28.6-3.82 2.72-11.4 7.21-16.8 9.98-16 8.24-16.9 12.2-3.92 18.6 42.7 21.3 102 6.88 178-43.2 67.7-44.8 75.9-60 48.1-89.3-5.16-5.46-14.5-15.9-20.8-23.3-6.3-7.33-16.4-18.6-22.6-25.1-33.7-35.7-38.3-51.8-24.3-84.9 2.16-5.12 5.59-14 7.61-19.8 5.62-16.1 10.5-22 18.2-22 3.67 0 3.73 0.113 5.81 12 2.73 15.5 11.6 28.6 44.1 65 33.8 37.9 35.1 39.4 40.8 50.9 7.66 15.2 8.19 25.6 2.1 41.2-3.06 7.82-3.85 11.4-4.47 20-0.609 8.56-1.26 11.5-3.53 16-1.87 3.69-2.94 7.61-3.27 12-0.555 7.37-4.11 16-12.1 29.3-2.71 4.53-7.27 12.8-10.1 18.4-16.2 31.7-45.9 58.5-98.1 88.3-7.98 4.55-17 9.94-20 12-21 14.1-68 28-94.9 28-36.4 0.016-74-14.3-90.9-34.7-10.5-12.7-10.7-12.9-16-12.7-95.7 38.2-176 131-284 117zm-355-141c80.8-13.8 159-54.7 171-89.2 1.95-5.59-11.9-63-16.2-66.8-3.58-3.24-3.57-3.24-83.4 41-27.8 15.4-47.2 28.2-55.5 36.7-1.93 1.97-5.76 5.09-8.51 6.94-6.59 4.44-14 10.7-24.4 20.7-4.71 4.5-10.6 9.83-13.1 11.9-23.1 19-28.3 27.8-20.2 34.4 8.98 7.43 24.6 8.84 49.9 4.51zm674-62.9c8.44-4.37 58.2-36.9 58.2-38.1 0-0.196 0.25-1.01 0.556-1.81 1.42-3.7-44.9-5.87-77.1-3.61-34.4 2.42-32.6 0.397-15.2 17.4 7.34 7.15 14.8 15.2 16.7 18 6.56 9.91 10.1 11.6 16.8 8.1zm-437-210c31.7-16.6 50.6-35.7 75.3-57.7 41.2-36.6 53.4-54.2 47.2-68.1-8.27-18.7-45.8-14.1-119 14.7-30 11.7-42.7 18-65.1 32.2-8.05 5.1-7.55 9.89 3.88 36.7 4.73 11.1 9.92 24.2 11.5 29.2 8.11 25 17.5 27.7 46.6 13.1zm879 194c-30.2-9.18-23.1-61.9 16.6-124 2.83-4.4 8.3-13.4 12.2-20 12.5-21.5 13.1-22.1 17.2-16.9 5.78 7.34 1.64 18.2-21.3 55.9-15.2 24.9-20.1 37.5-17.7 45.5 7.48 25 54 14.6 73.4-16.4 10.2-16.3 19-10.2 12.7 8.84-2.51 7.57-10 21.2-13 23.6-2.14 1.73-14.1 17.5-16.7 22-4.32 7.54-7.87 10.6-13.8 12-2.75 0.643-11.4 3.14-19.3 5.56-14.5 4.44-23.5 5.48-30.2 3.46zm-751-105c-5.32-6.41 5.31-33 18.4-46.1 6.93-6.9 12.1-10.6 30.1-21.7 25.9-15.9 29.1-17.6 64-33.8 98.7-48.1 215-71.7 315-119 14.9-7.63 30.4-12.9 44.6-22.1 15.7-10.3 21.5-7.75 25.5 11.1 4.11 19.7-8.19 32.8-39.7 42.4-83.5 35.4-154 52.1-239 84-6.73 2.54-16.4 5.77-21.5 7.18-53.5 16.4-101 42.1-148 69.1-11.2 5.48-42.2 36-49.6 28.9zm1550-46.3c-6.42-45-11.9-91.4-18.2-136-15.3-112-30.2-222-45.5-334-3.36-24.4-21.5-158-25.9-190-17.5-88.8-18.5-197-38.4-292 0 0 5.41-120-16.5-145-6.52-7.34-6.8-12.4-0.977-17.2 1.86-1.53 21.4-27.6 27.9-37.3 15.9-23.6 25.3-13.4 49.8 54.4 1.89 5.22 6.87 17.4 11.1 27.2 9.68 22.5 11 28 10.3 42.3-1.34 25.8-11.4 39-18.5 24.4-5.79-11.8-16.5-12.7-18.9-1.55-0.991 4.65-0.435 9.89 6.33 59.6 15.1 115 29.6 226 43.5 333 4.95 38.2 13.1 100 18 138 15.1 111 27.4 215 42.4 324 10.3 74.6 10.3 70.2 0.419 99.1-3.89 13.8-7.53 27-11.9 40.3 0 2.18-5.68 8.85-8.96 10.5-4.8 2.45-4.75 2.45-5.89 0.27zm-550-13.7c-2.22-0.68-8.95-3.56-15-6.3-10.1-4.56-20.6-8.81-40.5-16.3-4.12-1.56-10-3.79-13.1-4.97-15.2-5.76-14.1-9.05 15.5-49 14.2-19.2 13.9-18.9 20.7-15.5 21.2 7.95 40 13.9 61.3 21.5 25.2 10.7 23 8.86 32.5-10.4 10-20.4 26.7-32.7 32.8-32.7 4.7 0 49.2 14.9 59.8 20.1 6.36 3.08 13.3 5.56 19.2 6.82 17.7 3.79 22.8 10.2 17.2 21.4-20.3 39.9-35.8 53.6-52.9 46.3-39.2-16.7-70.1-26.9-74.2-29.2-10.1-5.51-12.2-7.03-20.5 18.1-10.7 32.6-12.7 39.3-42.8 30.1zm-1629-35.6c-2.82-2.22-3.85-6.14-5.63-21.5-6.43-22.4-48.5-134-85.4-116-14.3 7.57-16.9 2.76-11.5-20.9 6.72-29.4 16.7-39.5 33.9-34.4 18.6 5.51 30.4 15.7 43.2 37 14.9 20.8 27.5 42.4 39.1 64.8 9.17 17.6 12.7 17.2 24.6-3.06 9.47-16.1 21.9-34.9 35-52.8 6.43-8.8 15.7-21.5 20.5-28.2 21.9-30.3 47.4-48 63.9-44.3 14.2 3.18 22.6 11.7 22.6 22.8 0 3.24 0.511 8.43 1.14 11.5 1.02 5.06 0.901 6.32-1.1 11.9-8.18 22.9-27.5 37.8-25.5 19.6 1.5-13.1-16.9-23.4-31.1-17.5-13.1 5.46-37.5 36.4-68.8 87.1-6.66 10.8-26.1 47.4-32.6 61.5-10.5 22.7-15.4 27.5-22.4 22zm1316-66.9c0-20.3 21.1-47.9 48.3-63.1 56-34.3 123-69.4 172-95 70.7-33.3 128-73.1 196-105 7.58-3.51 15.7-7.57 18-9.02 16.6-10.4 24.8-9.38 24.8 3.22 0 17.3-13.7 31.4-35.5 36.5-68.8 32-126 66.3-187 97.4-70.4 40.9-154 69.8-214 125-10.9 10.5-23 15.6-23 9.59zm352-9c-18.4-9.61-37.9-16.2-51.7-20.2-26.2-7.51-29.4-8.76-28.6-11.3 3.02-10.1 36.1-61.6 39.5-61.6 0.51 0 3.5 1.29 6.65 2.86 4.29 6.15 85.7 18.3 83.9 34.5-13.4 14.7-20.9 38.9-31 51.3-5.42 9.68-10.5 7.63-18.8 4.38zm-718-184c-24.2-5.21-34.3-22-30.9-51.4 0.651-33.7 9.69-54.7 18.7-84.5 4.52-15.1 7.62-21.5 12.5-26 3.85-3.48 7.26-4.69 6.36-2.27-0.254 0.688-0.888 8.45-1.41 17.2-0.905 15.3-1.16 16.7-6.01 31.5-14.9 45.3-8.95 67.4 18.9 70.7 9.04 1.07 12.6-1.37 17.6-12.2 2.32-4.96 5.42-10.1 6.89-11.5l2.67-2.49 1.89 2.49c10.2 13.5 9.36 32.5-1.99 43-0.298 0.275-3.09 3.88-6.21 8-13.9 18.3-20.6 21.4-39 17.4zm345-22.1c-21.9-11.6-18-49 10.6-100 4.42-7.95 10.8-20.1 14.1-26.9 10.3-21.3 17.5-26.3 19.4-13.4 2.34 16.3-1.36 28.5-14.9 49.1-25.6 39-18.8 59 14.3 42.1 11.9-6.08 14.6-8.6 19.9-18.6 8.3-15.6 13-18 20-10.3 14 15.5 1.93 50.9-20.1 58.9-3.38 1.23-11.3 5.32-17.7 9.09-22 13.1-34.8 16-45.5 10.4zm-918-46.7c-3.35-0.767-11-3.46-16.9-6-5.94-2.54-16.4-6.2-23.3-8.14-30-8.44-31.4-10.7-21-31.4 5.52-10.9 9.5-17.4 23.6-38.1 6.31-9.3 10.4-10.2 22-5.04 18.3 6.87 36.9 14.4 54.7 20.7 10.7 3.72 12.2 4.52 13.5 7.31 2.02 4.21 3.07 4 8.16-1.66 4.65-5.18 5.6-6.52 17.1-24.2 15.5-23.7 19.4-27.1 28.6-24.7 24.5 9.43 51.9 22.4 71.2 30.1 20.5 7.82 26.9 14.4 21.2 22-0.482 0.639-1.7 3.41-2.7 6.16-8.31 22.8-24.8 43.9-24.8 43.9-8.6-2.01-32-3.49-53.1-14.1-55.4-27.8-58.8-47.5-69.8-6.76-10.1 37.2-22.2 36.1-48.4 30.1zm-465-13.2c-33.8-7.04-57-34.3-61.4-72.4-0.547-4.68-1.74-13.7-2.64-20-1.83-12.8-1.2-20.7 2.61-33 1.11-3.58 4.69-17.3 7.95-30.5 7.39-29.8 10.7-40 16.9-52.3 2.71-5.34 6.58-13.8 8.6-18.7 9.52-23.4 18.1-37 31.4-49.8 15.4-14.9 22.8-16.3 16.3-3.16-1.41 2.84-5.63 8.05-13.8 17-4.05 4.44-17.7 31.6-30.3 60.2-32.8 74.5-13.4 134 43.4 134 34.3-0.394 59.7-17.4 107-71.3 20-22.9 19.9-22.8 39.4-43.5 56.1-59.6 129-119 183-149 26.2-14.6 39.8-26 33.5-28-1.77-0.562-5.68-3.52-19.3-14.6-13.7-11.1-13.2-29.5 1.83-66.7 22.4-55.7 35.5-64.9 77.9-55.1 9.9 2.29 21.6 5 26 6.01 23.1 5.34 46.1 13.7 58 21.2 4.51 2.82 39.3 25.2 42.6 27.4 10.1 6.74 10.4 16.9 1.03 35.9-3.27 6.6-7.7 15.8-9.86 20.5-6.36 13.9-47.9 36.2-76.2 41-4.12 0.697-7.61 1.34-7.75 1.43-0.77 0.52 3.66 12.4 7.99 21.5 7.56 15.8 9.12 22.9 6.86 31-1.1 3.96-2.53 3.03-8.12-5.33-18.5-27.7-33.4-36-49.8-27.8-4.25 2.12-10.1 4.62-12.9 5.56-5.52 1.81-9.89 4.75-17.6 11.9-3.37 3.09-7.89 5.69-15 8.61-11.7 4.81-25.4 12.5-37.7 21.1-41.8 28.4-89.7 63.8-122 92.9-54 41.6-151 197-227 184zm438-384c3.3-1.41 16.4-6.68 29-11.7 30.2-12 29.8-13.9-5-25.9-26.3-9.04-67.8-16.9-73.2-13.9-7.36 4.02 3.53 26 22.2 44.8 11.1 11.2 14.5 12 27 6.65zm84 374c0.34-0.55 0.816-1 1.06-1s0.441 0.45 0.441 1-0.477 1-1.06 1-0.781-0.45-0.441-1zm1278-19.3c-0.811-15.2 0.341-24.2 4.83-37.9 11.3-34.4 9.84-109-3.47-183-2.65-14.6-5.11-30.3-5.48-35-34.6-218-108-525-137-752-15.9-84-6.38-107-13.6-153-3.22-9.08-1.47-17 3.75-17 0.581 0 1.35-2.21 1.71-4.9 1.82-13.8 26.4-43.5 30.6-37 18 20.5 28.6 40.8 34.4 59.9 9.71 29.2 18.8 55.4 30.4 83.6 14.5 35 15.3 69.1 2.07 82.3-4.98 4.98-5.71 4.66-4.75-2.12 2.21-15.5-0.01-26.6-8.36-41.8-21.6-39.4-42.1-39.4-31.7 0.0288 5.56 21 7.96 33.7 7.97 42.2 4.24 45 9.17 88.9 17.6 133 0.784 4.1 1.43 10.5 1.43 14.2 19.1 132 56.7 260 74.5 384 1.42 9.89 4.17 24.3 6.12 32 17.6 151 43.2 205 36.5 291-0.584 2.2-1.08 11.9-1.09 21.5 2.14 44.3-13.9 75.7-31.4 111-4.27 8.74-7.72 14.4-10.3 16.9l-3.93 3.8zm-539-92.2c-3.51-1.83-4.33-2.86-10-12.5-10.3-15-22.9-30.6-32.1-44.5-5.13-7.7-11.6-16.2-14.4-18.9l-5.05-4.92-28-1.74c-37.2-2.31-61.6-8.28-70.6-17.3-0.831-0.831-9.71-7.46-19.7-14.7-19.1-13.9-47.2-40.6-66.4-63.4-9.94-11.2-20.9-23-29.2-34-10.8-14.4-17.9-21.6-23.6-23.9-7.32-3.06-7.12-3.44-7.93 14.7-0.812 18.1-2.63 32-5.08 38.8-0.898 2.48-3.37 11.4-5.5 19.7-10.4 41.2-27.1 65.2-54.9 79.2-51.3 25.9-108 26.6-158 2.07-37.1-18.3-47.6-37.6-52.9-97-2.56-28.5-3.4-35.7-7.18-61.5-8.03-71-10.7-151-18.9-218-0.527-4.12-1.88-15.2-3-24.5-6.03-50.3-16.2-122-33.9-240-7.32-62.4-20.9-116-37.9-176-1.07-3.85-3.01-10.8-4.32-15.5-3.13-11.2-3.18-25.9-0.114-37.5 1.96-7.43 7.43-41.1 10.3-63.8 1.32-10.2 1.4-10.4 5.19-8.66 4.21 1.92 5.52 5.07 13.7 32.9 12.7 34.6 18.6 68.4 25.5 103 12.9 110 37.9 209 47 321l0.61 7.67 3.67-0.554c5.31-0.8 15.7-6.47 23.7-12.9 43.4-29.3 80.4-47.5 123-67.4 6.88-3.18 21.3-9.94 32-15 190-77.5 369-154 552-203 62.5-17.1 144-33.9 192-39.5 9.9-1.16 21-2.53 24.7-3.05 6.74-0.953 14.9-0.0848 18.8 2 7.42 3.97 3.85 29.5-6.24 44.6-45.8 68.4-70.4 92-124 119-12.6 6.37-26.8 14.1-31.5 17.1-45.5 34.7-102 69.9-140 105-17.6 16.6-33 29.8-34.8 29.8 34.1-42.3 91.2-93.8 133-123 5.71-3.8 14-10.2 18.3-14.2s21.3-17.3 37.6-29.5c97.1-72.6 121-95.1 98.7-92.6-18.7 2.15-31.8 3.81-36 4.57-173 29.9-363 91.9-501 149-7.6 3.22-14 5.86-14.2 5.86-97.5 42.2-204 86-287 131-31.9 17.5-34.5 24.6-13.9 38.1 19.2 12.7 61 44.4 82.3 62.3 37.5 32.1 79.4 67.7 107 98.6 20.5 23.4 30.5 34.5 44.1 48.5 47 42.3 102 148 177 153 1.19 0 0.57-4.69-1.89-14.4-8.9-35.1 5.63-79 44-133 22.8-32.2 66.9-46.6 125-41 46.1 4.39 61.4 7.38 144 28.1 29.4 7.38 57.6 14.1 62.5 14.9 67.4 11.1 117 13.7 158 8.16 39-5.24 43.8 3.03 19.4 33.1-14.2 17.4-19.7 20.8-37 22.4-147 15.5-223 66.9-335 114-22.3 9.34-36.6 14.5-54.8 19.8-12.8 3.71-14.6 9.02-7.63 22.5 9.68 18.8 9.75 42.4 0.201 61.5-2.69 5.36-4.54 10.5-4.62 12.7-0.155 4.27-1.36 4.72-6.04 2.27zm-415-130c30.2-5.28 69.2-24.1 78.7-37.9-5.16-78.1-54.3-115-98.5-170-40.5-50.5-71.6-83.6-98.4-105-7.39-5.77-18.1-14.2-23.7-18.7-34.9-20.7-10.5 77.6-10.3 110 0.702 42.9 8.82 84.1 11.5 121 3.1 42.2 8.53 63.4 18.5 72.4 4.08 3.69 7.51 5.48 28.5 14.9 31.2 14 63.4 18.5 93.7 13.2zm396-17.6c86.4-13.5 155-46.3 228-78.4 11.8-5.18 19.3-10.1 19.3-12.6 0-0.878-1.08-1.21-17.5-5.31-190-47.4-244-48.9-277-7.78-14.7 18.4-12.3 32.6 11.4 68.4 5.24 8.64 11.3 18.3 15.8 26.2 6.37 11.5 6 11.3 20.5 9.52zm1068 89.1c-12.8-7.83-17.9-32.9-11.4-56.6 1.06-3.85 3.07-11.7 4.46-17.4 6.61-27.1 29.1-70.7 40.5-78.6 3.68-2.55 14.6-5.82 15.4-4.59 1.21 1.97-9.13 22.8-18.9 38.1-14.1 22.1-19.6 36.8-19.8 53-0.409 40.9 26.4 31 65.9-24.5 7.29-10.2 12.1-11.3 14.3-3.23 1.84 6.84-0.215 12.2-12.3 32.2-19.5 32.2-26.8 40.8-43.9 51.4-20.6 12.8-27.2 14.8-34.5 10.4zm-2211-288c-21.6-11.5-20.3-40.3 4.32-101 13.5-33 41.1-78.5 50.1-82.4 14.2-6.25 10.6 11.7-7.86 39.6-6.82 10.3-14.9 25.4-20.6 38.5-1.79 4.12-4.54 10.3-6.11 13.8-7.79 17.1-9.22 28-4.83 36.7 8.42 16.8 26.1 9.32 48.2-20.5 12.4-16.7 15.4-18.5 19.6-11.6 5.61 9.08 0.224 21.4-17.9 41.1-6.38 6.93-10.4 12.4-13.1 17.7-10.1 20.1-38.2 35.2-51.9 27.9zm1284-68.1c-3.86-3.86-1.25-11.3 7.22-20.5 5.19-5.68 6.36-6.34 34.9-19.7 26.3-12.4 50.2-29.9 52.4-38.5 1.55-6.18-4.51-8.98-12.3-5.67-13.1 2.65-27.6 4.56-38.1 7.88-20.5 6.53-21.8 5.37-12.9-11.8 11.3-21.7 20.8-26.6 76.4-39.3 35.3-8.07 41-7.24 40.7 5.86-3.4 20.5-16.9 31.4-28.9 48.3-21.5 30.8-37.7 46.4-57.6 55.8-18.6 8.76-20.2 9.41-35.1 14.6-16.3 5.69-23.3 6.48-26.8 3zm-303-35.9c-26.1-11.8-14.2-85.3 23.1-143 5.92-9.19 16.5-15.9 25-15.9 4.04 0-5.48 19.7-18.1 37.5-10.2 14.3-12.8 19.1-14.9 27.5-0.908 3.5-2.58 8.2-3.72 10.4-5.82 11.4-1.42 37.8 6.65 40 11.5 3.09 28.6-9.42 46.9-34.4 18.2-24.7 19.1-25.5 23.3-20.7 4.8 5.59 2.69 12.9-10.2 35.3-18.4 31.9-27 42.2-42.9 50.8-3.85 2.1-9.22 5.39-11.9 7.3-10.4 7.3-16 8.58-23.2 5.29zm-724-177c-0.832-1.99-2.43-8.2-3.56-13.8-3.69-18.4-14.7-36.3-36.2-59.3-7.45-7.94-10.6-9.09-18.2-6.7-9.34 2.94-11.5-0.932-7.44-13.4 11.2-34.7 38.3-21.5 70 34.1 7.76 13.6 9.45 15.4 13.2 13.6 2.7-1.25 1.91-0.221 18.3-23.9 30.6-44.2 45.3-57.5 63.8-57.5h7.82l3.85 4.12c6.78 7.27 7.85 16.6 2.98 26-6.02 11.6-14.2 15.4-15.3 7.1-4.2-31.3-47.8 7.1-79.9 70.4-9.31 18.4-16.7 25.7-19.4 19.3zm1537-17c-4.74-12.5 0.737-23.8 17-35.2 14.7-10.3 27.5-21.5 34.7-30.6l3.12-3.89 11.3 5.36c28.2 14.1 75.5 4.13 95.7-1.59 26.9-7.66 34.1-14.3 28.5-26.1-8.92-18.9-34.4-13.5-70 14.7-9.39 7.44-16.4 11.2-16.4 8.79 0-9.19 54.5-47.2 75.3-52.6 25.4-6.51 47.1 14.7 36.9 36.1-24.3 51.2-88.6 83.9-157 79.5-21.2-1.36-20.8-1.19-21.5-7.77-0.939-8.15-8.19-6.48-19.5 4.52-12.5 12.1-16.5 14-18.5 8.66zm-1113-101c0-2.42 3.92-14.3 6.97-21.1 7.91-17.6 12.4-36.2 12.4-51.1 0.0163-15.7-1.85-21.4-14.5-44.2-6.24-11.3-10.8-21.3-14.6-31.7-1.87-5.15-0.618-10.4 4.9-20.5 11.3-20.7 15.4-22.6 21.3-9.64 1.8 3.94 6.32 12.3 10 18.6 26.7 45.1 22.6 97.8-11.7 148-5.01 7.38-14.9 15-14.9 11.4zm1011-4.21c-7.67-7.67 12.9-43.8 31.4-55.3 71.2-43.7 126-72.4 192-107 18.8-9.78 26.6-0.798 16.7 19.3-6.17 12.5-11.7 16.4-30.1 21.3-65.8 34.8-136 61.2-189 109-15.3 14.1-17.6 15.4-21 11.9zm-618-183c-4.36-4.36-2.19-11.1 10.3-31.9 16.4-27.4 40.3-47.8 79.6-67.9 9.16-4.68 21.2-11.3 26.7-14.7 31.6-23.2 82.7-39.2 121-68.8 25.3-18.6 49.9-32.3 76.5-50.3 55.7-37.7 54.7-37.2 55.5-28.2 2.15 23.5-5.86 39.1-23.5 45.7-30.7 15.1-66.1 36.7-95.5 59.4-1.33 1.04-5.53 3.16-9.33 4.7-3.8 1.55-11.7 5.99-17.4 9.87-40.1 35.4-176 66.8-189 118-0.723 4.09-3.13 6.87-14.4 16.7-11.2 9.71-15.7 11.3-20 7zm-475-89.6c-15.5-8.38-9.85-57.7 12.8-112 7.35-17.8 16.4-32.8 27.7-46 3.54-4.12 8.51-10.7 11-14.7 5.27-8.23 8.47-10.8 12.2-9.88 15.6 26.4-79.2 121-49 136 11.6-2 17-16.4 25.3-26.3 8.87-10.5 10.7-13.1 15.6-22.3 9.32-17.4 16.7-1.85 9.98 20.9-16.8 24.4-32.2 41.5-42.8 59.8-7.74 13.3-15.7 18.5-22.8 14.6zm302-37.4c-8.16-1.9-10.6-12.6-7.85-34.5 1.97-19.4 5.45-42.6 9.6-56 12-38.7 7.4-54-12.4-41.3-17.7 11.4-22.9-3.56-7.37-21.5 3.42-3.97 8.84-10.5 12-14.5 30.9-38.7 63-31.5 52.3 11.8-2.04 8.9-1.29 19.7-6.06 26.5-5.24 21.4-12.9 46.5-13.8 68.3l-0.321 9.25 3.08-5.1e-4c7.33-1e-3 21.2-13.5 36.6-35.6 57.4-82.2 94.5-104 119-70.5 5.48 7.47 5.59 10.8 0.678 20.6-11.7 23.2-35.1 38.7-35.1 23.3-0.015-21.2-28.3-17-43.1 6.38-20.2 23.8-37.8 55.4-57.9 75.7-29.6 29.3-38.2 34.8-49.8 32.1z" />
              </svg>
            </div>
            <div className='title_of_chapter'>
              <p> Шариат Аҳдининг нозил  </p>
              <p>  бўлиши </p>
            </div>
          </div>

          <div className='decor_line'>
            {/* <p> &#8213;&#8213;  &#10044; &#8213;  &#10044;  &#8213;  &#10044;  &#8213;&#8213;   </p> */}
          </div>

          <div className='main_text'>
            <p className="boldItalic">
              «Албатта, Оллоҳ адолатга, эҳ­сонга, қариндошларга ях­ши­лик қилишга амр этадир ва фаҳшу мункар ҳамда зулм­кор­ликдан қайтарадир. У сиз­лар­га ваъз қилур. Шоядки, эс­ла­сан­гиз. Агар аҳд­лаш­сан­гиз Оллоҳ­нинг аҳдига вафо қи­линг. Қа­сам­ларни таъкид қи­­лин­­ганидан сўнг бузманг. Ба­таҳ­қиқ, Оллоҳ­ни ўзингизга ка­­фил қилгансиз-а! Албатта, Оллоҳ нима қилаётганингизни би­лур» (Наҳл сураси 90-91).
            </p>
          </div>

          <div className='paragraph_heading'>
            <p> Иброҳимнинг аҳдига даъват </p>
          </div>

          <div className='main_text'>
            <p>
              Мисрдан чиққанларига икки ой тўлгач    Бани Исроил Оллоҳ таолонинг раҳнамолиги остида Сино чўлига, Туво дарасидаги тоққа келиб тоғ этагида қароргоҳ қурди.
            </p>
            <p></p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'
              style={{ display: visibleBubbles[1] ? 'block' : 'none' }}
              onClick={() => handleSupClick(1)}
            >
              <p >
                <sup>1</sup> Моида сурасининг 20-оятида Мусо (а.с.) нинг ўз қавмига: «Эй қавмим, Оллоҳнинг сиз­га берган неъматлари­ни эсланг. Ахир, У сизларни пайғамбарлар этди, под­шоҳ­лар қилди, оламларда бирор­та­га бермаган нарса­лар­ни берди!» деб айтган сўзлари ёзилган.
              </p>
            </div>
            <p onClick={() => handleSupClick(1)}>
              Мусо (а.с.) Оллоҳдан ҳидоят олиш учун тоққа чиқдилар. Шунда у кишига: «Мана, Мен сизларни Мисрдан, қуллик уйидан соғ-саломат олиб чиқдим. Энди сизлар Меникисиз, — деган садо келди. — Агар гапларимга қулоқ солсангиз, Ибро­ҳим билан қилган аҳдимга содиқ бўлсанг­из, бутун халқлар ичида Менинг бебаҳо хази­нам бўласизлар. Ҳа, бутун ер юзи Меники. Лекин сизлар Менинг муқаддас салтанатим бўласиз, ҳамма халқларга илм ва ҳидоят улашасиз.<sup>1</sup>  Бор, Мен айтган гапларни одамларга етказ».
            </p>
            <p className="vitalic">
              Оллоҳ таоло Иброҳим (а.с.) билан аҳд тузган вақтда: «Авлод­ларинг тўрт юз йил бегона юртда келгинди бўлиб умр суради, кейин Мен уларни у юрт­дан олиб чиқаман», деб ваъда берган эди. Мана энди, орадан неча асрлар ўтиб, бу ваъда амалга ошди. Бани Исроил Аҳд ворис­ла­рига айланиб, Китоб Аҳли бўлиб, дунёдаги ҳамма халқ­лар­ни Оллоҳ­нинг нурига ҳи­доят қи­лиши керак эди.
            </p>
            <p>
              Кейин Мусо алайҳис-салом тоғдан тушиб, оқсоқолларни чақиртирдилар ва Оллоҳнинг даъватини баён этдилар. Ҳаммалари бир оғиздан, Оллоҳнинг ҳар бир айтганини қиламиз, деб ваъда берди.
            </p>
            <p className='vitalic'>
              Яъни, шу тариқа Бани Исроил Оллоҳ субҳанаҳу ва таолонинг Иброҳим (а.с.) билан тузган дўстлик аҳдига иймон келтирамиз, деб ваъда беради.
            </p>
          </div>

          <div className='paragraph_heading'>
            <p> «Учрашувга тайёрланинглар»  </p>
          </div>

          <div className='main_text'>
            <p>
              Кейин Оллоҳ Мусо (а.с.) га: «Халқ бугун-эрта ўзларини покласин, кийимларини ювиб, учинчи кунга тайёрлансин. Мен учинчи кун ҳамманинг кўз олдида, Сино тоғида, мўъжизаларимни намойиш қиламан, — деди. — Тоғнинг атрофини чегарала. Ҳаммага тайинла: биронта инсон тоққа яқинлашмасин. Кимки тоққа қадам қўйса, тошбўрон қилиб ё ўқ отиб ўлдиринглар. Унга инсон қўли тегмасин. Хоҳ ҳайвон бўлсин, хоҳ инсон, яшашига изн берманглар. Фақат бурғу садоси давомдор янграгандан сўнг одамлар тоққа чиқади», деди.
            </p>
            <p>
              Расулуллоҳ тоғдан тушиб халққа: «Кийимларингизни ювинг, тозаланинг. Ҳеч ким хотинига яқинлашмасин. Учинчи кунга тайёрланинг!» дедилар.
            </p>
            <p>
              Учинчи кун эрталаб тоғда чақмоқ чақиб, момақалдироқ янгради. Тоғнинг устида қуюқ булут турар, ҳамма ёқдан ҳаддан ташқари кучли карнай овози эшитилаётган эди. Қароргоҳдаги одамларнинг ҳаммаси қўрқувдан титради.
            </p>
            <p>
              Мусо (а.с.) халқни қароргоҳдан олиб чиқиб, Оллоҳ билан учраштириш учун тоғ этагига олиб келдилар. Шунда тоғ қаттиқ ларзага келди. Оллоҳ таоло тоғни олов билан қоплаган, тоғдан қуюқ тутун чиқиб осмонга ўрлар, карнай товушлари эса борган сари кучаяётган эди.
            </p>
          </div>

          <div className='paragraph_heading'>
            <p> ОллоҳНИНГ ЛИҚОСИ  </p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'
              style={{ display: visibleBubbles[2] ? 'block' : 'none' }}
              onClick={() => handleSupClick(2)}
            >
              <p >
                <sup>2</sup>  Анъом сураси, 154-оят. Оятнинг тўлиқ кўриниши қуйидагича: «Яхшилик қил­ган­га (неъмат) батамом бў­ли­ши учун, ҳар бир нарса ба­таф­сил бўлиши учун, ҳидоят ва раҳмат бўлиши учун Биз Мусога Китоб ато этдик, токи (Бани Исроил) Раббилари би­лан учрашмоқ­қа иймон кел­тир­салар».
              </p>
              <p className='MarginTop10px'>
                <sup>3</sup>    Оллоҳ таолонинг сўзларини халқ пастда эшитиб турган эди. Шу тариқа улар Мусо пайғамбарнинг Оллоҳ тарафидан қўйилган раҳбар эканлигига яна бир карра амин бўлдилар.
              </p>
            </div>
            <p onClick={() => handleSupClick(2)} className='boldItalic'>
              «Биз Мусога Китоб ато этдик, токи (Бани Исроил) Раббилари билан учрашмоққа иймон келтирсалар».<sup>2</sup>
            </p>
            <p>

            </p>
          </div>

          <div className='main_text'>
            <p>
              Шунда Оллоҳ (а.ж.) Мусо (а.с.) га Бани Исроил учун<sup>3</sup>  мана бу сўзларни айтади:
            </p>
            <p>
              «Мен ал-Қайюмман, сизларни Мисрдан, қуллик уйидан олиб чиққан Парвардигорингизман. Мендан бошқа худоларга сиғинманг. На осмондаги, на ердаги ва на сувлардаги ҳеч бир нарсага қараб ўзларингиз учун бут ясаманг. Уларга сажда ё ибодат қилманг. Чунки Мен рашк Худосиман, Мени ёмон кўрганларнинг гуноҳи — учинчи ё тўртинчи авлодгача фарзандларингизга асар этади, лекин Мени севганлардан, амрларимга итоат этганлардан ҳеч қачон меҳримни аямайман.
            </p>
            <p></p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'
              style={{ display: visibleBubbles[4] ? 'block' : 'none' }}
              onClick={() => handleSupClick(4)}
            >
              <p >
                <sup>4</sup> “Менинг исмимни бежо тилга олманг”. Асл матнни сўзма-сўз таржима қилсак: “Менинг исмимни бекорга ёки ёлғондан кўтарма”, деган маънони беради. Оллоҳ таоло муқаддас бўлгани учун Унинг исми ҳам муқаддас. Шу сабабдан биз Унинг исмини ҳамиша ҳурмат билан тилга олишимиз лозим. “Енгил” (пуч) гаплар учун ёки ёлғон гаплар учун Оллоҳнинг исмини ишлатманг. Ундан ўз манфаатингиз йўлида фойдаланманг. Ҳатто «Худога шукур!» ни ҳам шукур қилмай айтсангиз, гуноҳкор бўласиз.
              </p>
            </div>
            <p onClick={() => handleSupClick(4)}>
              Менинг исмимни бежо тилга олманг.<sup>4</sup> Мен сизларнинг Раббингизман. Исмимни бежо ишлатган одам жазосиз қолмайди.
            </p>
            <p>
              Дам олиш кунининг қудсиятини сақланг.
            </p>
            <p>
              Ота-онангни ҳурмат қил, токи Мен сенга берадиган юртда умринг узоқ бўлсин.
            </p>
            <p>
              Қотиллик қилма.
            </p>
            <p>
              Никоҳга хиёнат қилма.
            </p>
            <p>
              Бировнинг мол-мулкига ноҳақ қўл узатма.
            </p>
            <p>
              Ёлғон шаҳодат берма.
            </p>
            <p>
              Бошқаларнинг уйига, хотинига, қулу чўрисига, ҳўкизи ва эшагига, хуллас ҳеч бир нарсасига кўз тикма».
            </p>
          </div>

          <div className='paragraph_heading'>
            <p> БАНИ ИСРОИЛ ОллоҳГА МУҚАРРАБ БЎЛИШНИ ИСТАМАДИ </p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'
              style={{ display: visibleBubbles[5] ? 'block' : 'none' }}
              onClick={() => handleSupClick(5)}
            >
              <p >
                <sup>5</sup>  Қуръони карим ояти: «Биз уларга (дин) иши ҳақида очиқ-ойдин баёнот бердик. Бас, улар ўз­ла­рига илм келганидан сўнг ўзаро ҳасад-адоват қилиб ихтилофга тушдилар. Албат­та, Раббинг улар ора­си­да қиёмат куни ихтилоф қил­ган нарсалари ҳақида ҳукм чиқарур» (45:17).
              </p>
            </div>
            <p onClick={() => handleSupClick(5)}>
              Халқ қаттиқ қўрқиб кетган эди. Момақалдироқ ва карнай овози, улкан чақмоқлар нури уларни ваҳимага солган эди. Расулуллоҳга: «Бизга ўзингиз гапиринг, нимаики десангиз қулоқ соламиз, фақат Худо гапирмасин, бўлмаса ўламиз», деб ялиндилар, чунки тоққа чиқишни, Оллоҳ билан робитага киришни хоҳламас эдилар.<sup>5</sup>
            </p>
            <p>
              «Қўрқманглар, — деди Мусо пайғамбар. — Нега қўрқасизлар? Бу бир синов, холос. Оллоҳ сизларни гуноҳдан қайтариш учун сизларга бу мўъжизаларни зоҳир қилди». Лекин одамлар яқинлашишни истамай, олисдан қараб турган эдилар.
            </p>
            <p>
              Кейин Худо Мусо (а.с.) ни тоққа чақириб: «Бор, одамларга айт, энди тоққа оёқ босмасинлар, — деди. — Ким кўраман деб чегарадан ўтса, ҳалок бўлади.    Энди Мен орангиздан руҳонийлар тайин қиламан. Лекин улар ҳам Менга яқинлашишдан олдин ўзларини поклаши лозим.   Бор, пастга тушиб, Ҳорунни олиб чиқ», деди.
            </p>
            <p className="vitalic">
              Шу билан Бани Исроил Оллоҳ таоло билан учрашишни, У билан робитада яшашни истамади. Шу сабабдан Худо уларга яна бир аҳдни, шариат аҳдини қонун-қоидалари билан бирга ато этди.
            </p>
            <p></p>
          </div>

          <article className='nav_arrows'>
            <div className='flex_it space_between'>
              <div style={{ marginLeft: '0px' }}
                onClick={() => navigate(-1)}>
                <div>
                  <span className='left_arrow_span'>&#8592;</span>
                </div>
                <div className='indicator'>
                  <span className=' bottom_arrows_for_qisas' > орқага қайтиш </span>
                </div>
              </div>

              <div className='central_div'>
                <div>
                  <p>Шариат Аҳди </p>
                </div>
              </div>

              <div style={{ marginRight: '0px' }} onClick={() => navigate('/qisas-uzbek/examples-of-shariah')}>
                <div className='indicator'>
                  <span className=' bottom_arrows_for_qisas' >  Шариат аҳкоми </span>
                </div>
                <div>
                  <span className='right_arrow_span' >&#8594;</span>
                </div>
              </div>
            </div>
          </article>
         
        </main>
        <aside></aside>
      </div>
    </div >
  )
}

export default ShariahRevealed
