import React, { useState, useEffect } from 'react';
import { useNavigate } from 'react-router-dom';
import './stories.css'
import kamar from '../../images/kamar.png'


const Adam = () => {

  const navigate = useNavigate();


  const [windowWidth, setWindowWidth] = useState(window.innerWidth);
  const [visibleBubbles, setVisibleBubbles] = useState({});

  useEffect(() => {
    const handleResize = () => {
      setWindowWidth(window.innerWidth);
    };

    window.addEventListener('resize', handleResize);

    const initialVisibility = {};
    const numberOfCases = 10;

    for (let i = 1; i <= numberOfCases; i++) {
      initialVisibility[i] = window.innerWidth > 970;
      //     console.log(initialVisibility[i])
    }
    setVisibleBubbles(initialVisibility);

    return () => window.removeEventListener('resize', handleResize);
  }, []);

  const handleSupClick = (index) => {
    setVisibleBubbles(prevState => ({
      ...prevState,
      [index]: !prevState[index]
    }));
  };


  return (

    <div className="minister-home stories">
      <div className="separate_into_two_columns">
        <main className="sep_part1">

          <div className='chapter_heading'>

            <div className="kamar">
              <img src={kamar} alt="" />
            </div>
            <div className="img_container" style={{ padding: '11px' }}>

              <svg
                fill='rgb(175, 157, 0)'
                version="1.1" viewBox="0 0 118 128" xmlns="http://www.w3.org/2000/svg">
                <path d="m79.9 127c-0.505-0.944-0.211-3.57 0.652-5.82 0.852-2.22 1.14-2.26 0.481-0.0721-0.258 0.856-0.468 2.25-0.468 3.11 0 1.32 0.0917 1.55 0.622 1.55 0.342 0 0.859-0.324 1.15-0.72l0.528-0.72-0.23 0.8c-0.704 2.45-1.96 3.31-2.73 1.87zm-25.7-0.594c-0.572-2.07-1.65-5.09-2.04-5.7-0.34-0.531-0.653-0.678-1.12-0.53-0.439 0.139-0.899-0.0287-1.42-0.52-0.933-0.876-0.948-1.12-0.151-2.43 0.464-0.761 0.784-0.972 1.28-0.843 1.27 0.332 2.59 2.09 3.29 4.41l0.686 2.25 0.699-2.99c0.677-2.89 1.36-4.28 2.46-4.98 0.747-0.471 2.16 0.89 2.16 2.08 0 1.2-0.541 1.45-1.4 0.637-0.394-0.37-0.812-0.674-0.928-0.674-0.453 0-1.15 1.9-1.8 4.92-0.716 3.31-1.47 5.23-1.71 4.36zm-21.9-2.69c-0.827-0.712-0.896-0.947-0.873-2.96 0.0241-2.13 0.729-4.82 2.11-8.07 0.854-2.01 0.961-1.51 0.237 1.09-0.931 3.35-1.27 5.83-0.924 6.74 0.484 1.27 1.25 1.33 2.28 0.182 0.762-0.852 0.91-0.918 0.91-0.4 0 1.03-1.2 3.48-1.88 3.85-0.849 0.454-0.832 0.458-1.86-0.431zm37.2-8.5c-4.15-1.62-6.5-5.18-7.28-11-0.549-4.12 0.0427-8.39 2.16-15.6 0.144-0.491-0.0853-0.561-1.87-0.567-4.28-0.0148-6.99-2.58-7-6.64-3e-3 -1.99-0.785-1.63-4.25 1.94-2.1 2.16-3.84 3.65-4.87 4.16-6.67 3.32-12.3 2.02-13.8-3.19-0.534-1.84-0.506-5.3 0.0654-8.07l0.225-1.09-1.73 0.21c-8.3 1.01-14.7 1.03-18.8 0.0591-10.9-2.64-15.1-13.3-9.96-25.6 0.995-2.39 2-3.95 2.33-3.63 0.0981 0.0977-0.402 1.83-1.11 3.84-1.47 4.16-1.91 7.78-1.26 10.2 0.514 1.93 3.58 4.95 6.42 6.34 7.49 3.66 20.4 3.44 36.3-0.624 11.5-2.92 26.7-8.92 26.7-10.5 0-0.886-1.47-2.5-3-3.29-1.1-0.567-2.14-0.719-6.18-0.906-5.56-0.257-6.47-0.593-7.75-2.88-1.07-1.9-0.861-5.7 0.454-8.46 1.18-2.49 4.07-5.43 5.6-5.7 4.56-0.824 10.5 4.91 12.3 11.8 1.17 4.59 0.934 9.59-0.6 12.6-2.18 4.3-7.42 7.29-20.1 11.5-6.91 2.28-13.8 4.14-17.3 4.69l-1.24 0.195 0.164 2.04c0.299 3.72 1.95 5.27 5.63 5.27 4.91 0 8.24-1.6 13.3-6.38 2.05-1.95 3.95-3.54 4.22-3.54 0.426 0 0.469 0.362 0.299 2.48-0.182 2.26-0.133 2.58 0.553 3.57 1.06 1.54 2.89 2.39 5.45 2.54 4.19 0.237 6.58-1.2 9.45-5.67 3.49-5.44 4.09-5.5 3.13-0.336-0.395 2.12 2.09 4.14 5.09 4.14 0.895 0 1.68-0.215 2.14-0.587l0.724-0.587-0.684-0.933c-0.663-0.905-0.669-0.99-0.18-2.84 0.573-2.18 1.28-3.69 1.73-3.69 0.562 0 1.35 2.01 1.52 3.88 0.318 3.5-0.999 7.71-3.01 9.62-1.84 1.75-4.91 2.37-6.81 1.39-0.502-0.259-1.56-1.21-2.35-2.11l-1.43-1.64-0.598 0.87c-1.39 2.02-3.43 3.96-4.93 4.67-1.8 0.855-1.78 0.807-2.9 6.2-1.33 6.38-0.465 10.7 2.65 13.4 2.51 2.15 7.19 2.81 11.5 1.62 6.01-1.67 15-7.72 21.4-14.4 3.06-3.2 3.75-4.5 3.39-6.33l-0.187-0.934-1.96 0.251c-2.9 0.372-6.64 0.216-8.62-0.359-4.02-1.17-5.09-5.11-2.8-10.3 1.26-2.85 4.57-5.55 6.83-5.57 2.39-0.0188 5.16 2.36 7.59 6.5 0.791 1.35 1.55 2.45 1.69 2.45 0.439 0 2.9-1.34 3.99-2.16 0.69-0.525 1.04-1.06 1.04-1.6 0-0.444-1.01-2.56-2.25-4.71-1.24-2.15-2.69-4.97-3.23-6.27-0.542-1.3-1.32-2.73-1.73-3.17-0.709-0.76-0.731-0.92-0.448-3.2 0.444-3.57 0.624-4.23 1.12-4.04 0.237 0.0909 1.88 1.43 3.65 2.98 3.69 3.23 4.12 4.15 1.78 3.83-0.792-0.109-1.44-0.105-1.44 0.0084 0 0.113 0.64 1.3 1.42 2.63 2.43 4.15 3.15 6 3.31 8.57 0.366 5.71-1.97 10.9-5.85 12.9-1.22 0.647-1.45 0.917-1.45 1.73-8e-3 2.13-1.62 6.6-3.32 9.22-3.41 5.24-13.4 13.9-19.9 17.1-4.63 2.32-9.74 2.98-13.1 1.68zm29.5-34.8c0.631-0.4-2.17-2.84-3.56-3.1-2.79-0.524-4.75 1.86-2.38 2.89 1.13 0.489 5.26 0.632 5.93 0.205zm-32.6-35.8c0-0.662-1.81-2.4-3.25-3.12-2.02-1-3.24-1.06-4.13-0.173-1.55 1.55 0.135 2.86 4.08 3.18 1.55 0.124 2.93 0.247 3.06 0.273 0.132 0.0259 0.24-0.0473 0.24-0.163zm32.2 67.9c-1.54-0.981-2.8-1.94-2.8-2.13 0-0.344 3.17-5.35 3.39-5.35 0.0609 0 1.43 0.867 3.05 1.93s2.98 1.89 3.03 1.84c0.05-0.05 0.824-1.21 1.72-2.59l1.63-2.5 1.83 1.04c1.01 0.571 2.37 1.37 3.03 1.78l1.19 0.742-1.62 2.48c-0.888 1.36-1.74 2.61-1.89 2.76-0.161 0.164-0.726 0.0127-1.34-0.358-0.583-0.353-1.91-1.16-2.95-1.8l-1.89-1.15-1.56 2.47c-0.858 1.36-1.66 2.5-1.79 2.54-0.128 0.0397-1.49-0.73-3.03-1.71zm-88.2-1.62c0-0.475-0.174-2.07-0.388-3.54-0.459-3.18-0.134-4.1 1.67-4.73 0.954-0.333 1.03-0.427 0.518-0.638-0.345-0.141-0.857-0.0875-1.2 0.126-0.733 0.458-0.754 0.264-0.0808-0.763 0.668-1.02 1.43-0.998 2.49 0.0695 1.2 1.2 1.01 2.16-0.451 2.27-1.75 0.135-2.48 0.354-2.65 0.803-0.0875 0.228 0.033 1.49 0.268 2.8 0.519 2.9 0.568 4.47 0.141 4.47-0.176 0-0.32-0.389-0.32-0.863zm34.7-2.76c-0.757-0.554-0.368-1.3 0.552-1.06 0.859 0.643 0.93 0.62 1.29-0.364 0.368 0.0316 0.937 0.264 1.16 0.52-3e-3 0.113-0.136 0.412-0.296 0.665-0.243 0.385-0.377 0.393-0.805 0.0325-0.661-0.556-0.576-0.343-0.908 0.112-0.341 0.466-0.475 0.479-0.999 0.096zm-7.87-1.12c0-0.141 0.72-0.561 1.6-0.932s1.6-0.551 1.6-0.398c0 0.153-0.666 0.572-1.48 0.932-1.67 0.741-1.72 0.751-1.72 0.398zm-22.7-1.75c3.07-1.77 3.26-1.96 3-3.13-0.307-1.4-2.61-3.65-3.79-3.71-1.18-0.0622-1.47-0.379-1.71-1.87l-0.198-1.22 1.37 0.768c1.82 1.02 4.07 3.56 4.54 5.13 0.629 2.1 0.954 0.759 0.727-3-0.114-1.89-0.0836-3.44 0.0677-3.44 0.151 9e-5 0.521 1.76 0.821 3.91 0.591 4.23 1.15 5.46 2.56 5.63 0.507 0.0612 1.49 0.0164 1.81-0.748 0.589-1.41 1.23-0.839 0.648 0.24-0.34 0.635-0.297 0.657 0.88 0.47 0.767-0.122 1.52-0.519 1.97-1.04 0.213-1.3 0.827-1.21 0.536-0.0543-0.156 0.621-0.0581 0.828 0.453 0.962 0.723 0.189 1.11-0.165 1.49-1.36-0.102-0.956 0.731-0.904 0.452 0 0.151 0.615 0.434 0.823 1.22 0.9 1.16 0.113 1.2-4e-3 0.725-2.4-1.16-5.9-1.3-6.87-1.04-7.33 0.228-0.408 0.355-0.321 0.682 0.469 0.221 0.533 0.319 1.1 0.218 1.27s0.0357 1.43 0.304 2.82c0.65 3.36 0.655 5.5 0.0155 6.14-0.458 0.458-0.601 0.459-1.55 4e-3 -1.01-0.482-1.07-0.472-1.62 0.259-0.522 0.693-0.646 0.722-1.4 0.329-0.642-0.336-1.08-0.353-1.98-0.0744-0.639 0.196-2.02 0.353-3.07 0.349-1.81-7e-3 -1.94-0.0642-2.64-1.09-0.404-0.598-0.745-1.53-0.758-2.08l-0.0225-0.993-0.463 1.27c-0.653 1.78-1.61 2.67-3.45 3.22-2.5 0.741-2.76 0.557-0.803-0.57zm27.1-0.245c-0.453-0.357-0.918-0.943-1.03-1.3-0.191-0.6-0.254-0.613-0.764-0.152-0.675 0.611-2.91 0.686-2.91 0.0977 0-0.675 1.55-2.74 2.22-2.95 0.409-0.13 0.664-0.552 0.74-1.22 0.137-1.22 0.346-0.789 0.879 1.81 0.617 3.01 2.13 3.84 4.41 2.45 0.98-0.597 1.1-0.606 1.84-0.124 1.81 1.18 2.11-0.0367 1.27-5.14-0.273-1.66-0.351-2.99-0.187-3.15 0.315-0.315 0.462 0.287 1 4.1 0.41 2.9 0.824 4.2 1.41 4.43 0.274 0.105 0.354-0.0885 0.255-0.611-0.522-2.73 2.12-4.68 4.13-3.05l0.753 0.609-1.44-0.162c-1.14-0.128-1.61-0.0251-2.24 0.491-0.757 0.622-0.772 0.698-0.306 1.55 0.623 1.14 1.63 1.29 3.06 0.443 1.39-0.818 1.52-0.825 1.1-0.0526-0.453 0.846-2.18 1.85-3.64 2.12-0.986 0.183-1.41 0.0928-2.15-0.459l-0.928-0.686-0.646 0.646c-0.775 0.775-0.939 0.789-1.84 0.154-0.64-0.448-0.813-0.435-1.98 0.16-1.59 0.813-1.97 0.813-3 3e-3zm-1.5-3.03c0-0.939-0.0571-0.952-1.3-0.312-1.26 0.654-1.19 1.11 0.176 1.11 0.981 0 1.12-0.0991 1.12-0.8zm-4.93 0.633c-0.121-1.05-0.443-3.04-0.714-4.43-0.313-1.59-0.382-2.63-0.189-2.82s0.492 0.73 0.815 2.52c0.833 4.6 0.882 5.1 0.589 5.89-0.233 0.629-0.317 0.433-0.501-1.16zm33.7-1.58c0-0.0795 0.612-0.566 1.36-1.08s2.51-2.11 3.91-3.54c3.16-3.23 4.55-3.97 6.95-3.69 1.67 0.196 1.78 0.161 2.58-0.792 0.949-1.13 1.27-1.25 1.13-0.437-0.062 0.369 0.143 0.594 0.603 0.659 0.551 0.0785 0.718-0.0835 0.8-0.775 0.0567-0.481 0.304-0.941 0.549-1.02 0.354-0.116 0.412 0.161 0.279 1.34-0.223 1.97-0.696 2.51-2.01 2.26-0.664-0.125-1.39-0.0116-2.02 0.314-0.6 0.31-1.79 0.508-3.04 0.508-1.93 0-2.18 0.0861-3.94 1.4-1.03 0.769-2.38 1.93-3 2.59-1.37 1.45-4.16 2.98-4.16 2.27zm-43.7-1.67c-0.113-0.293-0.0744-1.01 0.107-1.19 0.227-0.227 0.342 0.12 0.349 0.384 0.0367 1.39 0.976 0.81 0.985-0.176 0.0032-0.335 0.0902-0.399 0.187-0.16 0.658 1.46 1.38 0.421 1.07-0.304-0.202-0.47 0.0961-0.608 0.352-0.352 0.622 0.92-0.446 2.22-1.22 1.76-0.627 0.712-1.58 0.671-1.82 0.045zm19.4-0.232c0.814-0.618 0.693-0.835-0.469-0.835-0.946 0-0.987-0.0414-0.513-0.516 0.444-0.444 0.685-0.46 1.73-0.115l1.21 0.4-0.878 0.755c-0.483 0.415-1.05 0.751-1.26 0.745-0.212-6e-3 -0.133-0.199 0.178-0.435zm-36.1-0.699c0.755-0.513 1.27-0.886 1.26-0.972-0.0159-0.0832-0.35-0.221-0.419-0.304-0.554-0.667-0.106-2.06 0.663-2.06 0.487 0 0.8 0.236 0.634 0.934-0.141 0.593-0.279 1.04-0.279 1.04 0.0362 0.181 0.276 0.308 0.49 0.446 0.147 0.382 0.0764 0.505-0.23 0.403-0.0878-0.0293-0.52-0.351-0.52-0.351-0.176 0.0702-0.632 0.687-1.02 0.947-0.602 0.409-1.25 0.743-1.44 0.743-0.192 0 0.196-0.371 0.864-0.824zm1.82-2.22c0-0.264-0.128-0.652-0.293-0.652-0.404 0-0.616 0.609-0.445 0.927 0.206 0.382 0.561 0.451 0.561 0.451 0.0786-0.0426 0.177-0.536 0.177-0.726zm102 2.1c-0.453-0.847-0.415-2.12 0.125-4.2 0.995-3.82 2.64-7.23 3.21-6.66 0.111 0.11-0.0336 0.786-0.32 1.5l-0.521 1.3 1.14 1.14c1.34 1.34 1.62 2.23 1.36 4.27-0.263 1.99-1.58 3.26-3.4 3.26-0.922 0-1.35-0.167-1.59-0.619zm3.06-2.14c1.47-0.697 1.4-1.51-0.216-2.58-1.48-0.979-1.72-0.837-2.07 1.24-0.329 1.95 0.267 2.3 2.28 1.34zm-92.4 0.51c0-0.175 1.24-0.893 2.76-1.6 3.04-1.4 3-1.39 3-1.02 0 0.143-0.54 0.523-1.2 0.843-3.02 1.46-4.56 2.06-4.56 1.77zm27.5 0.0747c0-0.389 3.86-2.72 4.1-2.47 0.257 0.257-0.198 0.611-2.26 1.76-1.01 0.564-1.84 0.885-1.84 0.713zm-34.2-2.44c0.546-0.526 4.24-2.12 4.45-1.92 0.266 0.264-0.474 0.717-2.51 1.54-2.37 0.954-2.57 0.994-1.93 0.376zm29.4 0.159c0-0.161 0.972-0.845 2.16-1.52 2.69-1.53 2.64-1.51 2.64-1.12 0 0.264-4.25 2.93-4.67 2.93-0.0725 0-0.132-0.132-0.132-0.292zm-12.2-0.569c-0.649-0.169-0.434-0.739 0.278-0.739 0.262 0 0.806-0.383 1.21-0.851 0.779-0.906 1.48-0.806 1.48 0.212 0 1.1-1.45 1.77-2.96 1.38zm2.47-1.04c0.321-0.519-0.376-0.676-0.789-0.179-0.322 0.387-0.302 0.476 0.105 0.476 0.275 0 0.583-0.134 0.684-0.298zm-33.3-6.26c-0.624-0.952-0.427-2.87 0.57-5.53 0.808-2.16 1.11-1.97 0.441 0.276-0.95 3.2-0.399 5.01 1.11 3.64 0.85-0.769 0.845-0.0289-8e-3 1.37-0.76 1.25-1.41 1.32-2.11 0.241zm76.9-23.6c-0.848-0.62-1.18-2.58-0.823-4.82 0.303-1.88 1.86-6.31 2.55-7.27 0.386-0.534 0.389-0.551-0.681 3.49-0.626 2.36-0.802 4.64-0.433 5.6 0.329 0.859 1.61 0.588 2.53-0.534l0.853-1.04-0.206 0.96c-0.113 0.528-0.522 1.61-0.909 2.4-0.764 1.56-1.8 2-2.88 1.2zm6.82-7.76c0-0.0829 0.612-0.462 1.36-0.842 4.54-2.31 16.9-12.1 16.9-13.4 0-0.166-0.426-0.553-0.946-0.86-1.44-0.851-1.83-2.09-1.14-3.62 0.767-1.7 2.15-2.97 3.08-2.84 1.18 0.169 1.62 1.39 1.43 3.96-0.148 1.99-0.096 2.29 0.462 2.64 0.801 0.5 0.795 1.41-0.0234 3.78-0.855 2.47-0.96 4.73-0.254 5.44 0.497 0.498 0.591 0.475 1.41-0.34l0.873-0.873-0.21 1.07c-0.274 1.4-1.21 2.65-2.08 2.77-0.536 0.0796-0.802-0.155-1.17-1.03-0.659-1.58-0.594-2.87 0.291-5.81 0.692-2.3 0.717-2.59 0.27-3.1-0.77-0.874-1.18-0.689-2.63 1.19-3.6 4.67-9.53 8.97-15.4 11.2-1.19 0.447-2.16 0.745-2.16 0.662zm19.6-17.6c-0.12-1.63-1.05-2.18-2.19-1.3-0.601 0.462-0.585 0.508 0.499 1.43 1.31 1.12 1.78 1.08 1.7-0.131zm-81.7 15.4c0-0.106 1.85-1.12 4.12-2.26 2.27-1.14 4.22-2.32 4.34-2.63 0.525-1.37-2-1.74-6.46-0.938-2.18 0.39-2.32 0.38-2.32-0.166 0-0.32 0.432-1.07 0.96-1.67 1.16-1.32 2.84-1.81 6.14-1.81 2.78 0.0022 4.62 0.453 5.04 1.24 0.894 1.67-3.9 6.23-7.92 7.53-1.85 0.598-3.9 0.971-3.9 0.713zm56-8.97c0-0.0708 2.25-1.47 5-3.12 2.75-1.64 5.64-3.55 6.42-4.23l1.41-1.24-0.96-0.678c-1.95-1.38-1.94-3.09 0.0314-5.06 1.01-1.01 1.45-1.23 2.25-1.15 1.24 0.122 1.58 1.11 1.16 3.33-0.26 1.39-0.214 1.61 0.492 2.35 0.724 0.763 0.745 0.88 0.311 1.7-0.538 1.02-0.695 1.05-1.63 0.398-0.642-0.45-0.732-0.42-1.35 0.45-0.814 1.14-4.42 3.83-6.58 4.91-1.38 0.691-6.01 2.48-6.42 2.48-0.0775 0-0.141-0.0579-0.141-0.129zm14-12.1c-0.108-1.12-0.936-1.51-1.86-0.876-0.407 0.277-0.343 0.449 0.418 1.12 1.2 1.06 1.56 1 1.44-0.246zm-17.8 0.8c-0.957-3.11-1.79-4.35-2.75-4.11-1.17 0.293-2.57-1.03-2.29-2.15 0.117-0.468 0.569-1.08 1-1.37 0.734-0.481 0.862-0.475 1.83 0.0903 1.13 0.655 2.66 3.13 2.99 4.82 0.218 1.12 0.772 1.43 0.772 0.434 0-1.23 1.32-4.83 2.12-5.78 0.952-1.13 1.78-1.24 2.68-0.335 0.653 0.653 0.875 2.38 0.348 2.7-0.16 0.0991-0.731-0.0722-1.27-0.381-0.882-0.506-1.03-0.513-1.47-0.0653-0.273 0.273-0.866 2-1.32 3.83-1.3 5.25-1.65 5.56-2.65 2.31zm-61.4 0.426c-0.839-0.723-0.896-0.927-0.865-3.12 0.0325-2.32 0.552-4.3 2.03-7.75 0.912-2.13 1.08-1.73 0.343 0.78-1.07 3.62-1.37 5.96-0.902 6.93 0.591 1.21 1.08 1.25 2.17 0.149 1.09-1.09 1.18-0.813 0.45 1.34-0.451 1.32-1.42 2.45-2.1 2.45-0.127 0-0.635-0.348-1.13-0.774zm40.4-2.73c-1.37-0.863-2.56-1.64-2.65-1.74-0.154-0.154 1.85-4.02 2.55-4.91 0.23-0.294 0.98 0.066 2.98 1.43l2.68 1.82-0.84 1.45c-0.462 0.796-1.15 1.91-1.53 2.48l-0.693 1.03zm-20.9-2.71c-0.207-0.775-0.741-2.23-1.19-3.24-0.688-1.56-0.91-1.8-1.49-1.65-0.754 0.197-2.04-0.506-2.34-1.28-0.236-0.616 0.988-2.66 1.59-2.66 0.244 0 0.945 0.441 1.56 0.979 1.11 0.974 2.43 3.78 2.43 5.17 0 1.21 0.341 0.387 1-2.42 0.754-3.2 1.71-4.85 2.81-4.85 1.06 0 2.04 1.4 1.77 2.5-0.255 1.02-0.798 1.1-1.35 0.217-0.917-1.47-1.77-0.224-2.65 3.87-0.679 3.17-1.2 4.77-1.56 4.77-0.118 0-0.384-0.634-0.592-1.41zm45.3-9.42c-0.291-0.322-0.53-1.08-0.53-1.69 0-2.18 2.25-8.82 3.19-9.4 0.675-0.417 0.745 0.0983 0.198 1.47l-0.537 1.34 0.938 0.992c1.27 1.34 1.65 2.17 1.65 3.56 0 1.69-0.834 3.22-2.07 3.8-1.39 0.66-2.19 0.638-2.84-0.0805zm2.44-2.09c0.566-0.237 1.22-0.654 1.44-0.927 0.35-0.422 0.231-0.646-0.793-1.49-1.51-1.25-1.87-1.24-2.31 0.0147-0.605 1.74-0.452 2.53 0.539 2.81 0.0496 0.0139 0.554-0.168 1.12-0.405zm-49.2 1.42c-0.651-0.72-0.747-3.69-0.186-5.78 0.436-1.62 1.57-4.31 1.75-4.13 0.0714 0.0714-0.148 1.13-0.488 2.36-0.623 2.25-0.782 4.16-0.424 5.1 0.31 0.808 1.6 0.601 2.33-0.374l0.661-0.88-0.465 1.6c-0.449 1.55-1.41 2.72-2.23 2.72-0.217 0-0.645-0.276-0.951-0.614zm24.4-5.07c-0.614-0.773-0.679-1.15-0.534-3.12 0.0909-1.23 0.474-3.16 0.852-4.28 0.727-2.16 1.95-4.93 2.11-4.77 0.0515 0.0515-0.246 1.27-0.662 2.7-1.03 3.56-1.3 6.17-0.709 6.96 0.611 0.815 1.82 0.494 2.55-0.674 0.704-1.14 0.745-0.354 0.0801 1.53-0.931 2.64-2.38 3.29-3.68 1.66z" strokeWidth=".32" />
              </svg>
            </div>
            <div className='title_of_chapter'>
              <p> Юсуф алайҳис-салом  </p>
              <p>қиссаси</p>
            </div>
          </div>

          <div className='decor_line'>
            {/* <p> &#8213;&#8213;  &#10044; &#8213;  &#10044;  &#8213;  &#10044;  &#8213;&#8213;   </p> */}
          </div>


          <div className='main_text'>
            <p className='boldItalic'>
              «Дарҳақиқат, Юсуф ва унинг оға-инилари (қиссаси) да сўрагувчилар учун оят-ибратлар бор эди» (Юсуф сураси, 12:7).
            </p>
          </div>

          <div className='paragraph_heading'>
            <p>  ЮСУФ (А.С.) НИНГ ТУШЛАРИ </p>
          </div>

          <div className='main_text'>
            <p className='boldItalic'>
              «Биз сенга ушбу Қуръонда ваҳий қилган нарсамиз ила энг гўзал қиссани ҳикоя қилурмиз. Агарчи ундан олдин сен бундан бехабарлардан бўлсанг ҳам. Эсланг, Юсуф отасига деган эди: «Эй ота, мен тушимда ўн бир юлдузни, яна қуёш ва ойни кўрибман. Ҳаммаси менга сажда қилишаётган эмиш» (12:3-4).
            </p>
            <p></p>
          </div>
          <div className='main_text'>
            <p className=''>
              Юсуф (а.с.) оилада ўн биринчи ўғил эди. Яъқуб (а.с.) уни бошқа болаларига қараганда кўпроқ яхши кўрар, кексайганда кўрган ўғлим, деб кўп эркалар эди.
              Буни эса акалари кўролмас эдилар.  Юсуф (а.с.) ўгай акалари билан бирга отасининг қўй-эчкиларини боқар ва қачон акалари бирон ёмон иш қилганини кўрса ё эшитса, келиб отасига айтар эди. Ўн етти ёшга кирганида  отаси унга қимматбаҳо рангбаранг кўйлак тиктирди. Шундан сўнг акалари Юсуф (а.с.) га яхши гап гапирмай қўйдилар.
            </p>
            <p>
              Бир куни у туш кўради ва акаларига:
              «Кечаси туш кўрибман. Тушимда ҳаммамиз далада бошоқ боғлаётган эканмиз.
              Қарасам, менинг боғим ётган жойидан турди. Сизларники эса меникининг атрофида тўпланиб, унга таъзим қилди», дейди.
              Шунда акалари уни бадтар ёмон кўриб қолади: «Нима?! Нима дединг? Энди устимиздан подшоҳ бўлмоқчимисан?»
            </p>
            <p>
              Орадан ҳеч қанча вақт ўтмай Юсуф (а.с.) яна туш кўради ва акаларига: «Мен яна туш кўрдим. Тушимда қуёш, ой ва ўн бир юлдуз менга таъзим қилаётган экан», дейди.
            </p>
            <p>
              Кейин отасига ҳам айтган эди, отаси уни койиди: «Бу қандай туш экан? Нахотки мен, онанг ва акаларинг келиб сенинг олдингда таъзим қилсак?» деди отаси танбеҳ бериб.
              Лекин ўғлининг тушлари Яъқуб (а.с.) ни ўйлантириб қўйган эди.
            </p>
            <p className="boldItalic">
              «Кейин у: «Жон болам, тушингни акаларингга айтма. Яна улар сенга бирор ҳийла қилмасинлар. Албатта, шайтон инсонга очиқ-ойдин душмандир, — деди. — Раббинг сени шу йўсинда танлаб олади, сенга тушларнинг таъбирини ўргатади ва сенга ва Яъқуб аҳлига, худди оталаринг Иброҳим ва Исҳоққа батамом қилганидек, ўз неъматини батамом қилиб беради» (Қуръон 12:5-6).
            </p>
            <p className="vitalic">
              Лекин Юсуф (а.с.) тушини акаларига айтиб қўйган эди.
            </p>
          </div>

          <div className='paragraph_heading'>
            <p>
              АКАЛАРИНИНГ РЕЖАСИ
            </p>
          </div>

          <div className='main_text'>
            <p className="boldItalic">
              <span className="vitalic">Акалари ҳасад қилиб: </span> «Отамиз Юсуф билан Бинёминни биздан кўра кўпроқ яхши кўради. Ҳолбуки, биз кўпчиликмиз, отамиз адашяпти», <span className="vitalic">  дер эдилар. Шунга “Юсуфни йўқ қилиш керак”, деган қарорга келдилар. Кейин Яъқуб (а.с.) нинг олдига бориб дедилар: </span>
              «Эй отамиз, нега Юсуфни бизга ишонмайсан? Ҳолбуки, биз унга ихлос қилувчилармиз. Эртага уни биз билан юбор, еб-ичиб, ўйнаб келади. Албатта, биз уни муҳофаза қиламиз». (Отаси эса) деди: «Уни олиб кетишингиз мени хафа қилади. Сиз ғофил қолсангиз, уни бўри еб кетишидан қўрқаман» <span className="vitalic"> (Қуръоннинг Юсуф сураси, 11-14 оятлар).</span>
            </p>
          </div>

          <div className='paragraph_heading'>
            <p>
              ИНСОНМИ Ё ФАРИШТА?
            </p>
          </div>

          <div className='main_text'>
            <p>
              Орадан бир қанча вақт ўтди. Юсуф (а.с.) нинг акалари сурувларни Шакамга олиб кетишган эди. Бир куни Яъқуб (а.с.) Юсуфга:
              «Шакамга бориб акаларингдан хабар ол. Кўр қани, яхши юришибдими, сурувлар қандай экан?» деди. Юсуф (а.с.) хўп бўлади, деб Шакамга жўнади.
            </p>
            <p>
              Шакам даштида бир одам олдидан чиқиб: «Нима излаяпсан?» деб сўради.
              «Акаларимни излаяпман. Қўй боқиб юришган эди. Кўрмадингизми?» деди Юсуф (а.с.).
            </p>
            <p></p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'

              style={{ display: visibleBubbles[1] ? 'block' : 'none' }}
              onClick={() => handleSupClick(1)}


            >
              <p>
                <sup>1</sup> Масофа тахминан 70 ки­ло­метр эди.
              </p>
            </div>
            <p onClick={() => handleSupClick(1)}>
              «Улар бу ерда эмас. Мен уларнинг Дўтонга борамиз, деганини эшитувдим», деди у одам. Кейин Юсуф (а.с.) акаларининг ортидан Дўтонга кетдилар.<sup>1</sup>
            </p>
          </div>


          <div className='paragraph_heading'>
            <p>
              НАФРАТ НИМАЛАРГА ОЛИБ КЕЛМАЙДИ ...
            </p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'

              style={{ display: visibleBubbles[2] ? 'block' : 'none' }}
              onClick={() => handleSupClick(2)}


            >
              <p>
                <sup>2</sup>  Қизиғи, улар Юсуф (а.с.) ни кўрган тушлари учун ўлдирмоқчи эдилар. Лекин уларнинг ёмон нияти у кишининг айни тушлари кейинчалик амалга ошиши учун хизмат қилди.
              </p>
            </div>
            <p onClick={() => handleSupClick(2)}>
              Акалари Юсуф (а.с.) ни узоқдан кўриб ўлдиришга режа туздилар.  «Ана, туш соҳиби келяпти! — дер эдилар бир-бирларига. Келинглар, ўлдириб бир қудуққа ташлаймиз. Кейин отамизга бўри еб кетибди, деймиз. Тушлари нима бўлишини шунда кўрамиз!»<sup>2</sup>
            </p>
            <p>
              «Йўқ, қўйинглар, қўлимизни қонга булғамайлик.
              Яхшиси тириклайин қудуққа ташлаймиз, ўзи ўлади», деди Роавбин (р.а.) укасини қутқариш учун. У кейин Юсуф (а.с.) ни қудуқдан яширинча чиқариб отасининг олдига олиб бормоқчи эди.
            </p>
            <p></p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'

              style={{ display: visibleBubbles[3] ? 'block' : 'none' }}
              onClick={() => handleSupClick(3)}


            >
              <p>
                <sup>3</sup>      Қуръонда бу ҳақда бундай дейилган: «(Юсуфни) олиб бориб қудуқ қаърига ташлашга қарор қилганларида, Биз (Юсуфга): «Сен, албатта, уларга бу қилмишларининг хабарини берасан, ўшанда улар сени сезмаслар ҳам», деб ваҳий қилдик» (12:15).
              </p>
            </div>

            <p onClick={() => handleSupClick(3)}>
              Шундай қилиб, Юсуф (а.с.) келиши билан, акалари уни ушлаб, устидаги ранг-баранг кўйлагини ечиб олиб,  ўзини суви йўқ эски бир қудуққа ташладилар.<sup>3</sup>
            </p>
          </div>

          <div className='paragraph_heading'>
            <p>
              Яҳузо (р.а.) дан чиққан фикр
            </p>
          </div>

          <div className='main_text'>
            <p>
              Таом ейишга ўтирганларида узоқдан келаётган бир карвонга кўзлари тушди. Карвондагилар Жилъоддан Мисрга атир-упа ва зираворлар олиб кетаётган исмоилий тожирлар эди.
            </p>
            <p></p>
          </div>

          <div className='main_text'>

            <div className='speech-bubble'

              style={{ display: visibleBubbles[4] ? 'block' : 'none' }}
              onClick={() => handleSupClick(4)}


            >
              <p>
                <sup>4</sup>   Ибн Асир, “Комил”, 1-жилд, 139-бет.
              </p>
            </div>
            <p onClick={() => handleSupClick(4)}>

              Шунда Яҳузо (р.а.): «Юсуфни ўлдиргандан нима фойда?
              Келинглар уни исмоилийларга сотамиз. Ҳар ҳолда укамиз-ку», деди. Бу гап ака-укаларга маъқул тушди.<sup>4</sup>
            </p>
            <p className="boldItalic">

              «Ва йўловчилар келиб (қудуққа) сувчиларини юбордилар. Бас, у челагини ташлади ва: «Суюнчи беринглар! Бу бола-ку!», деди. (Акалари) уни тижорат молидек яшириб қўйган эдилар. Зотан, Оллоҳ уларнинг нима қилаётганларини билгувчи зотдир. Ва уни арзон баҳога, саноқли дирҳамларга сотдилар. Улар Юсуфни назарга илмаган эдилар» (12:19-20).
            </p>
            <p>
              Шундай қилиб, акалари Юсуф (а.с.) ни қудуқдан чиқариб, йигирма кумуш тангага тожирларга сотдилар ва тожирлар уни ўзлари билан Мисрга олиб кетишди.
            </p>
          </div>

          <div className='paragraph_heading'>
            <p>
              ҚОНГА БЎЯЛГАН КЎЙЛАК
            </p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'

              style={{ display: visibleBubbles[5] ? 'block' : 'none' }}
              onClick={() => handleSupClick(5)}


            >
              <p>
                <sup>5</sup>  Салабий, “Ароис”, 114-бет.
              </p>
            </div>
            <p onClick={() => handleSupClick(5)}>
              Карвон келганда Роавбин (р.а.) у ерда йўқ эди. Келиб қараса, укаси қудуқда йўқ. Шунда у мусибатдан ёқасини йиртиб, укаларининг олдига келди. «Юсуф йўқ, энди нима қиламан?! Отамга нима дейман?» деб дод-фарёд қилди.  Кейин улар бир така сўйиб, қонига Юсуф (а.с.) нинг кўйлагини булаб:<sup>5</sup> «Мана бу кўйлакни даштдан топиб олдик. Қаранг-чи, Юсуфники эмасми?» деб оталарига жўнатдилар. Яъқуб (а.с.) кўйлакни дарров танидилар: «Ҳа, Юсуфнинг кўйлаги, Юсуфнинг кўйлаги! Нима, у бўрига ем бўпдими?»
            </p>
            <p className="vitalic">
              Қуръони каримда ёзилишича у киши кейин:
              <span className="boldItalic"> «Йўқ! Ҳавои нафсингиз сизни йўлдан урибди...»</span>  <span className="vitalic">  деб айтганлар (12:18).</span>
            </p>
            <p></p>
          </div>


          <div className='main_text'>

            <div className='speech-bubble'

              style={{ display: visibleBubbles[6] ? 'block' : 'none' }}
              onClick={() => handleSupClick(6)}


            >
              <p>
                <sup>6</sup>   Қуръон 12:86.
              </p>
            </div>

            <p onClick={() => handleSupClick(6)}>
              Кейин қайғудан кийимларини йиртиб, белига бўз ўрадилар. Кўп кунлар ўғлини соғиниб йиғладилар.  Ўғил-қизлари қанча тасалли беришмасин, ҳеч фойдаси йўқ эди.  <span className="boldItalic"> «Mен дарду ҳасратимни фақат Оллоҳнинг Ўзига шикоят қилмоқдаман ва Оллоҳдан сиз билмаган нарсани биламан.</span><sup>6</sup>    Энди то қабрга киргунимча унинг ғами билан ўтаман», дер ва яна ўғлини соғиниб зор-зор йиғлар эдилар.
            </p>
            <p>
              Тожирлар Мисрга келиб, Юсуф (а.с.) ни фиръавн амалдорларидан бирига, сарой қўриқчиларининг бошлиғи бўлган Фўтифорга сотдилар.
            </p>
          </div>

          <div className='paragraph_heading'>
            <p>
              ЮСУФ (А.С.) МИСРДА
            </p>
          </div>

          <div className='main_text'>
            <p className='vitalic'>
              Қуръонда ёзилганки: <span className="boldItalic"> «Мисрда сотиб олган (одам) ўз хотинига: «Уни яхшилаб жойлаштир, шояд бизга манфаат берса ёки бола қилиб олсак», деди. Шундай қилиб, тушларнинг таъбирини ўргатишимиз учун Юсуфни жойлаштирдик»</span> (Юсуф сураси 12:21).
            </p>

            <p>
              Ҳазрати Юсуфнинг Мисрдаги ҳаёти ана шундоқ бошланди. Оллоҳ таоло доим у билан бирга эди, ҳар бир ишда унга барака берарди.  Худонинг у билан бирга эканини, ҳар қандай ишга қўл урса, самара билан тугаётганини кўриб, Фўтифор Юсуф (а.с.) ни ёқтириб қолди ва бутун хонадонини, бутун мол-давлатини унга ишониб топширди.
            </p>
            <p>
              Ўша кундан бошлаб Оллоҳ таоло Юсуф сабабли Фўтифорнинг уйини баракалай бошлади. Уйида ҳам, экинларида ҳам, сурувларида ҳам Худонинг баракаси кўриниб турган эди.
              Шундан сўнг Фўтифор, нима еб-нима ичишини ҳисобга олмаса, рўзғор ташвишидан бутунлай озод бўлди. Ҳар қандай ишни ҳазрати Юсуфнинг ўзи ҳал қилар эдилар.
            </p>
          </div>

          <div className='paragraph_heading'>
            <p>
              ШАҲВАТ ВА ТУҲМАТ
            </p>
          </div>

          <div className='main_text'>
            <p>
              Юсуф (а.с.) қадди-қомати келишган, чиройли йигит эдилар.  Шунга Фўтифорнинг хотини унга кўз тикишни бошлади. Кейин бир куни унинг олдига келиб: «Юр, мен билан ёт», деб буйруқ қилди.
            </p>
            <p>
              Юсуф (а.с.) кўнмадилар: «Бегойим, хўжайин ишониб, уйдаги ҳамма нарсани менга топшириб қўйган.  Энг катта вазифага тайинлаган. Сиздан бошқа ҳамма нарсасини менинг ихтиёримга берган. Ахир сиз унинг хотинисиз-ку! Мен қандоқ бу ёмон ишга қўл урай!? Қандай Худога қарши гуноҳ қилай?» дедилар.
            </p>
            <p>
              Фўтифорнинг хотини ҳар куни гапирар, лекин Юсуф (а.с.) ҳеч у билан ётишга кўнмас, иложи борича ундан қочиб юрар эдилар.  Бир куни бир иш билан уйга кирса, ичкарида ҳеч ким йўқ экан.
            </p>
            <p></p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'

              style={{ display: visibleBubbles[7] ? 'block' : 'none' }}
              onClick={() => handleSupClick(7)}


            >
              <p>
                <sup>7</sup>  Қуръон 12:25.
              </p>
            </div>

            <p onClick={() => handleSupClick(7)}>
              Шунда Фўтифорнинг хотини келиб, уни кўйлагидан ушлади: «Кел, келақол! Мен билан ёт!» деди. Юсуф (а.с.) ташқарига қочиб<sup>7</sup> чиқдилар.
              Бироқ кўйлаги йиртилиб, хотиннинг қўлида қолди. Унинг қочганини кўриб
              хотин додлай бошлади: «Эрим ана у иброний қулни бизни масхара қилиш учун олиб келган экан! У мени зўрламоқчи бўлди!  Қичқирган эдим, мана, кўйлагини ташлаб қочди».
            </p>
            <p>
              Кейин то эри келмагунча Юсуф (а.с.) нинг кўйлагини ҳеч кимга бергани йўқ.  Эри келгач, хотин тўқиган достонини эрига ҳам айтди: «Олиб келган мана бу иброний қулингиз номусимга тажовуз қилмоқчи бўлди, обрўйимни тўкмоқчи бўлди.  Қичқирган эдим, кўйлагини ташлаб қочди», деди.
            </p>
            <p></p>
          </div>

          <div className='main_text'>
            <div className='speech-bubble'

              style={{ display: visibleBubbles[8] ? 'block' : 'none' }}
              onClick={() => handleSupClick(8)}


            >
              <p>
                <sup>8</sup>  Қуръон 12:26-27.
              </p>
            </div>

            <p onClick={() => handleSupClick(8)}>
              Хотинининг гапини эшитиб Фўтифор қаттиқ ғазабланди. <span className="vitalic">Кейин воқеани тафтиш қилди. Қуръони каримда бу ҳақда: </span> <span className="boldItalic">«Хотиннинг аҳлидан бир шоҳид гувоҳлик берди ва: «Агар унинг кўйлаги олд томондан йиртилган бўлса, бас, хотин рост айтибди, у ёлғончилардандир. Агар унинг кўйлаги орт томондан йиртилган бўлса, бас, хотин ёлғон гапирибди, у ростгўйлардандир», деди»,</span> <sup>8</sup> <span className="vitalic">деб ёзилган оят бор.</span>
            </p>
            <p>
              Шу билан, Юсуф (а.с.) айбдор бўлмаса ҳам,  Фўтифор уни зиндонга, подшоҳнинг бандилари сақланадиган жойга ташлади.
            </p>
          </div>


          <div className='main_text'>
            <p></p>
            <p className="vitalic">
              (Қуръони каримда ёзилишича, Юсуф (а.с.) зиндонга тушишидан олдин шаҳар аёллари Фўтифорнинг хотинини айблаб сўз қиладилар. Чунки олийнасаб хотиннинг бир хорижий қулга ишқи тушгани уятли бир ҳол эди. Шунда Фўтифорнинг хотини шаҳар аёлларини меҳмонга чақириб, қўлларига пичоқ беради. Кейин Юсуф (а.с.) ни чақиради. Шунда шаҳар аёллари у кишини кўриб: «Бу — инсон эмас, фаришта!» деб ҳайратга тушиб, қўлларини кесиб олган эканлар.)
            </p>
          </div>

          <div className='paragraph_heading'>
            <p>
              ЮСУФ (А.С.) ЗИНДОНДА
            </p>
          </div>

          <div className='main_text'>
            <p>
              Бироқ Оллоҳ таоло ўша ерда ҳам Юсуф (а.с.) билан бирга эди. Юсуфга меҳрибонлик қилиб, зиндон бошлиғининг қалбида Юсуфга нисбатан меҳр уйғотди.  Шунинг учун ҳам, орадан кўп вақт ўтмай, ҳазрати Юсуф зиндонга жавобгар этиб тайинланди ва зиндондаги ишларни идора қила бошлади.
            </p>
            <p>
              Ўшандан сўнг зиндон бошлиғи Юсуф (а.с.) масъул бўлган ишларга аралашмай қўйди. Чунки Оллоҳ таоло ҳар бир ишда Юсуф (а.с.) га ёрдам берар, ҳамиша у билан бирга эди.
            </p>
            <p></p>
          </div>



          <article className='nav_arrows'>
            <div className='flex_it space_between'>


              <div style={{ marginLeft: '0px' }}
                onClick={() => navigate(-1)}>
                <div>
                  <span className='left_arrow_span'>&#8592;</span>
                </div>
                <div className='indicator'>
                  <span className=' bottom_arrows_for_qisas' > орқага қайтиш </span>
                </div>
              </div>

              <div className='central_div'>
                <div>
                  <p>Юсуф (а.с.) қиссаси </p>
                </div>
              </div>

              <div style={{ marginRight: '0px' }} onClick={() => navigate('/qisas-uzbek/dreams-chapter')}>
                <div className='indicator'>
                  <span className=' bottom_arrows_for_qisas' >  Тушлар боби </span>
                </div>
                <div>
                  <span className='right_arrow_span' >&#8594;</span>
                </div>
              </div>

            </div>
          </article>
         
        </main>
        <aside></aside>
      </div>
    </div >
  )
}

export default Adam
