// const emojiArray = [
//   "&#128512",   // 😀 - Grinning Face
//   "&#128514",   // 😂 - Face with Tears of Joy
//   "<span style='color: red;'>&#10084;</span>", // ❤ - Red Heart
//   "&#128577",   // 😢 - Crying Face (Sad Face)
//   "&#129300",   // 🤔 - Thinking Face
//   "&#128591",   // 🙏 - Folded Hands
//   "&#127800",   // 🌸 - Cherry Blossom
//   "&#9728"      // 🌞 - Sun with Face
// ]
const emojiArray = [
  '😀',
  '😉',
  '😂',

  "😢",   //  - Crying Face (Sad Face)
  "🤔",   //  - Thinking Face

  '🙄',
  '🤗',
  '🙁',
  '🥱',

  '👍',
  '💪',
  // [' ', ' ', ' ',],
  // [' ', ' ', ' ',],
  "⏲",
  '💯',
  '🆗',
  '👋',
  '🌺',
  "🙏",
  '🧎‍♂️',
  '🧎‍♀️',
  '🕊',
  '🪔',
  '📖',
  "🛐",
  '🕌',
  '☪',
  '☦',
  '✡',
  // [' ', ' ', ' ',],
  // [' ', ' ', ' ',],
  '🫖',
  '🍽',
  '🔹',
  '🔶',
  '🌧',
  '🌨',
  '🎄',
  '🎈',
  '🎁',
  '⚽',
  '🪫',
  '🚽',
  '🚿',
  '🛒',
  // [' ', ' ', ' ',],
  // [' ', ' ', ' ',],
  '🇰🇿',
  '🇺🇿',
  '🇹🇷',
  '🇺🇸',
  '🇳🇱',
]

export default emojiArray
